Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# ++CODE++bcfc420c0358eb6f248fa6328797cfa38fa121baea6320a623280a0d34eeee75
source: This file was exported with a newer version of the extension. Please update your extension to import this file.
pt_br: Este arquivo foi exportado com uma versão mais recente da extensão. Atualize sua extensão para importar este arquivo.
zh_cn: 此文件是使用较新版本的扩展导出的。请更新扩展以导入此文件。

# ++CODE++75670337a398f9840d2951dbc6746497caec6da9dd506ecff57ef79d59c6280f
source: Thumbs Down
cs: Palec dolů
fr: Pouce vers le bas
it: Pollice giù
pt_br: Polegar para Baixo
zh_cn: 差评

# ++CODE++8b1d85ebb8ecdb644b32f92089716c40b0f7dd2df4b43b3bdbaeba904deecfad
source: Thumbs Up
cs: Palec nahoru
fr: Pouce vers le haut
it: Pollice su
pt_br: Polegar para Cima
zh_cn: 好评

# ++CODE++75d0f748a196d70fe132e890ca21172baae3169ee3f9aa48c27aed5fbe5965bf
source: Timestamp: {0}
fr: Horodatage : {0}
pt_br: Carimbo de data/hora: {0}
zh_cn: 时间戳: {0}

# ++CODE++4f8c4d58a87feaaff06fd5f9cb84370ab4a42220bf1e8cbedbca716f8f21c9ee
source: To know more, see <a href="https://go.microsoft.com/fwlink/?linkid=2206366">Copilot in Power Pages documentation.
cs: Další informace najdete v dokumentaci <a href="https://go.microsoft.com/fwlink/?linkid=2206366"> Copilota v Power Pages.
fr: Pour en savoir plus, consultez <a href="https://go.microsoft.com/fwlink/?linkid=2206366">la documentation Copilot dans Power Pages.
it: Per altre informazioni, vedi la <a href="https://go.microsoft.com/fwlink/?linkid=2206366">documentazione di Copilot in Power Pages.
pt_br: Para saber mais, consulte a <a href="https://go.microsoft.com/fwlink/?linkid=2206366">documentação do Copilot no Power Pages.
zh_cn: 要了解更多信息，请参阅 <a href="https://go.microsoft.com/fwlink/?linkid=2206366">Power Pages 中的 Copilot 文档。

# ++CODE++ea93d6a262ecb87a9fa4d09edbd7654c046597936a8e235fc3949eb01775ff99
source: Tools
pt_br: Ferramentas
zh_cn: 工具

# ++CODE++9ffd094afb84d3a84bbf1b4ec8210ba5344169e9b2726ce366ccf3e231b7e9b7
source: Total Changes
pt_br: Total de Alterações
zh_cn: 总更改数

# ++CODE++4a7c431a6572c68bba17c3a5d858adbf5112462574953baf4d7d2fd0619807fe
source: Try @powerpages with GitHub Copilot
cs: Vyzkoušet @powerpages s GitHub Copilotem
fr: Essayer @powerpages avec GitHub Copilot
it: Prova @powerpages con GitHub Copilot
pt_br: Tente @powerpages com o GitHub Copilot
zh_cn: 尝试将 @powerpages 与 GitHub Copilot 一起使用

# ++CODE++d8b8392e2c542950ca64867168e4ef87d4ad606882d5898f826b51c6d553988f
source: Try again
cs: Zkusit znovu
es: Volver a intentarlo
fr: Réessayer
it: Riprova
ja: やり直す
pt_br: Tentar novamente
ru: Повторить попытку
tr: Yeniden dene
zh_cn: 重试

# ++CODE++dabe9e12f081a01200dc7e96c5ae45a75ca20e6805dcf047778012f41ee33f31
source: Try and be as specific as possible. Your feedback will be used to improve Copilot. <a href="https://privacy.microsoft.com/en-US/data-privacy-notice"> View privacy details </a>
cs: Snažte se být co nejkonkrétnější. Vaše názory budou použity ke zlepšení Copilota. <a href="https://privacy.microsoft.com/en-US/data-privacy-notice">Zobrazit podrobnosti o ochraně soukromí</a>
fr: Essayez d’être aussi précis que possible. Vos commentaires serviront à améliorer Copilot. <a href="https://privacy.microsoft.com/en-US/data-privacy-notice"> Afficher les détails sur la confidentialité </a>
it: Prova a essere il più specifico possibile. Il tuo feedback verrà utilizzato per migliorare Copilot. <a href="https://privacy.microsoft.com/en-US/data-privacy-notice"> Visualizza i dettagli sulla privacy</a>
pt_br: Descreva da forma mais específica possível. Seus comentários serão usados para melhorar o Copilot. <a href="https://privacy.microsoft.com/en-US/data-privacy-notice"> Exibir detalhes de privacidade </a>
zh_cn: 尽量说得具体一点。您的反馈将用于改进 Copilot。<a href="https://privacy.microsoft.com/en-US/data-privacy-notice">查看隐私详细信息</a>

# ++CODE++34077c1b18e274ca17c858b0521d9ff1edd6a164eccb2a24888fc6ed0eb3df35
source: Unable to clear cache
fr: Impossible d’effacer le cache
it: Impossibile eliminare la cache
pt_br: Não é possível limpar o cache
zh_cn: 无法清除缓存

# ++CODE++bd7b156375b48ce5797a3421150e6f5c3b71d3a30f823e957241589aea6236ca
source: Unable to complete the request
cs: Žádost nelze dokončit.
es: No se puede completar la solicitud
fr: Impossible de traiter la demande
it: Impossibile completare la richiesta
ja: 要求を完了できません
pt_br: Não foi possível concluir a solicitação
ru: Не удается завершить запрос
tr: İstek tamamlanamadı
zh_cn: 无法完成请求

# ++CODE++bab36b47fe2dd4f2f7e8eb486f2e3546e27dc047e69f5b24307bc71e5be2a7cf
source: Unable to find that app
cs: Tuto aplikaci nelze najít.
es: No se puede encontrar esa aplicación
fr: Impossible de trouver cette application
it: Impossibile trovare tale app
ja: そのアプリが見つかりません
pt_br: Não é possível encontrar esse aplicativo
ru: Не удалось найти приложение
tr: Bu uygulama bulunamadı
zh_cn: 找不到该应用

# ++CODE++01e5c349da59b88cb8c4552d036f670c1a5d824abf91fe9539d408e89d9c9445
source: Unable to generate VS Code Desktop URL
fr: Impossible de générer l’URL VS Code Desktop
pt_br: Não é possível gerar a URL do VS Code Desktop
zh_cn: 未能生成 VS Code 桌面 URL

# ++CODE++3747890a3bfddec3123ce9a40cdd15f278d1335b382f80beb52bf18101ab02c2
source: Unable to locate website root folder.
fr: Impossible de localiser le dossier racine du site web.
it: Impossibile individuare la cartella radice del sito Web.
pt_br: Não é possível localizar a pasta raiz do site.
zh_cn: 找不到网站根文件夹。

# ++CODE++f9a23abc4576c688d711c764a407284b25ce2966126f30d987dc1afaea7b9603
source: Unable to read file contents
pt_br: Não é possível ler o conteúdo do arquivo
zh_cn: 无法读取文件内容

# ++CODE++36009f87dbdc8f4572776ef202667a9a1b4efe72a00c620b0adac0de2e0fbece
source: Unable to read local file
pt_br: Não é possível ler o arquivo local
zh_cn: 无法读取本地文件

# ++CODE++e7120fe32babf1b3300650ac52f6cd3e9853405cd3cd836c798ff8be909bab88
source: Unable to read one or both files
pt_br: Não é possível ler um ou ambos os arquivos
zh_cn: 无法读取一个或两个文件

# ++CODE++4c21988362b9693a86433c1ba0c1837d2196594dd38ae3dd1e8b5af0df712f5c
source: Unable to read remote file
pt_br: Não é possível ler o arquivo remoto
zh_cn: 无法读取远程文件

# ++CODE++b6038584b7b1f565be9c9d3f0ac11be70bd2e69e072ead52884ca7338a14ee67
source: Unique name: {0}
fr: Nom unique : {0}
it: Nome univoco: {0}
pt_br: Nome exclusivo: {0}
zh_cn: 唯一名称: {0}

# ++CODE++b764cdc0eab7137467211272fa539f1260d1bf2e71bcf6ff3bdc960f5c16aa14
source: Unknown
pt_br: Desconhecido
zh_cn: 未知

# ++CODE++4b8d64fae5d1cbf5f7324782e9b5c430db7c218771e84b0b402a9a4d0ec4bf05
source: Unmanaged
cs: Nespravováno
fr: Non géré
it: Non gestita
ja: アンマネージド
pt_br: Não gerenciado(a)
ru: Неуправляемые
tr: Yönetilmeyen
zh_cn: 非托管

# ++CODE++6af7f93689dd7163536bf6cd39d6c0c70f321dff3d5e661b144b3667f9526977
source: Unsupported version. This file was created with a newer version of the extension.
pt_br: Versão sem suporte. Este arquivo foi criado com uma versão mais recente da extensão.
zh_cn: 不受支持的版本。此文件是使用较新版本的扩展创建的。

# ++CODE++810c2285d6b0fa110f868e006118426e02a150592009b5f2458e2883d8dcd3c8
source: Update Extension
pt_br: Atualizar Extensão
zh_cn: 更新扩展

# ++CODE++7fce0124a7cb74955461f08e39ceaaed1e2850492f077f4e6defd82ef3ca6b0e
source: Upload changes
fr: Charger les modifications
it: Carica modifiche
pt_br: Carregar alterações
zh_cn: 上传更改

# ++CODE++8a91e7caf57148c6be78b3986477464b36f0282a9e9a09b635b0db4fe6246132
source: Upload failed. Please try again later.
fr: Échec de chargement. Réessayez ultérieurement.
it: Caricamento non riuscito. Riprovare in seguito.
pt_br: Falha de upload. Tente novamente mais tarde.
zh_cn: 上传失败。请稍后重试。

# ++CODE++c86daff3d88f7b1f615467872994ef13dcbc1c55e10105d71f398c721650c9c2
source: Use current site folder
fr: Utiliser le dossier de site actuel
pt_br: Usar a pasta do site atual
zh_cn: 使用当前站点文件夹

# ++CODE++923414ce1803b583f001d5c698b84f3ab0b5ecafb4953d630eab93ae622330bb
source: User cancelled authentication
pt_br: Autenticação cancelada pelo usuário
zh_cn: 用户已取消身份验证

# ++CODE++0b53763063a9819b6dae13d3cd35d034445618c073f88510873b12cd8fa5d66b
source: User cancelled environment switch
pt_br: Alternância de ambiente cancelada pelo usuário
zh_cn: 用户已取消环境切换

# ++CODE++76df7bbbf778aafae0e57613b349235aaee0a97e85a4892f3a28b6ccc4e65232
source: User cancelled folder selection
pt_br: Seleção de pasta cancelada pelo usuário
zh_cn: 用户已取消文件夹选择

# ++CODE++7cf98759b12f73d7717ae27ba49a3d27f026be55b4a33236942882c7a8b671bf
source: User cancelled opening results.
fr: L’utilisateur a annulé l’ouverture des résultats.
pt_br: O usuário cancelou a abertura dos resultados.
zh_cn: 用户已取消打开结果。

# ++CODE++696d5f7b79a75961bc5d99ecbbea7b535acc73160e0b6422daa45b0ae7c04368
source: User: {0}
cs: Uživatel: {0}
es: Usuario: {0}
fr: Utilisateur : {0}
it: Utente: {0}
ja: ユーザー: {0}
pt_br: Usuário: {0}
ru: Пользователь: {0}
tr: Kullanıcı: {0}
zh_cn: 用户: {0}

# ++CODE++ad53df2afe8706d9b2df0b2ce7db974ca00887c2a4864ce1b78ed0fc60ab8669
source: Using custom CodeQL query suite: {0}
fr: Utilisation de la suite de requêtes CodeQL personnalisée : {0}
pt_br: Usando o pacote de consultas CodeQL personalizado: {0}
zh_cn: 正在使用自定义 CodeQL 查询套件: {0}

# ++CODE++ad8cf9b64ea12b5f26438ceb83cd1bb510af7cccaf4c2be1320276486224a0fe
source: Using default query suite: {0}
fr: Utilisation de la suite de requêtes par défaut : {0}
pt_br: Usando o pacote de consultas padrão: {0}
zh_cn: 正在使用默认查询套件: {0}

# ++CODE++4164b3068322daf412659fb28d24b8b18f2d9fcdb160a63980bafbd16134231b
source: VS Code - PAC CLI authentication mismatch detected
fr: VS Code – Incompatibilité d’authentification CLI PAC détectée
pt_br: Incompatibilidade de autenticação entre VS Code e a CLI do PAC detectada
zh_cn: VS Code - 检测到 PAC CLI 身份验证不匹配

# ++CODE++527423ed0138373aa91233083f12eceeae92aa1998e6706d7a260524dafbe6c4
source: Validating authentication...
pt_br: Validando autenticação...
zh_cn: 正在验证身份验证...

# ++CODE++d941ee96c6f480390012381f9fc0dfd961f2aa803732860e2505a8453700f458
source: We encountered an error preparing the files for edit.
cs: Při přípravě souborů k úpravám došlo k chybě.
fr: Nous avons rencontré une erreur lors de la préparation des fichiers à modifier.
it: Si è verificato un errore durante la preparazione dei file per la modifica.
pt_br: Encontramos um erro ao preparar os arquivos para edição.
ru: Произошла ошибка при подготовке файлов к редактированию.
zh_cn: 我们在准备编辑文件时遇到错误。

# ++CODE++ff174a54d200db312e20f9f72e805df5d0221070730c1d789d642185b1a3b3e5
source: Web files
cs: Webové soubory
es: Archivos web
fr: Fichiers web
it: File Web
ja: Web ファイル
pt_br: Arquivos da Web
ru: Веб-файлы
tr: Web dosyaları
zh_cn: Web 文件

# ++CODE++e433d73a7af9f003527cded50fa779687d0f923efc1beb323c3c75fd7062899f
source: Webfile(s) added successfully
cs: Webové soubory byly úspěšně přidány.
es: Sitios web agregados correctamente
fr: Le ou les fichiers web ont été ajoutés
it: Aggiunta file Web completata
ja: 正常に追加された Web ファイルの数
pt_br: Arquivos da Web adicionados com êxito
ru: Веб-файлы успешно добавлены
tr: Web dosyaları başarıyla eklendi
zh_cn: 已成功添加 Web 文件

# ++CODE++00dc171124ab430bbbaae51ec39dda1c5e7d045f382f56b1767d9e733292731c
source: Webpage names should contain only letters, numbers, hyphens, or underscores.
cs: Názvy webových stránek by měly obsahovat jen písmena, číslice, pomlčky nebo podtržítka.
fr: Les noms de page web ne doivent contenir que des lettres, des nombres, des tirets ou des traits de soulignement.
it: I nomi delle pagine Web possono contenere solo lettere, numeri, segni meno e caratteri di sottolineatura.
pt_br: Os nomes de página da Web devem conter somente letras, números, hifens ou sublinhados.
zh_cn: 网页名称应仅包含字母、数字、连字符或下划线。

# ++CODE++ccd9f7afcc6454ab02bcba204f559a9c89947c6e39a7c8651e30799d78ca4fd2
source: Website ID is not available
fr: L’ID de site web n’est pas disponible
pt_br: ID do site não disponível
zh_cn: 网站 ID 不可用

# ++CODE++6a9f7c7cbfe7d5ae5e596c92dc8f1e73e79add5f6c7359c5fd0d61a23a66b668
source: Website ID is required
pt_br: A ID do site é necessária
zh_cn: 网站 ID 是必需的

# ++CODE++a70c63db9e2d7ceb9f17f00065db00262718561d9330fbef203aba4acbf57d7b
source: Website ID not found. Please ensure you have a valid Power Pages site open.
pt_br: ID do site não encontrado. Verifique se há um site válido do Power Pages aberto.
zh_cn: 找不到网站 ID。请确保已打开有效的 Power Pages 网站。

# ++CODE++d3eaa7bf5377b15781ad4c0f43e4da94b9a2bd485ddbbbe62a2c3d53c5c7fe4a
source: Website Id: {0}
fr: ID de site web : {0}
it: ID sito Web: {0}
pt_br: ID do Site: {0}
zh_cn: 网站 ID: {0}

# ++CODE++4f5909ac007d8a897ec18ede71cdf8f6b4af3bbe78bae2f13871d50a3cebb3f6
source: Website Url: {0}
fr: URL du site web : {0}
it: URL sito Web: {0}
pt_br: URL do Site: {0}
zh_cn: 网站 URL: {0}

# ++CODE++aa64cfbb63d3382bc0530c6e599467b1cc5c1ef8ff3b573d37ad628f9058b2aa
source: Website not found in the environment. Please check the credentials and login with correct account.
fr: Site web introuvable dans l’environnement. Veuillez vérifier les informations d’identification et vous connecter en utilisant le bon compte.
it: Sito Web non trovato nell'ambiente. Controlla le credenziali e accedi con l'account corretto.
pt_br: Site não encontrado no ambiente. Verifique as credenciais e faça logon com a conta correta.
zh_cn: 在环境中找不到网站。请检查凭据并使用正确的帐户登录。

# ++CODE++e4bb03b399c07eeda658d87305435a58818cb5e0c3b76ae054d99564cf14ef6b
source: What do you need help with?
cs: S čím potřebujete pomoci?
fr: En quoi avez-vous besoin d’aide ?
it: Per cosa hai bisogno di aiuto?
pt_br: Para qual tópico você precisa de ajuda?
zh_cn: 您需要什么帮助?

# ++CODE++ab06f2880f954cfbc6788988300346315e8372cc05d92ce26ff6635c607e1406
source: Whether it’s HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.
fr: Qu’il s’agisse de code HTML, CSS, JS ou Liquid, décrivez simplement ce dont vous avez besoin et laissez l’IA le construire pour vous.
it: Indipendentemente dal codice che vuoi usare, HTML, CSS, JS o Liquid, descrivi ciò che ti serve e l'IA farà il resto.
pt_br: Seja código HTML, CSS, JS ou Liquid, basta descrever o que você precisa e deixar a IA criar para você.
zh_cn: 无论是 HTML、CSS、JS 还是 Liquid 代码，只需描述所需内容，并让 AI 为你构建它。

# ++CODE++47a853b9f140a6f231de8498ec559d7d882536070b83c1e45c16671fd48a0b65
source: Working on it...
cs: Pracuje se na tom...
fr: Traitement en cours…
it: Operazione in corso...
pt_br: Trabalhando nisto...
zh_cn: 正在处理...

# ++CODE++30632b88fa6fb995b221521d80b196cef9e854aca2ddba36b5c34259618e890f
source: Write JavaScript code for form field validation to check phone field value is in the valid format.
cs: Napsat kód JavaScriptu pro ověření pole formuláře kvůli kontrole, jestli má hodnota pole telefonu platný formát
fr: Ecrivez le code JavaScript pour la validation du champ du formulaire pour vérifier que la valeur du champ téléphone a le format valide.
it: Scrivi codice JavaScript per la convalida del campo del modulo per verificare che il valore del campo telefono sia nel formato valido.
pt_br: Escreva um código JavaScript para validação de campo de formulário para verificar se o valor do campo de telefone está no formato válido.
zh_cn: 编写用于窗体字段验证的 JavaScript 代码，以检查电话字段值的格式是否有效。

# ++CODE++216c39e49ae56ff6888d852e8818ed5282b19176cb7f9b4958a3fca2e1769b6c
source: Write JavaScript code to highlight the row where email field is empty in table list.
cs: Napsat kód JavaScriptu pro zvýraznění řádku, ve kterém je pole e-mailu v seznamu tabulek prázdné
fr: Ecrivez le code JavaScript pour mettre en surbrillance la ligne dans laquelle le champ de courrier électronique est vide dans la liste de tables.
it: Scrivi codice JavaScript per evidenziatore la riga in cui il campo del messaggio e-mail è vuoto nell'elenco delle tabelle.
pt_br: Escreva um código JavaScript para realçar a linha onde o campo de email está vazio na lista de tabelas.
zh_cn: 编写 JavaScript 代码以突出显示表列表中电子邮件字段为空的行。

# ++CODE++9265d4c9f6b10b1a95877bcccee77e9d164e8a51ab17104b14ba19e7935aef0e
source: Write web API code to query active contact records.
cs: Napsat kód webového rozhraní API pro dotazování aktivních záznamů kontaktů
fr: Écrivez un code d’API web pour interroger des enregistrements de contacts actifs.
it: Scrivi codice API Web per eseguire una query sui record del contatto attivi.
pt_br: Escreva o código da API Web para consultar os registros de contato ativos.
zh_cn: 编写 Web API 代码以查询可用的联系人记录。

# ++CODE++85a39ab345d672ff8ca9b9c6876f3adcacf45ee7c1e2dbd2408fd338bd55e07e
source: Yes
fr: Oui
it: Sì
pt_br: Sim
zh_cn: 是

# ++CODE++229b025b2c8158fda1948dc79cdd581547f97bbdbc239f9d89b056e48a397591
source: Yes, Don't Ask Again
pt_br: Sim, Não Perguntar Novamente
zh_cn: 是，不再询问

# ++CODE++5f1325c0fc2f8e2e8732d6545bcc100f0e7e0d8ea1740b2d519fc83c43ae1fc2
source: You are currently connected to a different environment. Would you like to switch to the required environment?
fr: Vous êtes actuellement connecté à un autre environnement. Voulez-vous basculer vers l’environnement requis ?
pt_br: Você está conectado a um ambiente diferente. Deseja mudar para o ambiente necessário?
zh_cn: 你当前已连接到其他环境。是否要切换到所需的环境?

# ++CODE++3c65297a1fc0860c6993f5c8beb4341dd13b71d7f3957daba611adf04a6c971b
source: You are editing a live, public site
cs: Upravujete živý veřejný web
es: Está editando un sitio público activo
fr: Vous modifiez un site public actif
it: Stai modificando un sito pubblico live
ja: ライブのパブリック サイトを編集中です
pt_br: Você está editando um site público ativo
ru: Вы редактируете опубликованный открытый сайт
tr: Yayında olan, herkese açık bir siteyi düzenliyorsunuz
zh_cn: 您正在编辑一个公共活动站点

# ++CODE++beb45bfdd4c3f6da9bb3687e4d9275790d086c1dffaec84839fa9ec9ce4e9ee2
source: You can use this in <a href="#" id="github-copilot-link">GitHub Copilot with @powerpages</a> and leverage best of both world.
cs: Tuto možnost můžete použít u <a href="#" id="github-copilot-link">GitHub Copilota s @powerpages</a> a využít to nejlepší z obou světů.
fr: Vous pouvez l’utiliser dans <a href="#" id="github-copilot-link">GitHub Copilot avec @powerpages</a> et tirer le meilleur des deux mondes.
it: Puoi utilizzarlo in <a href="#" id="github-copilot-link">GitHub Copilot con @powerpages</a> e sfruttare il meglio entrambe le soluzioni.
pt_br: Você pode usar isso no <a href="#" id="github-copilot-link">GitHub Copilot com @powerpages</a> e aproveitar o melhor dos dois mundos.
zh_cn: 您可以在 <a href="#" id="github-copilot-link">GitHub Copilot 中将此与 @powerpages 一起使用</a>，充分利用这两种技术。

# ++CODE++87eb9aa1f1ac1b6b141aedc4c21a9cb7cf786453c529babe30c8760072bb34d6
source: You need to authenticate with Power Platform to download the site. Would you like to authenticate now?
fr: Vous devez vous authentifier auprès de Power Platform pour télécharger le site. Voulez-vous vous authentifier maintenant ?
pt_br: É necessário autenticar-se no Power Platform para baixar o site. Deseja autenticar-se agora?
zh_cn: 需要使用 Power Platform 进行身份验证才能下载站点。是否要立即进行身份验证?

# ++CODE++eeb25aaca6a9e3f6c670334480b8e56e2a362ecfec23f8e63617915b22ddc8a0
source: Your preview isn't updated. Please upload your site to see the latest changes.
fr: Votre aperçu n’est pas à jour. Téléchargez votre site pour voir les modifications les plus récentes.
it: L'anteprima non è aggiornata. Carica il sito per vedere le modifiche più recenti.
pt_br: A sua visualização não está atualizada. Carregue o seu site para ver as alterações mais recentes.
zh_cn: 您的预览未更新。请上传您的站点以查看最新更改。

# ++CODE++3a928d0a6dd0e0c6b56eb3bf08b20e6361e876fd6b2eeca59f718cbfdc310472
source: dotnet sdk 6.0 or greater must be installed
cs: Musí být nainstalována sada dotnet sdk 6.0 nebo vyšší.
fr: la version du kit de développement logiciel (sdk) dotnet sdk 6.0 ou supérieure doit être installé
it: È necessario installare dotnet SDK 6.0 o versione successiva
ja: DotNet SDK 6.0 以上を必ずインストールしてください
pt_br: O dotnet sdk 6.0 ou superior deve estar instalado
ru: Необходимо установить версию dotnet sdk 6.0 или более позднюю
tr: dotnet sdk 6.0 veya üstü bir sürüm yüklenmelidir
zh_cn: 必须安装 DotNet SDK 6.0 或更高版本

# ++CODE++1a0339214d26f1499ce28b0304c11fce7c177c9d6df1872ac1e9705760cfdbd8
source: {0} ({1} file)
pt_br: {0} ({1} arquivo)
zh_cn: {0} ({1} 个文件)

# ++CODE++baeef25dc2eb180f07d2588035131c67de574a67b5b59941b077d96c5e08ec9e
source: {0} ({1} files)
pt_br: {0} ({1} arquivos)
zh_cn: {0} ({1} 个文件)

# ++CODE++dcbed1e6ea38a3f7f5e64925ed3898dc74721389792c65218b5216538214e3b7
source: {0} ({1}) ↔ {2} (Local)
zh_cn: {0} ({1}) ↔ {2} (本地)

# ++CODE++7ec0c807a987e15ebf5bcf7dab23b8fea20b59ed72cae0172465ad0fdd200882
source: {0} binary file(s) (e.g., images) were skipped as they cannot be displayed in the diff viewer. You can view them individually in the file tree.
pt_br: {0} arquivos binários (por exemplo, imagens) foram ignorados, pois não podem ser exibidos no visualizador de comparação. Você pode exibi-los individualmente na árvore de arquivos.
zh_cn: 已跳过 {0} 个二进制文件(例如图像)，因为它们无法显示在差异查看器中。可以在文件树中单独查看它们。

# ++CODE++48c4c42c9b70ac4687a121f91d8cb9a9063a3b51fbc5eeb68e5edc961ee18482
source: {0} created!
cs: {0} bylo vytvořeno.
es: Se ha creado {0}.
fr: {0} créé !
it: {0} creato.
ja: {0} が作成されました。
pt_br: {0} criado.
ru: Создано: {0}.
tr: {0} oluşturuldu!
zh_cn: {0} 已创建!

# ++CODE++d1873d011f27513d3bc27f9a9da5c28141a066578e847d1120ddef316f638ef4
source: {0} files changed
pt_br: {0} arquivos alterados
zh_cn: {0} 个文件已更改

# ++CODE++75a1e748520c8974a0ff5bf44b9d3a54c618fc7422b40e41465de59d8049331d
source: {0} files changed (Imported {1})
pt_br: {0} arquivos alterados (Importado {1})
zh_cn: {0} 个文件已更改(导入日期 {1})

# ++CODE++21471e6993c28688e252bf884db38022cef15af0126d3d7f68c5e4a6c4dfd9d3
source: {0}: {1} (Remote ↔ Local)
pt_br: {0}: {1} (Remoto ↔ Local)
zh_cn: {0}: {1} (远程 ↔ 本地)

# microsoft.powerplatform.pages.actionsHub.login.title
source: Add New Auth Profile
fr: Ajouter un nouveau profil d’authentification
it: Aggiungi nuovo profilo di autenticazione
pt_br: Adicionar Novo Perfil de Autenticação
zh_cn: 添加新的身份验证配置文件

# microsoft-powerapps-portals.walkthrough.advancedCapabilities.title
source: Advanced capabilities
cs: Rozšířené možnosti
de: Erweiterte Funktionen
es: Funcionalidades avanzadas
fr: Fonctionnalités avancées
it: Funzionalità avanzate
ja: 詳細な機能
pt_br: Recursos avançados
ru: Расширенные возможности
tr: Gelişmiş özellikler
zh_cn: 高级功能

# pacCLI.authPanel.title
source: Auth Profiles
cs: Ověřovací profily
de: Authentifizierungsprofile
es: Perfiles de autenticación
fr: Profils d’authentification
it: Profili di autenticazione
ja: 認証プロファイル
pt_br: Perfis de Autenticação
ru: Профили проверки подлинности
tr: Kimlik Doğrulama Profilleri
zh_cn: 身份验证配置文件
