Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# ++CODE++74f89e02b8d346f38df55113eee5dcbb0c0f31471876c67a9c13a3ff7caeebf9
source: Make sure AI-generated content is accurate and appropriate before using. [Learn more](https://go.microsoft.com/fwlink/?linkid=2240145) | [View terms](https://go.microsoft.com/fwlink/?linkid=2189520)
cs: Před použitím obsahu vygenerovaného umělou inteligencí se ujistěte, že je správný a vhodný. [Další informace](https://go.microsoft.com/fwlink/?linkid=2240145) | [Zobrazit podmínky](https://go.microsoft.com/fwlink/?linkid=2189520)
fr: Assurez-vous que le contenu généré par l’IA est précis et approprié avant de l’utiliser. [En savoir plus](https://go.microsoft.com/fwlink/?linkid=2240145) | [Afficher les conditions](https://go.microsoft.com/fwlink/?linkid=2189520)
it: Verifica che contenuto generato dall'IA sia accurato e appropriato prima di utilizzarlo. [Altre informazioni](https://go.microsoft.com/fwlink/?linkid=2240145) | [Visualizza le condizioni](https://go.microsoft.com/fwlink/?linkid=2189520)
pt_br: Verifique se o conteúdo gerado por IA é preciso e apropriado antes de usá-lo. [Saiba mais](https://go.microsoft.com/fwlink/?linkid=2240145) | [Exibir termos](https://go.microsoft.com/fwlink/?linkid=2189520)
zh_cn: 使用前请确保 AI 生成的内容准确且恰当。[了解详细信息](https://go.microsoft.com/fwlink/?linkid=2240145) | [查看条款](https://go.microsoft.com/fwlink/?linkid=2189520)

# ++CODE++8f2de600bf940a26c63a7ac23984a12ca8970fcf1a85947aa5566c34e23eea07
source: Managed
cs: Spravováno
fr: Géré
it: Gestita
ja: マネージド
pt_br: Gerenciado(a)
ru: Управляемые
tr: Yönetilen
zh_cn: 托管

# ++CODE++8f10b38db6f69f493504d7eca9d7f6e0c4453855fe741c99a0df61c699ad33f6
source: Matching Site
pt_br: Site Correspondente
zh_cn: 匹配网站

# ++CODE++8a194d5287e3da019883144787cd5f282753f5ce892d933be0833b3818c25503
source: Maximum 30 characters allowed
cs: Je povoleno maximálně 30 znaků.
es: Se permite un máximo de 30 caracteres
fr: 30 caractères maximum autorisés
it: È consentito un massimo di 30 caratteri
ja: 最大 30 文字使用可能
pt_br: O máximo permitido são 30 caracteres
ru: Допускается не более 30 знаков
tr: En fazla 30 karaktere izin verilir
zh_cn: 最多允许 30 个字符

# ++CODE++a6d287e1a3ca10ca1e47de17060293fbb14d1e43cd8ffb9a296661c576615b69
source: Metadata Diff
pt_br: Comparação de Metadados
zh_cn: 元数据差异

# ++CODE++d39a5fa0fca9df105f95b7dfa9a2705ccddaead33bd3119052baabe6c923a85d
source: Metadata Diff JSON
pt_br: Comparação de Metadados JSON
zh_cn: 元数据差异 JSON

# ++CODE++7accb685e6522ef72613a3d16ae7f3ce6ee978ac591c512054ec9e6bc2efef00
source: Metadata Diff Report
pt_br: Relatório de Comparação de Metadados
zh_cn: 元数据差异报告

# ++CODE++b1c8258fb401975727a82d9ce473af0a600f076cc7b73dbd16524e815cf4153d
source: Microsoft wants your feedback
fr: Microsoft souhaite recevoir vos commentaires
it: Microsoft desidera ricevere i tuoi commenti
pt_br: A Microsoft quer ouvir os seus comentários
zh_cn: Microsoft 需要您的反馈

# ++CODE++8e53dab06e505d52b109c8d60b6a1e1fddfe96194e3f1a44aeabe65f4b3568c4
source: Missing required field: {0}
pt_br: Campo obrigatório ausente: {0}
zh_cn: 缺少必需字段: {0}

# ++CODE++5813bc61a859f78f4474b9c45e545b7da14fe71acdbb5b7c4cb7010628780513
source: Missing required site information for reactivation.
fr: Informations de site manquantes requises pour la réactivation.
it: Mancano le informazioni richieste sul sito per la riattivazione.
pt_br: Faltam informações do site necessárias para a reativação.
zh_cn: 缺少重新激活所需的站点信息。

# ++CODE++e8ce5dcaf408935ff76747226d2e8bee4319a2f593c1d7a838115e56183d1f37
source: Modified
pt_br: Modificado
zh_cn: 已修改

# ++CODE++a253ff09c5a8678e1fd1962b2c329245e139e45f9cc6ced4e5d7ad42c4108fc0
source: NEW
cs: NOVÝ
fr: NOUVEAU
it: NUOVO
pt_br: NOVO
zh_cn: 新建

# ++CODE++9ecf722faa0944de54826f72fe9d734c59300a093bcce9cc47b507460ac80710
source: Name/Rename Auth Profile
cs: Pojmenovat nebo přejmenovat ověřovací profil
es: Asignar nombre/Cambiar nombre del perfil de autenticación
fr: Nommer/Renommer le profil d’authentification
it: Assegna un nome/rinomina profilo di autorizzazione
ja: 認証プロファイルの名前の指定/変更
pt_br: Nomear/Renomear Perfil de Autenticação
ru: Установка/изменение имени профиля проверки подлинности
tr: Kimlik Doğrulama Profilini Adlandır/Yeniden Adlandır
zh_cn: 命名/重命名身份验证配置文件

# ++CODE++85cd510d84e10bc2da6411770b3b666877ea27e365a962c37376fcf61e367da5
source: Name: {0}
cs: Jméno: {0}
es: Nombre: {0}
fr: Nom : {0}
it: Nome: {0}
ja: 名前: {0}
pt_br: Nome: {0}
ru: Имя: {0}
tr: Ad: {0}
zh_cn: 名称: {0}

# ++CODE++ebff96df55032b8c41dd4e275bc8df4d2c16c8fc18f36bd4c79cfa8a5de2d335
source: Name: {0} URL: {1} Environment ID: {2} Organization ID: {3}
fr: Nom : {0} URL : {1} ID d’environnement : {2} ID d’organisation : {3}
it: Nome: {0} URL: {1} ID ambiente: {2} ID organizzazione: {3}
pt_br: Nome: {0} URL: {1} ID do Ambiente: {2} ID da Organização: {3}
zh_cn: 名称: {0} URL: {1} 环境 ID: {2} 组织 ID: {3}

# ++CODE++7fa38a7ea7b5c48e91e41749348fc297c2b724457f31492a605ce91f9448cb2a
source: New Content Snippet
cs: Nový fragment obsahu
es: Nuevo fragmento de contenido
fr: Nouvel extrait de contenu
it: Nuovo frammento di contenuto
ja: 新しいコンテンツ スニペット
pt_br: Novo Trecho de Conteúdo
ru: Новый фрагмент содержимого
tr: Yeni İçerik Parçacığı
zh_cn: 新建内容片段

# ++CODE++085499ab73e121206b1a9475879315bcdbc3035662ae44cbd6b82e6e6898e40e
source: New Page Template
cs: Šablona nové stránky
es: Nueva plantilla de página
fr: Nouveau modèle de page
it: Nuovo modello di pagina
ja: 新しいページ テンプレート
pt_br: Novo Modelo de Página
ru: Новый шаблон страницы
tr: Yeni Sayfa Şablonu
zh_cn: 新建页面模板

# ++CODE++1f21e0f117783158a85e92b5659dc5d9cf3b2daeba2ae3df809322c997f369b4
source: New Webpage
cs: Nová webová stránka
es: Nueva página web
fr: Nouvelle page web
it: Nuova pagina Web
ja: 新しい Web ページ
pt_br: Nova Página da Web
ru: Новая веб-страница
tr: Yeni Web Sayfası
zh_cn: 新建网页

# ++CODE++1ea442a134b2a184bd5d40104401f2a37fbc09ccf3f4bc9da161c6099be3691d
source: No
fr: Non
pt_br: Não
zh_cn: 否

# ++CODE++b1061a7adf836619e40617bbbbe42d04a9c167b5756a2b4926c02d88e780a7f9
source: No Website Data Found in Current Directory. Please switch to a directory that contains the PAC downloaded website data to continue.
cs: V aktuálním adresáři nebyla nalezena žádná data webu. Pokud chcete pokračovat, přepněte do adresáře, který obsahuje stažená data PAC webu.
es: No se encontraron datos del sitio web en el directorio actual. Cambie a un directorio que contenga los datos del sitio web descargado de PAC para continuar.
fr: Aucune donnée de site web trouvée dans le répertoire actuel. Pour continuer, allez dans un répertoire contenant les données du site PAC téléchargées.
it: Nessun dato sul sito Web trovato nella directory corrente. Per continuare, passa a una directory che contiene i dati del sito Web scaricati.
ja: 現在のディレクトリに Web サイトのデータが見つかりません。PAC のダウンロード済み Web サイト データを含むディレクトリに切り替えて、続行してください。
pt_br: Nenhum Dado de Site Encontrado no Diretório Atual. Alterne para um diretório que contenha os dados do site do PAC baixados para continuar.
ru: В текущем каталоге не найдены данные веб-сайта. Для продолжения перейдите в каталог, содержащий загруженные данные веб-сайта PAC.
tr: Geçerli Dizinde Web Sitesi Verileri Bulunamadı. Devam etmek için lütfen PAC tarafından indirilen web sitesi verilerini içeren bir dizine geçin.
zh_cn: 在当前目录中找不到网站数据。请切换到包含 PAC 下载的网站数据的目录以继续。

# ++CODE++4e0d6304be5d5157d4b4b95a0bbffe07b9c2a84f6849b3bb0d591e79b864f33c
source: No active editor found.
pt_br: Nenhum editor ativo encontrado.
zh_cn: 找不到活动编辑器。

# ++CODE++5fa52f38613f411a293ae2794bdd18faa33ed13bc586c60a8bd774832069c82e
source: No active editor. Please open a server logic file.
pt_br: Nenhum editor ativo. Abra um arquivo de lógica do servidor.
zh_cn: 没有活动编辑器。请打开服务器逻辑文件。

# ++CODE++1b03558147265e7c9bd70e6a4abe031ef65dbca05e01d94953e58b86ec82c859
source: No analysis results found.
fr: Aucun résultat d’analyse trouvé.
pt_br: Nenhum resultado de análise encontrado.
zh_cn: 未找到分析结果。

# ++CODE++fe9da58a68fc4d4ac79a76febed4ff3a3ebc116954b5b383578fd1803f2f7268
source: No differences found between the remote site and your local workspace.
pt_br: Nenhuma diferença encontrada entre o site remoto e seu espaço de trabalho local.
zh_cn: 远程站点和本地工作区之间找不到任何差异。

# ++CODE++80266a1ea7e6671d65c98a0624c254f5b9acfacddd05d69524b7f034eeba3268
source: No environments found
fr: Aucun environnement trouvé
it: Nessun ambiente trovato
pt_br: Nenhum ambiente encontrado
zh_cn: 找不到任何环境

# ++CODE++e75c23acb3f88e840f326048df92fcfd3350ec3b775a5c51e6ff6754f0f9f7a1
source: No issues found!
fr: Aucun problème trouvé.
pt_br: Nenhum problema encontrado!
zh_cn: 未找到问题!

# ++CODE++f4e72a0615b12413932e879ea66a30e28ddf66f78c73807f2302983fa6dffe9f
source: No message
fr: Aucun message
pt_br: Nenhuma mensagem
zh_cn: 无消息

# ++CODE++e0d2b29e6060c3d50691e6961835418fe6a24723c227dacf93250b94e21ed1bb
source: No page templates found
cs: Nebyly nalezeny žádné šablony stránek.
es: No se encontró ninguna plantilla de página
fr: Aucun modèle de page trouvé
it: Non sono stati trovati modelli di pagina
ja: ページ テンプレートが見つかりません
pt_br: Nenhum modelo de página encontrado
ru: Шаблоны страниц не найдены
tr: Sayfa şablonu bulunamadı
zh_cn: 找不到页面模板

# ++CODE++6bf857113b9224708e98b1bacf5b0711a8eefd9c9c3ff1217557ce00d8e00cc7
source: No parent pages found for adding webfile
cs: Nebyly nalezeny žádné nadřazené stránky pro přidání webového souboru.
es: No se ha encontrado ninguna página primaria para agregar el archivo web
fr: Aucune page parente trouvée pour l’ajout du fichier web
it: Nessuna pagina padre trovata per l'aggiunta di un file Web
ja: Web ファイルを追加するための親ページが見つかりません
pt_br: Nenhuma página principal encontrada para a adição do arquivo da Web
ru: Не найдены родительские страницы для добавления веб-файла
tr: Web dosyası eklemek için üst sayfa bulunamadı
zh_cn: 找不到用于添加 Web 文件的父页面

# ++CODE++b8a162cd305ec78bd85f8e1b5a31a3e2c944fd560aa5f0e17e6b76de4c008e6b
source: No sites found
fr: Aucun site trouvé
it: Nessun sito trovato
pt_br: Nenhum site encontrado
zh_cn: 找不到站点

# ++CODE++81ecc0ba0812a908a0b4cc9e87e2a562a6346ee0d40becf34d439d5fb723da7f
source: No sites found in the selected environment.
pt_br: Nenhum site encontrado no ambiente selecionado.
zh_cn: 在所选环境中找不到任何网站。

# ++CODE++abb85d7bb3ea846c90ad6348fd3a1154436cdde8f06db3d86711dd6e23cf1e21
source: No webpages found
cs: Nebyly nalezeny žádné webové stránky.
es: No se ha encontrado ninguna página web
fr: Aucune page web trouvée
it: Nessuna pagina Web trovata
ja: Web ページが見つかりません
pt_br: Nenhuma página da Web encontrada
ru: Веб-страницы не найдены
tr: Web sayfası bulunamadı
zh_cn: 找不到网页

# ++CODE++6da29e062697a9f26659ef14ebda075afe939756af5d8e1d3451eb7d6d6e1a8a
source: No workspace folder found
cs: Nebyla nalezena žádná složka pracovního prostoru.
es: No se ha encontrado ninguna carpeta del área de trabajo
fr: Aucun dossier d’espace de travail trouvé
it: Nessuna cartella dell'area di lavoro trovata
ja: ワークスペース フォルダーが見つかりません
pt_br: Nenhuma pasta do espaço de trabalho encontrada
ru: Не найдена папка рабочей области
tr: Çalışma alanı klasörü bulunamadı
zh_cn: 找不到工作区文件夹

# ++CODE++9214ba9d7c0e1e98dc8919cffaa47b39e1444bcb5925a6c7818d11fa11363eb1
source: No workspace folder is open. Please open a folder containing your Power Pages site.
pt_br: Nenhuma pasta de espaço de trabalho está aberta. Abra uma pasta que contenha seu site do Power Pages.
zh_cn: 未打开任何工作区文件夹。请打开包含 Power Pages 网站的文件夹。

# ++CODE++6c0242ffba2aababcb4e45831de1492e8bccae2cb0f3387dfe9c16620f6928ef
source: No workspace folder opened. Please open a site folder to preview.
fr: Aucun dossier d’espace de travail ouvert. Ouvrez un dossier du site pour afficher un aperçu.
it: Nessuna cartella dell'area di lavoro aperta. Apri una cartella del sito per visualizzarla in anteprima.
pt_br: Não foi aberta nenhuma pasta do espaço de trabalho. Abra uma pasta do site para visualizar.
zh_cn: 未打开任何工作区文件夹。请打开站点文件夹进行预览。

# ++CODE++ccb4c324f516c63335c648ee08a66b8cc78737d26156f0c84707cd0ee4235492
source: Not Now
fr: Pas maintenant
pt_br: Agora Não
zh_cn: 以后再说

# ++CODE++b2b461f3eae470e95fdcfd61a3cbe6680e84d0a7221a305f696ce44843badc89
source: Object ID: {0}
fr: ID d’objet : {0}
it: ID oggetto: {0}
pt_br: ID do Objeto: {0}
zh_cn: 对象 ID: {0}

# ++CODE++bda6bda1e902d120a7f4515ceac8546c3112e3cb9351df1d8b9713b8f86e0370
source: One or more attribute names have been changed or removed. Contact your admin.
cs: Některé názvy atributů byly změněny nebo odebrány. Obraťte se na správce.
es: Se han cambiado o quitado uno o más nombres de atributo. Póngase en contacto con su administrador.
fr: Un ou plusieurs noms d’attribut ont été modifiés ou supprimés. Contactez votre administrateur.
it: Uno o più nomi di attributo sono stati modificati o rimossi. Contatta l'amministratore.
ja: 1 つ以上の属性名が変更または削除されています。管理者にお問い合わせください。
pt_br: Um ou mais nomes de atributos foram alterados ou removidos. Contate o administrador.
ru: Одно или несколько имен атрибутов были изменены или удалены. Обратитесь к администратору.
tr: Bir veya daha fazla öznitelik adı değiştirildi veya kaldırıldı. Yöneticinizle iletişime geçin.
zh_cn: 一个或多个属性名称已更改或已删除。请联系您的管理员。

# ++CODE++68b3f4bff6de90aed6e47e72d8b680901da64dff39ed843e9eeed0464020e971
source: Open Folder
fr: Ouvrir le dossier
pt_br: Abrir Pasta
zh_cn: 打开文件夹

# ++CODE++dcec6893414c96089c3acbe4d12c9d50233cda7a08fcb4b8cae324a9415198a6
source: Open Report
pt_br: Abrir Relatório
zh_cn: 打开报告

# ++CODE++f329c8f717c6c20eb60774d8f9227683661d74ebae48207076be60be8796dd5d
source: Open Results
fr: Ouvrir les résultats
pt_br: Abrir Resultados
zh_cn: 打开结果

# ++CODE++c923497edb55fd73ded53b2d43ccaf08ed3ed77118d934fd762fb7a5048b16e4
source: Open as Text
fr: Ouvrir en tant que texte
pt_br: Abrir como Texto
zh_cn: 以文本形式打开

# ++CODE++e35b67aaf27dab4f013733ada391dda0fb7348af30bcf397692ecf7a83b9cb2f
source: Open in New Workspace
fr: Ouvrir dans un nouvel espace de travail
pt_br: Abrir em Novo Espaço de Trabalho
zh_cn: 在新工作区中打开

# ++CODE++e61655958f06a0bb12435c70d95c738b62fabdff78f26c597c105a8823820fbd
source: Open in Power Pages studio
cs: Otevřít ve studiu Power Pages
fr: Ouvrir dans le studio Power Pages
it: Apri nello studio di Power Pages
pt_br: Abrir no estúdio do Power Pages
zh_cn: 在 Power Pages 工作室中打开

# ++CODE++e473d99cc18c8fbc20a562b15d5c16437343c2dc28d5b176e64890b7b3d350d1
source: Open in VS Code Desktop
fr: Ouvrir dans VS Code Desktop
pt_br: Abrir no VS Code Desktop
zh_cn: 在 VS Code 桌面中打开

# ++CODE++87fe691d426d47ee588ac957e12a9936b94fe6d70fd9ef97c92f7af1671ed9a0
source: Opening in VS Code Desktop. If it doesn't open or shows an error, you may need to install VS Code or update the Power Platform extension.
pt_br: Abrindo no VS Code Desktop. Se ele não abrir ou mostrar um erro, talvez seja necessário instalar o VS Code ou atualizar a extensão do Power Platform.
zh_cn: 正在 VS Code 桌面中打开。如果未打开或显示错误，则可能需要安装 VS Code 或更新 Power Platform 扩展。

# ++CODE++dac0ee62a5197a3722a9e7e9e851e80504cced8a13ce8b17842d78e8313578c2
source: Opening preview site...
cs: Otevírá se náhled webu...
fr: Ouverture de l’aperçu du site en cours…
it: Apertura sito in anteprima in corso...
pt_br: Abrindo site da versão preliminar...
ru: Открывается предварительная версия сайта...
tr: Önizleme sitesi açılıyor...
zh_cn: 正在打开预览版站点...

# ++CODE++e7f5bd4de76500f23850b2f87c8d39ef1f346662963521c88985e4486b860f90
source: Opening results with SARIF viewer...
fr: Ouverture des résultats avec la visionneuse SARIF...
pt_br: Abrindo resultados com o visualizador SARIF...
zh_cn: 正在使用 SARIF 查看器打开结果...

# ++CODE++f2dd836a178a30bdcb69c5fd8b5685c12d400d47e10971dd4d93657e6d5b1d0e
source: Opening results with newly installed SARIF viewer...
fr: Ouverture des résultats avec la visionneuse SARIF nouvellement installée...
pt_br: Abrindo resultados com o visualizador SARIF recém-instalado...
zh_cn: 正在使用新安装的 SARIF 查看器打开结果...

# ++CODE++e61c4ac3c692e3cfdc02717db82d18b1e9d51242710031f20af35b33d149fa7a
source: Opening site preview...
fr: En cours d’ouverture de l’aperçu du site...
it: Apertura anteprima sito Web in corso...
pt_br: Abrindo visualização do site...
zh_cn: 正在打开站点预览...

# ++CODE++5cac0147c19013eb88b1fc8dc0d066b48e9f5cfcdbc9737a29d544d9bd61db55
source: Operation failed. See output panel for details.
cs: Operace se nezdařila. Podrobnosti najdete na panel výstupu.
fr: Échec de l’opération. Pour plus de détails, consultez le volet de sortie.
it: Operazione non riuscita. Per i dettagli, vedi il pannello di output.
pt_br: Falha na operação. Consulte o painel de saída para obter detalhes.
zh_cn: 操作失败。请参阅输出面板以了解详细信息。

# ++CODE++38bb1c8534acb465ac1e4975989a18199aaea7beb273d8ff935ac0a07e443539
source: Organization ID: {0}
fr: ID d’organisation : {0}
it: ID organizzazione: {0}
pt_br: ID da Organização: {0}
zh_cn: 组织 ID: {0}

# ++CODE++77c2c11a03d9aaa14f233c0409b58952a96ed6f781a024630a7af58d1ed70f50
source: Organization URL is required
pt_br: A URL da organização é necessária
zh_cn: 组织 URL 是必需的

# ++CODE++b3d5416b4e83d803e6f238f1d31a637450f12c9370113871d15bd48c72435cd2
source: Other Sites
fr: Autres sites
it: Altri siti
pt_br: Outros Sites
zh_cn: 其他站点

# ++CODE++d4dc9d620b68b70e7de4aeaa15e1d83dddb457c64a3cadb35cf1b55025ad194f
source: PAC Telemetry disabled
cs: Telemetrie PAC je zakázána.
es: Telemetría de PAC deshabilitada
fr: Télémétrie PAC désactivée
it: Telemetria PAC disabilitata
ja: PAC テレメトリが無効になりました
pt_br: Telemetria de PAC desabilitada
ru: Телеметрия PAC отключена
tr: PAC Telemetrisi devre dışı bırakıldı
zh_cn: 已禁用 PAC 遥测

# ++CODE++aba96e0c43da62e6c721a35c5d5eb5ffecaf8316ddea5379049172acfe6c7152
source: PAC Telemetry enabled
cs: Telemetrie PAC je povolena.
es: Telemetría de PAC habilitada
fr: Télémétrie PAC activée
it: Telemetria PAC abilitata
ja: PAC テレメトリが有効になりました
pt_br: Telemetria de PAC habilitada
ru: Телеметрия PAC включена
tr: PAC Telemetrisi etkinleştirildi
zh_cn: 已启用 PAC 遥测

# ++CODE++59e1f415bf9d7761b450dcb4785daac53307323451bc453bfaa06a46d4649e2a
source: PREVIEW
fr: VERSION PRÉLIMINAIRE
it: ANTEPRIMA
pt_br: VERSÃO PRELIMINAR
zh_cn: 预览版

# ++CODE++1514b12ec249ca33bc0568c872840126e82cc964aaa7f028393674c17d554444
source: Page Template name cannot be empty.
cs: Název šablony stránky nemůže být prázdný.
es: El nombre de la plantilla de página no puede estar vacío.
fr: Le nom du modèle de page ne peut pas être vide.
it: Il nome del modello di pagina non può essere vuoto.
ja: ページ テンプレート名を空にすることはできません。
pt_br: O nome do Modelo de Página não pode ficar vazio.
ru: Имя шаблона страницы не может быть пустым.
tr: Sayfa Şablonu adı boş olamaz.
zh_cn: 页面模板名称不能为空。

# ++CODE++116904ea5ee4dd82af7e3da21c5c14755024f98a1e619bdefc161e1d832dbdb2
source: Please enter a name for the content snippet.
cs: Zadejte název fragmentu obsahu.
es: Escriba un nombre para el fragmento de contenido.
fr: Saisissez un nom pour l’extrait de code du contenu.
it: Immetti un nome per il frammento di contenuto.
ja: コンテンツ スニペットの名前を入力してください。
pt_br: Insira um nome para o trecho de conteúdo.
ru: Введите имя фрагмента содержимого.
tr: Lütfen içerik kod parçacığı için bir ad girin.
zh_cn: 请输入内容片段的名称。

# ++CODE++c3433eeaf2c9eaae3ca8fe32bd795fa0693fbe31351dff72ceef19a6d1acb14b
source: Please enter a name for the page template.
cs: Zadejte název šablony stránky.
es: Escriba un nombre para la plantilla de página.
fr: Saisissez un nom pour le modèle de page.
it: Immetti un nome per il modello di pagina.
ja: ページ テンプレートの名前を入力してください。
pt_br: Insira um nome para o modelo de página.
ru: Введите имя шаблона страницы.
tr: Lütfen sayfa şablonu için bir ad girin.
zh_cn: 请输入页面模板的名称。

# ++CODE++1077613279fb6d8a1ff3d36befe1c6b15c33748ff0da01e777653cde3ca7d74c
source: Please enter a name for the web template.
cs: Zadejte název šablony webu.
es: Escriba un nombre para la plantilla web.
fr: Saisissez un nom pour le modèle web.
it: Immetti un nome per il modello Web.
ja: Web テンプレートの名前を入力してください。
pt_br: Insira um nome para o modelo da Web.
ru: Введите имя веб-шаблона.
tr: Lütfen web şablonu için bir ad girin.
zh_cn: 请输入 Web 模板的名称。

# ++CODE++7f6276dc63b573d177b7d6e17f787b108e3c8c7d449324ac13a6d06b1be59d8e
source: Please enter a name for the webpage.
cs: Zadejte název webové stránky.
es: Escriba un nombre para la página web.
fr: Saisissez un nom pour la page web.
it: Immetti un nome per la pagina Web.
ja: Web ページの名前を入力してください。
pt_br: Insira um nome para a página da Web.
ru: Введите имя веб-страницы.
tr: Lütfen web sayfası için bir ad girin.
zh_cn: 请输入网页的名称。

# ++CODE++6355962eca901310bd24d2142605263344a3f09fb4fc30fc0f9dcf4cd56bf534
source: Please login to preview the site.
fr: Veuillez vous connecter pour prévisualiser le site.
it: Effettua il login per visualizzare l'anteprima del sito.
pt_br: Faça logon para visualizar o site.
zh_cn: 请登录以预览站点。

# ++CODE++2e56799726107b8b44bdcad31ef1ce0515cfacc9372b34946a4257af3bcf2919
source: Please open a server logic file (.js) from the server-logics folder.
pt_br: Abra um arquivo de lógica do servidor (.js) da pasta server-logics.
zh_cn: 请从服务器逻辑文件夹打开服务器逻辑文件(.js)。

# ++CODE++f413d35f48356c6c13c6c9d8947f011221acb3bea7d0ce74eb2f5ed217f26bad
source: Please select the folder that contains your compiled output to upload your site.
fr: Veuillez sélectionner le dossier contenant votre sortie compilée pour télécharger votre site.
it: Seleziona la cartella che contiene l'output compilato per caricare il tuo sito.
pt_br: Selecione a pasta que contém a saída compilada para carregar seu site.
zh_cn: 请选择包含经编译的输出的文件夹，以上传您的站点。

# ++CODE++1bac158cc07a75506df3774db0ad7c188c19ccad4943c4cf03da8b6700ef9ce4
source: Power Pages Copilot is now connected to the environment: {0} : {1}
cs: Copilot služby Power Pages je nyní připojen k prostředí: {0}: {1}
fr: Power Pages Copilot est désormais connecté à l’environnement : {0} : {1}
it: Copilot di Power Pages è ora connesso all'ambiente: {0}: {1}
ja: Power Pages Copilot が現在接続されている環境: {0} : {1}
pt_br: O Power Pages Copilot está conectado ao ambiente: {0}: {1}
ru: Power Pages Copilot теперь подключен к среде: {0} : {1}
tr: Power Pages Copilot artık şu ortama bağlıdır: {0}: {1}
zh_cn: Power Pages Copilot 现已连接到环境: {0} : {1}

# ++CODE++f519c6aeba20c1a712f6043bf6eb52bf3bb8834f5f1a6c9ea60244dbbb30453c
source: Power Pages Server Logic detected! You can now debug your server logic files with breakpoints and IntelliSense.
pt_br: Lógica do Servidor do Power Pages detectada! Agora você pode depurar seus arquivos de lógica do servidor com pontos de interrupção e IntelliSense.
zh_cn: 检测到 Power Pages 服务器逻辑!现在可以使用断点和 IntelliSense 调试服务器逻辑文件。

# ++CODE++db40be71cd139d96719d08f10c843b8bf1c2a0d3d2da06902109a758a98bc9f9
source: Power Pages Site Comparison Results
pt_br: Resultados da Comparação de Sites do Power Pages
zh_cn: Power Pages 网站比较结果

# ++CODE++04ac907168ac84b45263503d1306565bece49c4ae3e8ef4af310b304f03ab6d4
source: Power Pages site download completed successfully. Would you like to open the downloaded site folder?
fr: Le téléchargement du site Power Pages est terminé. Voulez-vous ouvrir le dossier de site téléchargé ?
pt_br: Download do site do Power Pages concluído com êxito. Deseja abrir a pasta do site baixado?
zh_cn: Power Pages 站点下载已成功完成。是否要打开下载的站点文件夹?

# ++CODE++cce89cd3a0f118dafd3173f6444abdcd2b9782153af1b6bfa8f63ef3d4b68268
source: Power Pages studio URL is not available
cs: Adresa URL studia Power Pages není k dispozici.
fr: L’URL du studio Power Pages n’est pas disponible
it: L'URL dello studio di Power Pages non è disponibile
pt_br: URL do estúdio do Power Pages não está disponível
zh_cn: Power Pages 工作室 URL 不可用

# ++CODE++8ce54044bb9e895666fd98c1b6e497655a4c2a7239b2187599972e9d81bd0f3e
source: Power Platform Tools VS Code Extension
pt_br: Extensão de Ferramentas do VS Code para Power Platform
zh_cn: Power Platform 工具 VS Code 扩展

# ++CODE++92c355db79b65ac0ec6050657f427d46214ff364079cc646f7d255dec23586f8
source: Power Platform Tools: PAC CLI
pt_br: Ferramentas do Power Platform: CLI do PAC
zh_cn: Power Platform 工具: PAC CLI
