Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# ++CODE++08833dda22312dacb09f1d185caedf751289ee89a4c75682a09f4a262bf67ac4
source: End of Code Block
fr: Fin du bloc de code
it: Fine del blocco di codice
pt_br: Fim do Bloco de Código
zh_cn: 代码块结束

# ++CODE++d9b0470a805c5df4050b3070600c0d2b1d055d406d806105f17ba005ef775b6a
source: (click to expand diff)
pt_br: (clique para expandir a comparação)
zh_cn: (单击展开差异)

# ++CODE++32dfcdbc5d61fc73e1012a0b09b6d9121d37e4a5e95726456066acfc313468a1
source: 1 file changed
pt_br: 1 arquivo alterado
zh_cn: 1 个文件已更改

# ++CODE++29bb69945e50cb632fabf16f3f89a25d813910c19059d8a792f66262a952039d
source: @PowerPages is not yet available in your region.
fr: @PowerPages n’est pas encore disponible dans votre région.
it: @PowerPages non è ancora disponibile nella tua area geografica.
pt_br: @PowerPages ainda não está disponível em sua região.
zh_cn: @PowerPages 在您的区域尚不可用。

# ++CODE++32e135c21be9286cda2fda96fbe713f9af60f5f933e4e58468f256dd54b95575
source: A content snippet with the same name already exists. Please enter a different name.
cs: Fragment obsahu se stejným názvem už existuje. Zadejte jiný název.
es: Ya existe un fragmento de contenido con el mismo nombre. Especifique otro nombre.
fr: Un extrait de contenu portant le même nom existe déjà. Veuillez entrer un nom différent.
it: Esiste già un frammento di contenuto con lo stesso nome. Immetti un nome diverso.
ja: 同じ名前のコンテンツ スニペットが既に存在します。別の名前を入力してください。
pt_br: Já existe um trecho de conteúdo com o mesmo nome. Insira um nome diferente.
ru: Фрагмент содержимого с таким именем уже существует. Введите другое имя.
tr: Aynı ada sahip bir içerik parçacığı zaten var. Lütfen farklı bir ad girin.
zh_cn: 具有相同名称的内容片段已存在。请输入其他名称。

# ++CODE++89b1afe5a595fc2b3015febb4d844886c952f32da56ac80a51c7090a8b2772fc
source: A page template with the same name already exists. Please enter a different name.
cs: Šablona stránky se stejným názvem už existuje. Zadejte jiný název.
es: Ya existe una plantilla de página con el mismo nombre. Especifique otro nombre.
fr: Un modèle de page portant le même nom existe déjà. Veuillez entrer un nom différent.
it: Esiste già un modello di pagina con lo stesso nome. Immetti un nome diverso.
ja: 同じ名前のページ テンプレートが既に存在します。別の名前を入力してください。
pt_br: Já existe um modelo de página com o mesmo nome. Insira um nome diferente.
ru: Шаблон страницы с таким именем уже существует. Введите другое имя.
tr: Aynı ada sahip bir sayfa şablonu zaten var. Lütfen farklı bir ad girin.
zh_cn: 具有相同名称的页面模板已存在。请输入其他名称。

# ++CODE++86e9c0f40f903702e413d58d415c89efa53e0ffb9446a23d81d1d9491c6a2d2d
source: A webpage with the same name already exists. Please enter a different name.
cs: Webová stránka se stejným názvem už existuje. Zadejte jiný název.
es: Ya existe una página web con el mismo nombre. Especifique otro nombre.
fr: Une page web portant le même nom existe déjà. Veuillez entrer un nom différent.
it: Esiste già una pagina Web con lo stesso nome. Immetti un nome diverso.
ja: 同じ名前の Web ページが既に存在します。別の名前を入力してください。
pt_br: Já existe uma página da Web com o mesmo nome. Insira um nome diferente.
ru: Веб-страница с таким именем уже существует. Введите другое имя.
tr: Aynı ada sahip bir web sayfası zaten var. Lütfen farklı bir ad girin.
zh_cn: 具有相同名称的网页已存在。请输入其他名称。

# ++CODE++22a97bc8f9b1cf66fa77f878b5a2cc57c52ad534e6ca38fbd6e5dd3b9854602c
source: A webtemplate with the same name already exists. Please enter a different name.
cs: Šablona webu se stejným názvem už existuje. Zadejte jiný název.
es: Ya existe una plantilla web con el mismo nombre. Especifique otro nombre.
fr: Un modèle web portant le même nom existe déjà. Veuillez entrer un nom différent.
it: Esiste già un webtemplate con lo stesso nome. Immetti un nome diverso.
ja: 同じ名前の Web テンプレートが既に存在します。別の名前を入力してください。
pt_br: Já existe um modelo da Web com o mesmo nome. Insira um nome diferente.
ru: Веб-шаблон с таким именем уже существует. Введите другое имя.
tr: Aynı ada sahip bir web şablonu zaten var. Lütfen farklı bir ad girin.
zh_cn: 具有相同名称的 Web 模板已存在。请输入其他名称。

# ++CODE++bcfb3427790816de073090a76469fec945a3c7f5f82bbac338378ea22784c70a
source: AI features have been disabled by your organization. Contact your admin for details. [Learn more](https://go.microsoft.com/fwlink/?linkid=2285848)
fr: Les fonctionnalités d’IA ont été désactivées par votre organisation. Contactez votre administrateur pour plus d’informations. [En savoir plus](https://go.microsoft.com/fwlink/?linkid=2285848)
it: Le funzionalità dell'IA sono state disabilitate dall'organizzazione. Contatta l'amministratore per i dettagli. [Altre informazioni](https://go.microsoft.com/fwlink/?linkid=2285848)
pt_br: Os recursos de IA foram desabilitados pela sua organização. Contate o administrador para obter detalhes. [Saiba mais](https://go.microsoft.com/fwlink/?linkid=2285848)
zh_cn: 您的组织已禁用 AI 功能。有关详细信息，请联系管理员。[了解详细信息](https://go.microsoft.com/fwlink/?linkid=2285848)

# ++CODE++8d35e64354d3db3df1df4ef8e6068b6b9dd58514fcf980f7071e10ed160db95a
source: AI-generated content can contain mistakes
cs: Obsah vygenerovaný umělou inteligencí může obsahovat chyby.
fr: Le contenu généré par l’IA peut contenir des erreurs
it: Il contenuto generato dall'IA contiene errori
pt_br: O conteúdo gerado por IA pode conter erros
zh_cn: AI 生成的内容可能包含错误

# ++CODE++20e183e54ca33b94a25f921f68c75c4ec47212f2d94ee04e6fe4b564b96d2826
source: Accounts don't match, data may not load.
fr: Les comptes ne correspondent pas. Les données risquent de ne pas se charger.
pt_br: As contas não correspondem, os dados podem não ser carregados.
zh_cn: 帐户不匹配，数据可能无法加载。

# ++CODE++031018d0f4bb3985ac963d91cb607a9eaab8855a00990613c5327a1edb0032f7
source: Activating CodeQL extension...
fr: Activation de l’extension CodeQL...
pt_br: Ativando a extensão CodeQL...
zh_cn: 正在激活 CodeQL 扩展...

# ++CODE++e8e28535ce31524257fd35ecc72ba709bf789ab572aa517bf1c0af2870520415
source: Activating SARIF viewer extension...
fr: Activation de l’extension de visionneuse SARIF...
pt_br: Ativando a extensão do visualizador SARIF...
zh_cn: 正在激活 SARIF 查看器扩展...

# ++CODE++b82f83283cc4275cf0d58b4f55d1242fe46227ee1da9db4b81b6b08804dcbf01
source: Active Sites
fr: Sites actifs
it: Siti attivi
pt_br: Sites Ativos
zh_cn: 可用站点

# ++CODE++5f9c7a14b3c0c2971e4a8f4471af5071dbd3cf37f96fa09fe1257124c0b7e921
source: Active auth profile is not found or has expired. Please try again.
cs: Aktivní autorizační profil nebyl nalezen nebo jeho platnost vypršela. Zkuste to znovu.
fr: Le profil d’authentification active est introuvable ou a expiré. Veuillez recommencer.
it: Profilo di autenticazione attivo non trovato o scaduto. Riprova.
pt_br: O perfil de autenticação ativo não foi encontrado ou expirou. Tente novamente.
zh_cn: 找不到有效的身份验证配置文件或配置文件已过期。请重试。

# ++CODE++5d8300ceca093c3e9b111bbcadfac87c89ca4274fc9a7fe3267f037a5ab4ceac
source: Active auth profile is not found or has expired. To create a new auth profile, enter the environment URL.
cs: Aktivní ověřovací profil nebyl nalezen nebo vypršela jeho platnost. Pokud chcete vytvořit nový ověřovací profil, zadejte adresu URL prostředí.
fr: Le profil d’authentification actif est introuvable ou a expiré. Pour créer un profil d’authentification, entrez l’URL de l’environnement.
it: Profilo di autenticazione attivo non trovato o scaduto. Per creare un nuovo profilo di autenticazione, immetti l'URL dell'ambiente.
pt_br: O perfil de autenticação ativo não foi encontrado ou expirou. Para criar um novo perfil de autenticação, insira a URL do ambiente.
ru: Активный профиль проверки подлинности не найден или истек срок его действия. Чтобы создать новый профиль проверки подлинности, введите URL-адрес среды.
tr: Etkin kimlik doğrulama profili bulunamadı veya süresi dolmuş. Yeni bir kimlik doğrulama profili oluşturmak için ortam URL'sini girin.
zh_cn: 有效的身份验证配置文件未找到或已过期。要创建新的身份验证配置文件，请输入环境 URL。

# ++CODE++b544cb198e99ff113ac41467fc99191f11916287ccdb1ae619dba61dd6bbeff6
source: Add content snippet name (name should be unique)
cs: Přidejte název fragmentu obsahu (název by měl být jedinečný).
es: Agregar el nombre del fragmento de contenido (el nombre debe ser único)
fr: Ajouter le nom de l’extrait de contenu (le nom doit être unique)
it: Aggiungi nome frammento di contenuto (il nome deve essere univoco)
ja: コンテンツ スニペット名を追加します (名前は一意である必要があります)
pt_br: Adicionar nome do trecho de conteúdo (o nome deve ser exclusivo)
ru: Добавьте имя фрагмента содержимого (оно должно быть уникальным)
tr: İçerik parçacığı adı ekleyin (ad benzersiz olmalıdır)
zh_cn: 添加内容片段名称(名称应是唯一的)

# ++CODE++6b02e0d363a4af1c95eef50364bb0202c8b250aa05a48a69e68fd7787b4b0632
source: Added
pt_br: Adicionado
zh_cn: 已添加

# ++CODE++15593a5b5afa7d2fd80e213e5035a35bb260e4cb5c1b18bca70583b796f11a5c
source: Added Locally
pt_br: Adicionado Localmente
zh_cn: 已在本地添加

# ++CODE++0e24df55d08fd98cf5664002561cf1ab063231df2ec58e3a4ae50c063ba66828
source: Added default query suite to config: {0}
fr: Ajout de la suite de requêtes par défaut à la configuration : {0}
pt_br: Adicionado o pacote de consultas padrão à configuração: {0}
zh_cn: 向配置添加了默认查询套件: {0}

# ++CODE++466ad00fc6eece4d1ca46baf1d8a6faf8dffc1745c77094b4eb8fd3697fb9a28
source: Added locally
pt_br: Adicionado localmente
zh_cn: 已在本地添加

# ++CODE++e7027d80d4c05ae510621f20062db71d499cbd4f8760e3076a3530220fbf0a18
source: Adding {0} web file(s). Existing files will be skipped
cs: Přidává se {0} webových souborů. Existující soubory budou přeskočeny.
fr: Ajout du ou des fichiers Web {0}. Les fichiers existants seront ignorés
it: Aggiunta di {0} file Web in corso. I file esistenti verranno ignorati
pt_br: Adicionando {0} arquivo(s) da Web. Os arquivos existentes serão ignorados
zh_cn: 正在添加 {0} 个 Web 文件。现有文件将被跳过

# ++CODE++8890e663481705393ed3b1b4642095a11329e21320824ed567e383a12ea888f4
source: All changed files are binary files (e.g., images) and cannot be displayed in the diff viewer. You can view them individually in the file tree.
pt_br: Todos os arquivos alterados são arquivos binários (por exemplo, imagens) e não podem ser exibidos no visualizador de comparação. Você pode exibi-los individualmente na árvore de arquivos.
zh_cn: 所有更改的文件都是二进制文件(例如图像)，不能显示在差异查看器中。可以在文件树中单独查看它们。

# ++CODE++5490d0b16535529301b0cda95abc687e682b2964413863130a9a2debf61c279f
source: An imported comparison already exists for this site. Do you want to replace it?
pt_br: Já existe uma comparação importada para este site. Deseja substituí-la?
zh_cn: 此网站已存在导入的比较。是否将其替换?

# ++CODE++c910bd41bbf67f9965a2aabaec8d39b749280ffea62e9708c507374b581a331d
source: Analysis complete! Results saved to: {0}
fr: Analyse terminée. Résultats enregistrés dans : {0}
pt_br: Análise concluída! Resultados salvos em: {0}
zh_cn: 分析完成!已将结果保存到: {0}

# ++CODE++aeb9fa083d662124530feb2af1c98f6a36463b3f2d01e232517c7fb63f53f753
source: Analysis completed using query suite: {0}
fr: Analyse effectuée à l’aide de la suite de requêtes : {0}
pt_br: Análise concluída usando o pacote de consultas: {0}
zh_cn: 已使用查询套件完成分析: {0}

# ++CODE++3f82badfcbab5f7d6e5a4886a6df032cc28cdf5fe200a85bafd86101efe126c9
source: Are you sure you want to clear all the Auth Profiles?
cs: Určitě chcete vymazat všechny ověřovací profily?
es: ¿Seguro que desea borrar todos los perfiles de autenticación?
fr: Voulez-vous vraiment effacer tous les profils d’authentification ?
it: Cancellare tutti i profili di autenticazione?
ja: すべての認証プロファイルをクリアしますか?
pt_br: Tem certeza de que deseja limpar todos os Perfis de Autenticação?
ru: Вы действительно хотите удалить все профили проверки подлинности?
tr: Tüm Kimlik Doğrulama Profillerini temizlemek istediğinizden emin misiniz?
zh_cn: 是否确定要清除所有身份验证配置文件?

# ++CODE++b30fa58bd8e7489da154905f0c0d711e956f3841cf86157ca1cdd80d2b5d5499
source: Are you sure you want to delete the Auth Profile {0}-{1}?
cs: Určitě chcete odstranit ověřovací profil {0}–{1}?
es: ¿Seguro que desea eliminar el perfil de autenticación {0}-{1}?
fr: Voulez-vous vraiment supprimer le profil d’authentification {0}-{1} ?
it: Eliminare il profilo di autenticazione {0}-{1}?
ja: 認証プロファイル {0}-{1} を削除しますか?
pt_br: Tem certeza de que deseja excluir este Perfil de Autenticação de {0}, {1}?
ru: Вы действительно хотите удалить этот профиль проверки подлинности {0}-{1}?
tr: {0}-{1} Kimlik Doğrulama Profilini silmek istediğinizden emin misiniz?
zh_cn: 是否确定要删除身份验证配置文件 {0}-{1}?

# ++CODE++1d9cd153bf20c28e77061a9743a69cc8850f21221a1871f1c13b27e8470a2688
source: Are you sure you want to discard local changes to '{0}'? This action cannot be undone.
pt_br: Tem certeza de que quer descartar as alterações locais em ''{0}''? Esta ação não poderá ser desfeita.
zh_cn: 是否确定要放弃对 "{0}" 的本地更改?此操作无法撤消。

# ++CODE++2281e368458cc996be41f578298aa205b51f467dd868c44b83560c80340785af
source: Are you sure you want to discard local changes to all {0} files in '{1}'? This action cannot be undone.
pt_br: Tem certeza de que quer descartar as alterações locais em todos os {0} arquivos em ''{1}''? Esta ação não poderá ser desfeita.
zh_cn: 是否确定要放弃对 "{1}" 中所有 {0} 个文件的本地更改?此操作无法撤消。

# ++CODE++e149c8c84127919560017a77982c24d21203ea0835f21dc45f34682f5e65840d
source: Arrow icon
fr: Icône de flèche
it: Icona a forma di freccia
pt_br: Ícone de seta
zh_cn: 箭头图标

# ++CODE++1f6087c22e8b59c12a5a95c61f5811ecd795e553b7a0d7f2e337e36dc26fe509
source: Authenticating...
fr: Authentification en cours...
it: Autenticazione in corso...
pt_br: Autenticando...
zh_cn: 正在进行身份验证...

# ++CODE++360ec488e2837c8b2a005dc8637d770d584aec7ec84a1447ec98f765fc564662
source: Authentication failed after user initiated auth
pt_br: Falha na autenticação após a autenticação iniciada pelo usuário
zh_cn: 用户启动身份验证后身份验证失败

# ++CODE++93c83aa255a01cb4ee50d86e561c78b6c28e3e0f7fd9143dd7817b93b3c5a198
source: Authentication failed. Please login and try again.
fr: Échec de l’authentification. Veuillez vous connecter et réessayer.
it: Autenticazione non riuscita. Accedi e riprova.
pt_br: Falha na autenticação. Faça logon e tente novamente.
zh_cn: 身份验证失败。请登录并重试。

# ++CODE++4190475b52357e7ad3da76828784a5b9f291519e331b0c0e71f5d14e946bbc4b
source: Authentication failed. Please try again.
cs: Ověření bylo neúspěšné. Zkuste to znovu.
fr: Échec de l’authentification. Veuillez réessayer.
pt_br: Falha na autenticação. Tente novamente.
zh_cn: 身份验证失败。请重试。

# ++CODE++9ec3f488f28c5356cbb78bdef208cd2b8c773bb88098c75f2c14db955430874a
source: Authentication required...
pt_br: Autenticação necessária...
zh_cn: 需要身份验证...

# ++CODE++a57666e58a53eea23667fddf0a7c41bdc64abfc5eae94637e88388a6b139b314
source: Authorization Failed. Please run again to authorize it
cs: Autorizace se nezdařila. Opětovným spuštěním proveďte autorizaci.
es: No se pudo autorizar. Vuelva a ejecutarla para autorizarla
fr: Échec de l’autorisation. Exécutez à nouveau pour l’autoriser
it: Autorizzazione non riuscita. Esegui di nuovo per autorizzarla
ja: 認証に失敗しました。再度実行し、承認してください
pt_br: Falha na Autorização. Execute novamente para autorizar
ru: Авторизация не пройдена. Запустите ее еще раз
tr: Yetkilendirme Başarısız Oldu. Lütfen yetkilendirmek için yeniden çalıştırın.
zh_cn: 授权失败。请再次运行以进行授权

# ++CODE++bf27ec2e917b9f2578f8e6372f8656370d24cffe2c5a7b900d0b3280f8ec69fb
source: Be careful making changes. Anyone can see the changes you make immediately. Choose Edit the site to make edits, or close the editor tab to cancel without editing.
cs: Při provádění změn dávejte pozor. Kdokoli okamžitě uvidí změny, které uděláte. Pokud chcete provést úpravy, zvolte Upravit web. Pokud chcete akci zrušit bez úprav, zavřete kartu editoru.
es: Tenga cuidado al hacer cambios. Cualquier usuario puede ver inmediatamente los cambios que usted realice. Elija Editar el sitio para realizar cambios o cierre la pestaña del editor para cancelar sin hacer cambios.
fr: Soyez prudent lorsque vous apportez des modifications. Tout le monde peut voir immédiatement les modifications. Choisissez Modifier le site pour apporter des modifications, ou fermez l’onglet de l’éditeur pour annuler sans modifier.
it: Presta attenzione quando apporti le modifiche. Chiunque può vedere le modifiche che hai apportato immediatamente. Scegli Modifica il sito per apportare modifiche o chiudi la scheda dell'editor per annullare senza modificare.
ja: 変更には注意が必要です。行った変更は、すべてのユーザーに即座に表示されます。[サイトの編集] を選択して編集を行うか、エディター タブを閉じて、編集をキャンセルしてください。
pt_br: Tenha cuidado ao fazer alterações. Qualquer pessoa pode ver as alterações que você faz imediatamente. Escolha Editar o site para fazer edições ou feche a guia do editor para cancelar sem editar.
ru: Будьте внимательны при внесении изменений. Кто угодно может сразу увидеть ваши изменения. Выберите "Изменить сайт", чтобы внести изменения, или закройте вкладку редактора, чтобы выйти без редактирования.
tr: Değişiklik yaparken dikkatli olun. Herkes yaptığınız değişiklikleri anında görebilir. Düzenleme yapmak için Siteyi düzenle'yi seçin veya düzenlemeden iptal etmek için düzenleyici sekmesini kapatın.
zh_cn: 进行更改时，请务必小心。所有人都可以立即看到您所做的更改。请选择“编辑站点”以进行编辑，或者关闭编辑器选项卡以取消编辑。

# ++CODE++6fab20ee9c8b4cb1fa10d787f3cd4eac13d34d27050fd193162a2399f690f59c
source: Be careful when you're updating public sites. The changes you make are visible to anyone immediately. Do you want to continue?
fr: Soyez prudent lorsque vous mettez à jour des sites publics. Les modifications que vous apportez sont immédiatement visibles par tout le monde. Souhaitez-vous continuer ?
it: Presta attenzione quando aggiorni i siti pubblici. Le modifiche apportate sono immediatamente visibili a chiunque. Continuare?
pt_br: Tenha cuidado ao atualizar sites públicos. As alterações feitas ficam visíveis para qualquer pessoa imediatamente. Deseja continuar?
zh_cn: 更新公共站点时要小心。所有人都可以立即看到您所做的更改。是否要继续?

# ++CODE++53459da24b905cc5c62250bc26f29303b6e56df44f7f1e86fc4b6596a4aa67fd
source: Binary file - content comparison not available
pt_br: Arquivo binário - comparação de conteúdo não disponível
zh_cn: 二进制文件 - 内容比较不可用

# ++CODE++c8baac5a74383177a725f6e5cc4254c0cfddfb0ab13f295520b96a30d7c5457e
source: Binary file content is not available in imported comparisons. The original file was not included in the export.
pt_br: O conteúdo do arquivo binário não está disponível em comparações importadas. O arquivo original não foi incluído na exportação.
zh_cn: 二进制文件内容在导入的比较中不可用。导出中未包含原始文件。

# ++CODE++c58a6bd402efb06c3e7dfd6d68910412fee2dfc1788ae384dc123089ce912285
source: Browse...
fr: Parcourir...
it: Sfoglia...
pt_br: Procurar...
zh_cn: 浏览...

# ++CODE++19766ed6ccb2f4a32778eed80d1928d2c87a18d7c275ccb163ec6709d3eb2e27
source: Cancel
cs: Zrušit
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
pt_br: Cancelar
ru: Отмена
tr: İptal Et
zh_cn: 取消

# ++CODE++2007ab2650ce558e97a30b2aa70e1c881773cf3db7fbd8a430db221b06364579
source: Cannot debug: Please open a server logic file (.js) from the server-logics folder.
pt_br: Não é possível depurar: abra um arquivo de lógica do servidor (.js) da pasta server-logics.
zh_cn: 无法调试: 请从服务器逻辑文件夹打开服务器逻辑文件(.js)。

# ++CODE++75106b7b8e0c597d51e042edbde3498f813c9cd7bd59759f4dde848abc054e85
source: Cannot install Power Pages generator. Please install npm and try again.
cs: Generátor Power Pages nelze nainstalovat. Nainstalujte npm a zkuste to znovu.
fr: Impossible d’installer le générateur Power Pages. Installez npm et recommencez.
it: Impossibile installare il generatore di Power Pages. Installa npm e riprova.
pt_br: Não é possível instalar o gerador do Power Pages. Instale o npm e tente novamente.
zh_cn: 无法安装 Power Pages 生成器。请安装 npm 并重试。

# ++CODE++403c4e10526afca006129953a8e31ef13e0205d0a7305427d17838e73396ce48
source: Cannot install Power Pages generator: {0}
cs: Generátor Power Pages nelze nainstalovat: {0}
es: No se puede instalar el generador de Power Pages: {0}
fr: Impossible d’installer le générateur Power Pages : {0}
it: Impossibile installare il generatore di Power Pages: {0}
ja: Power Pages ジェネレーターをインストールできません: {0}
pt_br: Não é possível instalar o gerador do Power Pages: {0}
ru: Не удается установить генератор Power Pages: {0}
tr: Power Pages oluşturucusu yüklenemiyor: {0}
zh_cn: 无法安装 Power Pages 生成器: {0}

# ++CODE++290dca74b227930960346b4717bc1e072495aaec5ed63a9e293e2ec812fc5332
source: Cannot install pac CLI: {0}
cs: Nelze nainstalovat pac CLI: {0}
es: No se puede instalar pac CLI: {0}
fr: Impossible d’installer pac CLI : {0}
it: Impossibile installare pac CLI: {0}
ja: pac CLI をインストールできません: {0}
pt_br: Não é possível instalar a pac CLI: {0}
ru: Не удается установить pac CLI: {0}
tr: pac CLI yüklenemiyor: {0}
zh_cn: 无法安装 pac CLI: {0}

# ++CODE++ee3b92bec1620eefaad49e74f1055436ec9353e489407875694d5faf08207fa9
source: Cannot refresh an imported comparison. Import a new file or run a new comparison.
pt_br: Não é possível atualizar uma comparação importada. Importe um novo arquivo ou execute uma nova comparação.
zh_cn: 无法刷新导入的比较。导入新文件或运行新的比较。

# ++CODE++cdf024cea6f90cc5aacbe1c08a6c77b322820dc46ff96b1410e30527d7239c49
source: Changed Files
pt_br: Arquivos Alterados
zh_cn: 已更改的文件

# ++CODE++b75d741af5a9c59c95a5c7b7d9f654bb93617232db14c8d2671a5c731828782b
source: Changing environment...
fr: Changement d’environnement en cours...
it: Modifica dell'ambiente in corso...
pt_br: Alterando ambiente...
zh_cn: 正在更改环境...

# ++CODE++9885d66d0771f63c5a4b5d3b8cbe26be8832bc941243f5b18573975750a9986b
source: Check the URL and verify the parameters are correct
cs: Zkontrolujte adresu URL a ověřte správnost parametrů.
es: Compruebe la dirección URL y asegúrese de que los parámetros sean correctos
fr: Vérifiez l’URL et vérifiez que les paramètres sont corrects
it: Controlla l'URL e verifica che i parametri siano corretti
ja: URL をチェックして、パラメーターが正しいことを確認してください
pt_br: Verifique se a URL e os parâmetros estão corretos
ru: Проверьте URL-адрес и проверьте правильность параметров
tr: URL'yi denetleyin ve parametrelerin doğru olduğunu onaylayın
zh_cn: 检查 URL 并验证参数是否正确

# ++CODE++6632cd07f161cbf30f0b3c569bb72daa960ac2c0c49a90daa7cee3185f636e27
source: Checking environment...
pt_br: Verificando ambiente...
zh_cn: 正在检查环境...

# ++CODE++c724a9256b7af89455e04cc3611e5df1030c25f92652356f205c15f02c2da28e
source: Checking for active auth profile...
cs: Zjišťuje se aktivní ověřovací profil…
fr: Recherche d’un profil d’authentification actif...
it: Verifica del profilo di autenticazione attivo in corso...
pt_br: Verificando se há perfil de autenticação ativo...
zh_cn: 正在检查可用的身份验证配置文件...

# ++CODE++e1c3ec6d279ce7c1a208abce1314435297d8369739967d8a9db962ab572c617f
source: Choose page template
cs: Zvolit šablonu stránky
es: Elegir plantilla de página
fr: Choisir un modèle de page
it: Scegli modello di pagina
ja: ページ テンプレートを選択します
pt_br: Escolher modelo de página
ru: Выбрать шаблон страницы
tr: Sayfa şablonunu seçin
zh_cn: 选择页面模板

# ++CODE++2e26d2dfb9cee802cfa45d319a651b63ff4c20c05089a3d340a03aef7210002c
source: Choose parent page
cs: Zvolit nadřazenou stránku
es: Elegir página primaria
fr: Choisir la page parente
it: Scegli pagina padre
ja: 親ページを選択します
pt_br: Escolher página principal
ru: Выберите родительную страницу
tr: Üst sayfayı seçin
zh_cn: 选择父页面

# ++CODE++2c8d1f9ca282591926b952dc5949d44df6204f1f0a3f5183bcd5ef7ae5864bad
source: Choose web template
cs: Zvolit šablonu webu
es: Elegir plantilla web
fr: Choisir un modèle web
it: Scegli modello Web
ja: Web テンプレートを選択します
pt_br: Escolher modelo da Web
ru: Выберите веб-шаблон
tr: Web şablonu seçin
zh_cn: 选择 Web 模板

# ++CODE++7aaafd1c6d6875eb1cd67e841f87457e929c922a18fef7c1452c1e1a4c036456
source: Clearing cache. See [details](https://aka.ms/pages-clear-cache).
fr: Vidage du cache. Voir [les détails](https://aka.ms/pages-clear-cache).
it: Cancellazione della cache in corso. Vedi i [dettagli](https://aka.ms/pages-clear-cache).
pt_br: Limpando cache. Consulte os [detalhes](https://aka.ms/pages-clear-cache).
zh_cn: 正在清除缓存。请查看[详细信息](https://aka.ms/pages-clear-cache)。
