Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# microsoft-powerapps-portals.walkthrough.advancedCapabilities.description
source: Visual Studio Code for Web enables editing and publishing of web pages on your website. For a command line interface and more advanced capabilities, install the Power Platform Extension for VS Code, available in the VS Code Marketplace for desktop. [Learn More](command:powerplatform-walkthrough.advancedCapabilities-learn-more) about the difference between Visual Studio Code for desktop and web. [Start coding](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
cs: Visual Studio Code pro web umožňuje úpravu a publikování webových stránek na webu. Pokud chcete používat rozhraní příkazového řádku a pokročilejší možnosti, nainstalujte rozšíření Power Platform pro VS Code, které je dostupné na VS Code Marketplace pro počítače. [Další informace](command:powerplatform-walkthrough.advancedCapabilities-learn-more) o rozdílu mezi editorem Visual Studio Code pro počítače a web. [Začít kódovat](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
de: Visual Studio Code für Web ermöglicht das Bearbeiten und Veröffentlichen von Webseiten auf Ihrer Website. Für eine Befehlszeilenschnittstelle und erweiterte Funktionen installieren Sie die Power Platform-Erweiterung für VS Code, verfügbar im VS Code-Marketplace für Desktop. [Erfahren Sie mehr](command:powerplatform-walkthrough.advancedCapabilities-learn-more) über den Unterschied zwischen Visual StudioCode für Desktop und Web. [Codierung starten](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
es: Visual Studio Code para web permite editar y publicar páginas web en su sitio web. Si desea utilizar una interfaz de línea de comandos y funcionalidades más avanzadas, instale la Extensión Power Platform para VS Code, que está disponible en VS Code Marketplace para el escritorio. [Más información](command:powerplatform-walkthrough.advancedCapabilities-learn-more) sobre la diferencia entre Visual Studio Code para el escritorio y para la web. [Empiece a programar](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
ja: Web 用 Visual Studio Code を使用して、Web ページを編集して Web サイトに公開します。 コマンド ライン インターフェイスおよびより詳細な機能のために、VS Code 用 Power Platform 拡張機能をインストールします (デスクトップ用 VS Code マーケットプレースで入手可能)。 デスクトップ用と Web 用の Visual Studio Code の違いについては、[詳細情報](command:powerplatform-walkthrough.advancedCapabilities-learn-more) をご確認ください。 [コーディングの開始](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
ru: Веб-версия Visual Studio Code позволяет редактировать и публиковать страницы веб-сайта. Для работы с интерфейсом командной строки и использования расширенных функций установите расширение Power Platform для VS Code из магазина классической версии VS Code. [Подробнее](command:powerplatform-walkthrough.advancedCapabilities-learn-more) о различиях между классической и веб-версией Visual Studio Code. [Писать код](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
tr: Web için Visual Studio Code, web sitenizde web sayfalarının düzenlenmesini ve yayımlanmasını sağlar. Komut satırı arabirimi ve daha gelişmiş özellikler için Masaüstü için VS Code Marketinde sunulan VS Code için Power Platform Uzantısını yükleyin. Masaüstü ve web için Visual Studio Code arasındaki fark hakkında [daha fazla bilgi edinin](command:powerplatform-walkthrough.advancedCapabilities-learn-more). [Kodlamaya başlayın](command:powerplatform-walkthrough.advancedCapabilities-start-coding)

# ++CODE++9c1a3ec7947746271d8596f2a428139e20ff14d48e87d4631a3fc17004c170f9
source: Open in Power Pages
ru: Открыть в Power Pages
tr: Power Pages'te aç

# ++CODE++8d6329ce370e7f2cf3a5b77a73e0100c08550628408f2763deafe57dce769719
source: Try Copilot for Power Pages
ru: Попробуйте Copilot для Power Pages

# ++CODE++ab06f2880f954cfbc6788988300346315e8372cc05d92ce26ff6635c607e1406
source: Whether itâ€™s HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.
ru: Неважно, создаете вы код HTML, CSS, JS или Liquid, просто опишите свою задачу и ИИ сгенерирует код за вас.

# ++CODE++e1a694d8ed0093d17fa58ee8b44cc76f74583667ffc3511e5d8f77df7b156c41
source: Failed to get file ready for edit.
es: No se pudo preparar el archivo para su edición.
ja: ファイルの編集準備に失敗しました。
tr: Dosya düzenlenmek üzere alınamadı.

# ++CODE++0906cdfd1c60099397a97c4da29453b3f0cef126c408d6ba317e2d5e2d5e9e78
source: Resource: {0}
es: Recurso: {0}
ja: リソース: {0}
tr: Kaynak: {0}

# ++CODE++91357f5ee585bec70c13f9f0807c5a047f35066e4fc63b571f5a957a657d0262
source: We encountered an error preparing the file for edit.
es: Se detectó un error al preparar el archivo para su edición.
ja: ファイルの編集準備中にエラーが発生しました。
tr: Dosya düzenlemeye hazırlanırken bir hatayla karşılaştık.

# ++CODE++315cb81be825c1f87db8249e03180f9561436c9b79693c5cdfba05edb619c793
source: Display Name: {0} Unique Name: {1} Version: {2}
es: Nombre para mostrar: {0} Nombre único: {1} Versión: {2}

# ++CODE++c8fe15ab6371ebd955e8123fd897da623cad8dc11564548e7b4cf9b7e991120c
source: Failed to fetch file content.
es: No se pudo capturar contenido del archivo.

# microsoft-powerapps-portals.walkthrough.description
source: Discover how you can make complete, modern websites right in VS Code
de: Erfahren Sie, wie Sie vollständige und moderne Websites direkt in VS Code erstellen können.
es: Descubra cómo puede crear sitios web completos y modernos directamente en VS Code

# microsoft-powerapps-portals.walkthrough.fileSystem.title
source: File system
de: Dateisystem
es: Sistema de archivos

# microsoft-powerapps-portals.webExtension.limitation
source: PAC CLI is not supported in VS Code for the Web
de: PAC CLI wird im VS Code für das Web nicht unterstützt
es: PAC CLI no se admite en VS Code para la Web

# microsoft-powerapps-portals.walkthrough.overview.description
source: Power Pages extension enables a customized file system which is synced with the project structure of the Power Pages studio. [Learn More](command:powerplatform-walkthrough.overview-learn-more)
es: La extensión de Power Pages permite disponer de un sistema de archivos personalizado que se sincroniza con la estructura del proyecto del estudio de diseño de Power Pages. [Más información](command:powerplatform-walkthrough.overview-learn-more)

# microsoft-powerapps-portals.walkthrough.fileSystem.description
source: Your files are stored in nested folders under your site name. The individual page files can be found in the web-pages folder under your site name. All of your pages are arranged into HTML, CSS and JS files inside the folder with the respective page name. To learn more about the Power Pages file system in VS Code for Web, visit our [documentation](command:powerplatform-walkthrough.fileSystem-documentation). [Open site folder](command:powerplatform-walkthrough.fileSystem-open-folder)
de: Ihre Dateien werden in geschachtelten Ordnern unter Ihrem Websitenamen gespeichert. Die einzelnen Seitendateien finden Sie im Webseitenordner unter Ihrem Websitenamen. Alle Seiten sind in HTML-, CSS- und JS-Dateien im Ordner mit dem jeweiligen Seitennamen angeordnet. Weitere Informationen zum Power Pages-Dateisystem in VS Code für Web finden Sie in unserer [Dokumentation](command:powerplatform-walkthrough.fileSystem-documentation). [Websiteordner öffnen](command:powerplatform-walkthrough.fileSystem-open-folder)
es: Sus archivos se almacenan en carpetas anidadas bajo el nombre del sitio. Los archivos de página individuales se pueden encontrar en la carpeta de páginas web bajo el nombre de su sitio. Todas sus páginas están organizadas en archivos HTML, CSS y JS dentro de la carpeta con el nombre de página respectivo. Para obtener más información sobre el sistema de archivos de Power Pages en VS Code para web, visite nuestra [documentación](command:powerplatform-walkthrough.fileSystem-documentation). [Abrir carpeta del sitio](command:powerplatform-walkthrough.fileSystem-open-folder)

# cliAquisition.preparingMessage
source: Preparing pac CLI (v{0})...
de: pac CLI (v{0}) wird vorbereitet...

# cliAquisition.successMessage
source: The pac CLI is ready for use in your VS Code terminal!
de: Die pac CLI ist in Ihrem VS-Code-Terminal zur Verwendung bereit!

# cliAquisition.installationErrorMessage
source: Cannot install pac CLI: {0}
de: pac CLI kann nicht installiert werden: {0}

# pacCLI.authPanel.clearAuthProfile.confirm
source: Confirm
de: Bestätigen

# pacCLI.authPanel.clearAuthProfile.prompt
source: Are you sure you want to clear all the Auth Profiles?
de: Möchten Sie wirklich alle Authentifizierungsprofile löschen?

# pacCLI.authPanel.clearAuthProfile.cancel
source: Cancel
de: Abbrechen

# pacCLI.authPanel.deleteAuthProfile.confirm
source: Confirm
de: Bestätigen

# pacCLI.authPanel.deleteAuthProfile.prompt
source: Are you sure you want to delete the Auth Profile {0}-{1}?
de: Möchten Sie das Authentifizierungsprofil {0}-{1} wirklich löschen?

# pacCLI.authPanel.deleteAuthProfile.cancel
source: Cancel
de: Abbrechen

# pacCLI.authPanel.nameAuthProfile.prompt
source: The name you want to give to this authentication profile
de: Der Name, den Sie diesem Authentifizierungsprofil geben möchten

# pacCLI.authPanel.nameAuthProfile.validation
source: Maximum 30 characters allowed
de: Maximal 30 Zeichen zulässig

# pacCLI.enableTelemetry.successMessage
source: PAC Telemetry enabled
de: PAC-Telemetrie aktiviert

# pacCLI.enableTelemetry.failureMessage
source: Failed to enable PAC telemetry.
de: PAC-Telemetrie konnte nicht aktiviert werden.

# pacCLI.disableTelemetry.successMessage
source: PAC Telemetry disabled
de: PAC-Telemetrie deaktiviert

# pacCLI.disableTelemetry.failureMessage
source: Failed to disable PAC telemetry.
de: PAC-Telemetrie konnte nicht deaktiviert werden.

# pacCLI.AuthProfileTreeItem.toolTipParts.profileKind
source: Profile Kind: {0}
de: Profil-Variante: {0}

# pacCLI.AuthProfileTreeItem.toolTipParts.resource
source: Resource: {0}
de: Ressource: {0}

# pacCLI.AuthProfileTreeItem.toolTipParts.user
source: User: {0}
de: Benutzer: {0}

# pacCLI.AuthProfileTreeItem.toolTipParts.cloudInstance
source: Cloud Instance: {0}
de: Clound-Instanz: {0}

# pacCLI.EnvOrSolutionTreeItem.toolTip
source: Display Name: {0} Unique Name: {1} Version: {2}
de: Anzeigename: {0} Eindeutiger Name: {1} Version: {2}

# microsoft-powerapps-portals.webExtension.init.sitevisibility.edit
source: Edit the site
de: Website bearbeiten

# microsoft-powerapps-portals.webExtension.init.sitevisibility.edit.desc
source: Be careful making changes. Anyone can see the changes you make immediately. Choose Edit the site to make edits, or close the editor tab to cancel without editing.
de: Vorsicht beim Vornehmen von Änderungen. Alle Benutzer können die vorgenommenen Änderungen sofort sehen. Wählen Sie „"Website bearbeiten“ aus, um Änderungen vorzunehmen, oder schließen Sie die Editorregisterkarte, um die Bearbeitung abzubrechen.

# microsoft-powerapps-portals.webExtension.init.sitevisibility.edit.title
source: You are editing a live, public site
de: Sie bearbeiten eine öffentliche Live-Website

# microsoft-powerapps-portals.webExtension.init.error
source: There was a problem opening the workspace
de: Problem beim Öffnen des Arbeitsbereichs

# microsoft-powerapps-portals.webExtension.init.error.desc
source: Try refreshing the browser
de: Versuchen Sie, den Browser zu aktualisieren

# microsoft-powerapps-portals.webExtension.init.app-not-found
source: Unable to find that app
de: Diese App wurde nicht gefunden

# microsoft-powerapps-portals.webExtension.init.authorization.error
source: Authorization Failed. Please run again to authorize it
de: Fehler bei der Autorisierung. Erneut ausführen, um zu autorisieren

# microsoft-powerapps-portals.webExtension.init.workspace.error
source: There was a problem opening the workspace
de: Problem beim Öffnen des Arbeitsbereichs

# microsoft-powerapps-portals.webExtension.init.workspace.error.desc
source: Check the URL and verify the parameters are correct
de: Prüfen Sie die URL, und stellen Sie sicher, dass die Parameter korrekt sind

# microsoft-powerapps-portals.webExtension.parameter.error
source: There was a problem opening the workspace
de: Problem beim Öffnen des Arbeitsbereichs

# microsoft-powerapps-portals.webExtension.parameter.desc
source: Check the URL and verify the parameters are correct
de: Prüfen Sie die URL, und stellen Sie sicher, dass die Parameter korrekt sind

# microsoft-powerapps-portals.webExtension.backend.error
source: Thereâ€™s a problem on the back end
de: Problem mit dem Backend

# microsoft-powerapps-portals.webExtension.backend.desc
source: Try again
de: Erneut versuchen

# microsoft-powerapps-portals.webExtension.unauthorized.error
source: Authorization Failed. Please run again to authorize it
de: Fehler bei der Autorisierung. Erneut ausführen, um zu autorisieren

# microsoft-powerapps-portals.webExtension.unauthorized.desc
source: There was a permissions problem with the server
de: Problem mit dem Berechtigungen für den Server

# microsoft-powerapps-portals.webExtension.parameter.error
source: One or more commands are invalid or malformed
de: Mindestens ein Befehl ist ungültig oder nicht wohlgeformt

# microsoft-powerapps-portals.webExtension.parameter.desc
source: Check the parameters and try again
de: Überprüfen Sie die Parameter, und versuchen Sie es erneut

# microsoft-powerapps-portals.webExtension.fetch.authorization.error
source: Authorization Failed. Please run again to authorize it
de: Fehler bei der Autorisierung. Erneut ausführen, um zu autorisieren

# microsoft-powerapps-portals.webExtension.fetch.authorization.desc
source: Try again
de: Erneut versuchen

# microsoft-powerapps-portals.webExtension.file-not-found.error
source: That file is not available
de: Diese Datei ist nicht verfügbar

# microsoft-powerapps-portals.webExtension.file-not-found.desc
source: The metadata may have changed on the Dataverse side. Contact your admin.
de: Die Metadaten wurden möglicherweise auf Dataverse-Seite geändert. Wenden Sie sich an den Administrator.

# microsoft-powerapps-portals.webExtension.fetch.file.message
source: Fetching your file ...
de: Datei wird abgerufen ...

# microsoft-powerapps-portals.webExtension.save.file.message
source: Saving your file ...
de: Datei wird gespeichert ...

# microsoft-powerapps-portals.webExtension.save.file.error
source: Unable to complete the request
de: Die Anforderung kann nicht fertig gestellt werden

# microsoft-powerapps-portals.webExtension.save.file.error.desc
source: One or more attribute names have been changed or removed. Contact your admin.
de: Mindestens ein Attributname wurde geändert oder entfernt. Wenden Sie sich an den Administrator.

# microsoft-powerapps-portals.webExtension.retry.desc
source: Try again
de: Erneut versuchen
