Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# ++CODE++b985f1515c42b4b5b0c11a3d7b3286fc9d66997d476668ab1f93a4a11499fef5
source: Failed to create a new Power Pages site. Please try again.
fr: Échec de la création d’un site Power Pages. Veuillez réessayer.
it: Impossibile creare un nuovo sito Power Pages. Riprova.
pt_br: Falha ao criar um site do Power Pages. Tente novamente.
zh_cn: 无法创建新的 Power Pages 站点。请重试。

# ++CODE++2310c6b7e5953cab877859ba1fcfa98e58e1508677df9412010e9b578ea237f4
source: Failed to create: {0}.
cs: Nepodařilo se vytvořit: {0}
es: No se pudo crear: {0}.
fr: Échec de la création de : {0}.
it: Impossibile creare: {0}.
ja: 作成できませんでした: {0}。
pt_br: Falha ao criar: {0}.
ru: Не удалось создать: {0}.
tr: Oluşturulamadı: {0}.
zh_cn: 无法创建: {0}。

# ++CODE++d41633e985dc5f5045a42992788b803ca24b0b8d8f42d8db8f0ff08807d7299a
source: Failed to disable PAC telemetry.
cs: Telemetrii PAC se nepodařilo zakázat.
es: No se pudo deshabilitar la telemetría de PAC.
fr: Impossible de désactiver la télémétrie PAC.
it: Impossibile disabilitare telemetria PAC.
ja: PAC テレメトリを無効にできませんでした。
pt_br: Falha ao desabilitar a telemetria de PAC.
ru: Не удалось отключить телеметрию PAC.
tr: PAC telemetrisi devre dışı bırakılamadı.
zh_cn: 无法禁用 PAC 遥测。

# ++CODE++bae865c75bb42b029c9b92f7c0abb122a2615c2f0f5a658b1633df8f9e921a16
source: Failed to discard local changes: {0}
pt_br: Falha ao descartar as alterações locais: {0}
zh_cn: 未能放弃本地更改: {0}

# ++CODE++95da24b6bc127a935e2e4323fe85d8f46be20c5e8ca5e10c6a134e5a0c6443a2
source: Failed to enable PAC telemetry.
cs: Telemetrii PAC se nepodařilo povolit.
es: No se pudo habilitar la telemetría de PAC.
fr: Impossible d’activer la télémétrie PAC.
it: Impossibile abilitare telemetria PAC.
ja: PAC テレメトリを有効にできませんでした。
pt_br: Falha ao habilitar a telemetria de PAC.
ru: Не удалось включить телеметрию PAC.
tr: PAC telemetrisi etkinleştirilmedi.
zh_cn: 无法启用 PAC 遥测。

# ++CODE++43dbf70c21c86c0ae92c85969872317a7a1e68ced8adb94059fafd83cac30eb5
source: Failed to export comparison: {0}
pt_br: Falha ao exportar a comparação: {0}
zh_cn: 未能导出比较: {0}

# ++CODE++83d9d98e86aca9239f8a2635a98356d956268fb41a465fbc039b9ac979c61649
source: Failed to fetch some files.
cs: Nepodařilo se načíst některé soubory.
fr: Échec de récupération de certains fichiers.
it: Impossibile recuperare alcuni file.
ja: 一部のファイルを取得できませんでした。
pt_br: Falha ao buscar alguns arquivos.
ru: Не удалось получить некоторые файлы.
tr: Bazı dosyalar alınamadı.
zh_cn: 无法获取部分文件。

# ++CODE++d604dc348b4d883f4a77c906c97d37e94d3f936c4ad815621d988bf5772b4ecb
source: Failed to generate HTML report: {0}
pt_br: Falha ao gerar o relatório HTML: {0}
zh_cn: 未能生成 HTML 报表: {0}

# ++CODE++f4948aad45ee9baaf762fbd640c551dc397190efdd9fb87468b559502ece927c
source: Failed to generate VS Code Desktop URL: {0}
fr: Échec de la génération de l’URL VS Code Desktop : {0}
pt_br: Falha ao gerar a URL do VS Code Desktop: {0}
zh_cn: 未能生成 VS Code 桌面 URL: {0}

# ++CODE++862d6197d64601aa13ce30db5ec5b8f819ad00fe21e3b031a3e47fe22ef68fb3
source: Failed to get file ready for edit: {0}
cs: Soubor se nepodařilo připravit k úpravám: {0}
fr: Impossible de préparer le fichier pour la modification : {0}
it: Impossibile preparare il file per la modifica: {0}
pt_br: Falha ao preparar o arquivo para edição: {0}
ru: Не удалось получить файл для редактирования: {0}
zh_cn: 无法获取可供编辑的文件: {0}

# ++CODE++78900eaa5444b623de50e2df5c46a35ee65a934a17bf9a1d619e275f1e6a529c
source: Failed to get organization details. Please try again later
fr: Impossible de récupérer les détails sur l’organisation. Veuillez réessayer plus tard
it: Impossibile recuperare i dettagli dell'organizzazione. Riprova più tardi
pt_br: Falha ao obter detalhes da organização. Tente novamente mais tarde
zh_cn: 无法获取组织详细信息。请稍后重试

# ++CODE++51e1f5c5757cfd25a390293a7d8e9eb583943b66211fae1cbe25d07bfcb767f1
source: Failed to get website endpoint. Please try again later
fr: Impossible d’obtenir un point de terminaison du site web. Veuillez réessayer plus tard
it: Impossibile recuperare l'endpoint del sito Web. Riprova più tardi
pt_br: Falha ao obter ponto de extremidade do site. Tente novamente mais tarde
zh_cn: 无法获取网站终结点。请稍后重试

# ++CODE++fc80bc8b6f74fff75eee85e53e42036bc6069a2fa632337a52789dacf96e9ba9
source: Failed to handle Power Pages URI: {0}
fr: Échec de la gestion de l’URI Power Pages : {0}
pt_br: Falha ao manipular a URI do Power Pages: {0}
zh_cn: 未能处理 Power Pages URI: {0}

# ++CODE++01f0b1383686ea2dbed659b38128c80a17f90fd15b9c8636871a01f34fbd0f2c
source: Failed to import comparison: {0}
pt_br: Falha ao importar a comparação: {0}
zh_cn: 未能导入比较: {0}

# ++CODE++7df498affc70b3844ab77806857554f50899316597e96d91097dcefd8e225024
source: Failed to initialize Server Logic debugger: {0}
pt_br: Falha ao inicializar o depurador de Lógica do Servidor: {0}
zh_cn: 未能初始化服务器逻辑调试器: {0}

# ++CODE++9696573fbb3df8812e2d0b83aa3d9077681bf992c9f9514fbbb81fcc7787560d
source: Failed to install SARIF viewer extension. Opening results as text file.
fr: Échec de l’installation de l’extension de visionneuse SARIF. Ouverture des résultats sous forme de fichier texte.
pt_br: Falha ao instalar a extensão do visualizador SARIF. Abrindo resultados como arquivo de texto.
zh_cn: 未能安装 SARIF 查看器扩展。正在以文本文件形式打开结果。

# ++CODE++83f3ed1048ce17af62e4baf0dd046ec8571cb8ae602ad853025266a023de8061
source: Failed to install SARIF viewer extension: {0}
fr: Échec de l’installation de l’extension de visionneuse SARIF : {0}
pt_br: Falha ao instalar a extensão do visualizador SARIF: {0}
zh_cn: 未能安装 SARIF 查看器扩展: {0}

# ++CODE++f865b154a9a2097159a09be82db76a9b29afc71df9ad86b9c08253f2e805d23c
source: Failed to open in VS Code Desktop: {0}
fr: Échec de l’ouverture dans VS Code Desktop : {0}
pt_br: Falha ao abrir no VS Code Desktop: {0}
zh_cn: 未能在 VS Code 桌面中打开: {0}

# ++CODE++3ae8538d5c7a65434c88e17ef8360aa3eb2c80dd577f3daad2d41d58d83353c9
source: Failed to switch to required environment
pt_br: Falha ao alternar para o ambiente necessário
zh_cn: 未能切换到所需环境

# ++CODE++a9e36b880dd45b64ae5601865540605296febf9bd855fc46d9c35c2c2ed9a7f2
source: Feature is not enabled for this geo.
cs: Funkce není v této geografické oblasti povolena.
fr: La fonctionnalité n’est pas activée pour cette zone géographique.
it: La funzionalità non è abilitata per questa area geografica.
pt_br: O recurso não está habilitado para esta área geográfica.
zh_cn: 未为此地区启用功能。

# ++CODE++aac77df347205252b074d45aff7891debdba0ff1466cc0c351416d1662bb71ab
source: Feedback
cs: Názory
fr: Commentaires
pt_br: Comentários
zh_cn: 反馈

# ++CODE++1b600fc82f2c98dc384adb9fa255ff5914978d978928c8aa5e56bf5fc64980b2
source: Fetching websites from '{0}'...
pt_br: Buscando sites em '{0}'...
zh_cn: 正在从“{0}”提取网站...

# ++CODE++2a8ddde521f14ecd4a8717f2bcf9a2b021fa38a578518066d2ae32271aa95237
source: Fetching your file ...
cs: Načítá se soubor...
es: Capturando su archivo...
fr: Récupération de votre fichier en cours...
it: Recupero del file in corso...
ja: ファイルを取得しています...
pt_br: Buscando seu arquivo...
ru: Извлечение файла...
tr: Dosyanız alınıyor...
zh_cn: 正在提取文件...

# ++CODE++7b351789f09522eb21ab2637f1b063ff2a41451a7130138b41f142a6fe5d249e
source: File might be referenced by name {0} here.
cs: Na soubor zde může být odkazováno názvem {0}.
es: Se puede hacer referencia al archivo por su nombre {0} aquí.
fr: Il se peut que le fichier soit référencé sous le nom {0} ici.
it: È possibile che qui si faccia riferimento al file con il nome {0}.
ja: ここではファイルが {0} の名前で参照されている可能性があります。
pt_br: O arquivo pode ser referenciado pelo nome {0} aqui.
ru: Здесь файл может быть задан именем {0}.
tr: Dosyaya burada {0} adıyla başvurulmuş olabilir.
zh_cn: 文件可能由此处的名称 {0} 引用。

# ++CODE++1b93e507157d91755f08e1abfe8a33d725b637a32ddadf149420b25907d440a0
source: File(s) already exist. No new files to add
cs: Soubory už existují. Nemáte žádné nové soubory k přidání.
es: Los archivos ya existen. No hay archivos nuevos que agregar
fr: Le ou les fichiers existent déjà. Aucun nouveau fichier à ajouter
it: I file esistono già. Nessun nuovo file da aggiungere
ja: ファイルは既に存在します。追加する新しいファイルはありません
pt_br: Os arquivos já existem. Nenhum novo arquivo a adicionar
ru: Файлы уже существуют. Нет новых файлов для добавления
tr: Dosyalar zaten mevcut. Eklenecek yeni dosya yok.
zh_cn: 文件已存在。没有要添加的新文件

# ++CODE++12610d51818dd67082559a8f1d9a141559d996fad6fe34aa3dbf70281bea4572
source: File: {0}
fr: Fichier : {0}
pt_br: Arquivo: {0}
zh_cn: 文件: {0}

# ++CODE++4c152c6eaba506f1e585f1fe8424b694874ccf652f4bdebb5e333ed518e9e428
source: Found CodeQL CLI at: {0}
fr: CLI CodeQL trouvée à l’adresse : {0}
pt_br: CLI do CodeQL encontrada em: {0}
zh_cn: 在以下位置找到了 CodeQL CLI: {0}

# ++CODE++b3207bdd6cac96d95953611b3858336761212450b6e02c59f048ee17aa654797
source: Found CodeQL CLI via extension API: {0}
fr: CLI CodeQL trouvée via l’API d’extension : {0}
pt_br: CLI do CodeQL encontrada por meio da API de extensão: {0}
zh_cn: 通过扩展 API 找到了 CodeQL CLI: {0}

# ++CODE++3c30b323f4457a82892f7ff1b0e8bf7852618289536ba3f3e08c4b0e7b44d514
source: Found PowerPages config file: {0}
fr: Fichier config PowerPages trouvé : {0}
pt_br: Arquivo de configuração do PowerPages encontrado: {0}
zh_cn: 找到了 PowerPages 配置文件: {0}

# ++CODE++bb38f4fcf83f9428cc8a10ad72256cf8a9536ea56209c10b1db2cea2506b740e
source: Found distribution directories: {0}
fr: Répertoires de distribution trouvés : {0}
pt_br: Diretórios de distribuição encontrados: {0}
zh_cn: 找到了分发目录: {0}

# ++CODE++84fc80613184b5761895bd6c0ba43882610a232b56d4815581cb6a054e7f231e
source: Found {0} issue(s):
fr: {0} problème(s) trouvé (s) :
pt_br: Encontrado {0} problema(s):
zh_cn: 找到了 {0} 个问题:

# ++CODE++56281cd1d0090cc4c7c38634a5738f51769927efda74805ba19e30e35868fd4e
source: Friendly name: {0}
fr: Nom convivial : {0}
it: Nome descrittivo: {0}
pt_br: Nome amigável: {0}
zh_cn: 易记名称: {0}

# ++CODE++7184a5edf42e6fc9ef8f53fc1dd73f10b3f6196a23f6d340c4f434e60c366e45
source: GETTING STARTED
cs: ZAČÍNÁME
fr: DÉMARRAGE
it: ATTIVITÀ INIZIALI
pt_br: INTRODUÇÃO
zh_cn: 开始

# ++CODE++9a0fee38744b1ebd6dee64a438507d597635a5773f9ecea2f587a1b560808d4b
source: Generated by
pt_br: Gerado por
zh_cn: 生成者

# ++CODE++c7107175191436eb55e7271e43e636b598d8c80cbf2a9a32ac42bc03222f053c
source: Generated:
pt_br: Gerado:
zh_cn: 已生成:

# ++CODE++c4c059b39483b39ccf3cb056feaa5e400e252a9c558deecdf8d301c1dac9485b
source: Generating a new Power Pages site...
fr: Génération d’un nouveau site Power Pages en cours...
it: Generazione di un nuovo sito di Power Pages in corso...
pt_br: Gerando um novo site do Power Pages...
zh_cn: 正在生成新的 Power Pages 站点...

# ++CODE++46be031ab391443c1736cb8c7032c5b07b159164f48f5b86fe135465e3255571
source: Generating webpages...
fr: Génération de pages Web...
it: Generazione delle pagine Web in corso...
pt_br: Gerando páginas Web...
zh_cn: 正在生成网页...

# ++CODE++ee1d3100df4b00eabd74481b92106e42cce956213372a914082f82702f56470d
source: Get GitHub Copilot to try @powerpages
cs: Pořiďte si GitHub Copilota a vyzkoušejte @powerpages
fr: Obtenir GitHub Copilot pour essayer @powerpages
it: Recupera GitHub Copilot per provare @powerpages
pt_br: Obtenha o GitHub Copilot para experimentar o @powerpages
zh_cn: 获取 GitHub Copilot 以试用 @powerpages

# ++CODE++1a1075387e5e1674a11f58f6aadd4e0abc63e1e3d201ae980b12a37e6d5a584b
source: Getting organization details...
fr: Obtention des détails de l’organisation...
it: Recupero dei dettagli dell'organizzazione in corso...
pt_br: Obtendo detalhes da organização...
zh_cn: 正在获取组织详细信息...

# ++CODE++6f1bba10af9069a03da80d629b97c40fc4bedaf90a23496a2bdef0c512a92959
source: Getting region information...
fr: Récupération des informations sur la région...
it: Recupero informazioni area geografica in corso...
pt_br: Obtendo informações da região...
zh_cn: 正在获取区域信息...

# ++CODE++0087988cdb71080f2525354e125366c6db7d85a36f199e2f80d14a44b3fd0340
source: Getting website endpoint...
fr: Obtention du point de terminaison du site web...
it: Recupero dell'endpoint del sito Web in corso...
pt_br: Obtendo ponto de extremidade do site...
zh_cn: 正在获取网站终结点...

# ++CODE++7b9ca5026e65057a17f951928bd53dc4e7724c0850490d6237636e9d568db4b1
source: HTML report saved successfully to '{0}'.
pt_br: Relatório HTML salvo com êxito em '{0}'.
zh_cn: 已成功将 HTML 报表保存到“{0}”。

# ++CODE++b9f4adbdfa2deef1eaa415a914f63329ee06c604b5a1bf34645175b9e28a9712
source: Here are a few suggestions to get you started
cs: Zde je několik návrhů, které vám pomohou začít
fr: Voici quelques suggestions pour vous aider à vous lancer
it: Ecco alcuni suggerimenti per iniziare
pt_br: Veja algumas sugestões para começar
zh_cn: 以下是一些有助于您开始使用的建议

# ++CODE++3639efcd08abb273b1619e82e78c29a7df02c1051b1820e99fc395dcaa3326b8
source: Hi
cs: Dobrý den!
fr: Bonjour
it: Ciao
pt_br: Olá
zh_cn: 您好

# ++CODE++f307e9947391e3b9ba6e7a7da781c995fcfc8647e780127a4c475b67fccd4d0c
source: Hi! @powerpages can help you write, edit, and even summarize your website code.
cs: Zdravím! @powerpages vám pomůže napsat, upravit a dokonce shrnout kód vašeho webu.
fr: Bonjour ! @powerpages vous aider à écrire, modifier et même résumer le code de votre site web.
it: Ciao! @powerpages può aiutarti a scrivere, modificare e anche riepilogare il codice del sito Web.
pt_br: Olá! O @powerpages pode ajudar você a escrever, editar e até mesmo resumir o código do seu site.
zh_cn: 嗨! @powerpages 可以帮助您编写、编辑甚至汇总网站代码。

# ++CODE++57fa6bc42ff8a73f5c9271ebe8a92febd9ec652aea94798eb9023c5512b9dab1
source: Hi! Instantly generate code for Power Pages sites by typing in what you need. To start using Copilot, log in to your Microsoft account.
cs: Dobrý den! Když napíšete, co potřebujete, okamžitě se vygeneruje kód pro weby Power Pages. Chcete-li začít používat Copilota, přihlaste se ke svému účtu Microsoft.
fr: Salut ! Générez instantanément le code des sites Power Pages en tapant ce dont vous avez besoin. Pour commencer à utiliser Copilot, connectez-vous à votre compte Microsoft.
it: Ciao! Genera immediatamente il codice per i siti di Power Pages digitando ciò che ti serve. Per iniziare a utilizzare Copilot, accedi al tuo account Microsoft.
pt_br: Olá! Gere instantaneamente código para sites do Power Pages ao digitar o que você precisa. Para começar a utilizar o Copilot, inicie sessão na sua conta Microsoft.
zh_cn: 您好! 请输入所需的内容以立即生成 Power Pages 站点的代码。若要开始使用 Copilot，请登录您的 Microsoft 帐户。

# ++CODE++61dd014ff85ae4c042dbfd3b581668ee350e515d4abbf0d682df335b22bf703a
source: Hi! Power Pages lets you build secure, professional websites that you can quickly configure and publish across web browsers and devices. To create your website, visit the [Power Pages](https://powerpages.microsoft.com/). Return to this chat and @powerpages can help you write and edit your website code.
fr: Bonjour, Power Pages vous permet de créer des sites web sécurisés et professionnels que vous pouvez rapidement configurer et publier sur tous les navigateurs web et appareils. Pour créer votre site web, visitez la page [Power Pages](https://powerpages.microsoft.com/). Revenez à cette conversation et @powerpages peut vous aider à écrire et à modifier le code de votre site web.
it: Ciao! Power Pages consente di creare siti Web sicuri e professionali che puoi configurare e pubblicare rapidamente in Web browser e dispositivi. Per creare il tuo sito Web, visita [Power Pages](https://powerpages.microsoft.com/). Torna in questa chat e @powerpages potrà aiutarti a scrivere e modificare il codice del tuo sito Web.
pt_br: Olá! O Power Pages permite que você crie sites seguros e profissionais que podem ser configurados e publicados rapidamente em navegadores e dispositivos da Web. Para criar seu site, visite o [Power Pages](https://powerpages.microsoft.com/). Retorne a este chat e o @powerpages poderá ajudar você a escrever e editar o código do seu site.
zh_cn: 你好! 借助 Power Pages，可以构建安全、专业的网站，以便跨 Web 浏览器和设备快速配置和发布。 要创建网站，请访问 [Power Pages](https://powerpages.microsoft.com/)。 返回到此聊天，@powerpages 可以帮助编写和编辑网站代码。

# ++CODE++1d9bc50f05b58d430726840f771cd25056be57873eb33a5d6aeedfff2ca7e2db
source: Hi! Your Microsoft account doesn’t currently support Copilot. Contact your admin for details.
fr: Bonjour, Votre compte Microsoft ne prend actuellement pas en charge Copilot. Pour plus d’informations, contactez votre administrateur.
it: Ciao! Il tuo account Microsoft al momento non supporta Copilot. Per informazioni dettagliate, contatta l'amministratore.
pt_br: Olá! No momento, sua conta Microsoft não dá suporte ao Copilot. Entre em contato com seu administrador para obter mais detalhes.
zh_cn: 你好! Microsoft 帐户当前不支持 Copilot。有关详细信息，请与管理员联系。

# ++CODE++fd6f929754f9e7358fbf47dfa5bdb5453b0866d18e8f50b2e915366dc64a1b14
source: Import Metadata Diff
pt_br: Importar Comparação de Metadados
zh_cn: 导入元数据差异

# ++CODE++721266427f4f6ab7a5409839b7675a73aed355db0e876c0464f100c99c4158f6
source: Importing comparison...
pt_br: Importando comparação...
zh_cn: 正在导入比较...

# ++CODE++08295f3385931e35c850b945e2ae04882452c4bf0dd575f70e95aaa6ed00daa9
source: In your own words, describe what you need. You can get help with writing code for Power Pages sites in HTML, CSS, and JS languages.
cs: Svými vlastními slovy popište, co potřebujete. Můžete získat pomoc s psaním kódu pro weby Power Pages v jazycích HTML, CSS a JS.
fr: Avec vos propres mots, décrivez ce dont vous avez besoin. Vous pouvez obtenir de l’aide sur l’écriture du code pour les sites Power Pages en langages HTML, CSS et JS.
it: Descrivi ciò di cui hai bisogno con parole tue. Puoi ottenere assistenza con la scrittura di codice per i siti Power Pages nei linguaggi HTML, CSS e JS.
pt_br: Em suas próprias palavras, descreva o que você precisa. Você pode obter ajuda para escrever código para sites do Power Pages nas linguagens HTML, CSS e JS.
zh_cn: 用您自己的话描述需求。您可以获取有关使用 HTML、CSS 和 JS 语言为 Power Pages 站点撰写代码的帮助。

# ++CODE++3dbd55d3a97fd4cb21b3c56d8413a25157e099b74e2315575af1cce16bde65d5
source: Inactive Sites
fr: Sites inactifs
it: Siti inattivi
pt_br: Sites Inativos
zh_cn: 停用站点

# ++CODE++a22418694e3938cc42976630bcd24822ed4f671b168708e0641171440ca8f6dd
source: Initializing site preview
fr: Initialisation de l’aperçu du site
it: Inizializzazione dell'anteprima del sito in corso
pt_br: Inicializando visualização do site
zh_cn: 正在初始化站点预览

# ++CODE++15b09c32b0337229ff64c72f2ea9a3f8422fa20975ae494da863fd738554b1de
source: Initializing site preview. Please try again after few seconds.
fr: Initialisation de l’aperçu du site. Réessayez dans quelques secondes.
it: Inizializzazione dell'anteprima del sito in corso. Riprova tra alcuni secondi.
pt_br: Inicializando visualização do site. Tente novamente após alguns segundos.
zh_cn: 正在初始化站点预览。请等待几秒钟后重试。

# ++CODE++e992151b1efc99f93484c7d7f3076b66ab072a8af2383e96104cc597c971339c
source: Insert code into editor
cs: Vložit kód do editoru
fr: Insérer un code dans l’éditeur
it: Inserisci codice nell'editor
pt_br: Inserir código no editor
zh_cn: 将代码插入编辑器

# ++CODE++569ca49f4aaf7846e952c1d4aeca72febd0b79fa1c4f9db08fd3127551218572
source: Install
fr: Installer
it: Installa
pt_br: Instalar
zh_cn: 安装

# ++CODE++25109e9c19daeeed3977b84ace83722ac8a4daafcfe4e3709082fcc5b228e7a8
source: Installing Power Pages generator(v{0})...
cs: Instaluje se generátor Power Pages (verze {0})...
es: Instalando el generador de Power Pages (v{0})...
fr: Installation du générateur Power Pages (v{0})...
it: Installazione del generatore di Power Pages in corso(v{0})...
ja: Power Pages ジェネレーター (v{0}) をインストールしています...
pt_br: Instalando o gerador do Power Pages(v{0})...
ru: Установка генератора Power Pages (v{0})...
tr: Power Pages oluşturucusu (v{0}) yükleniyor...
zh_cn: 正在安装 Power Pages 生成器(v{0})...

# ++CODE++5caff26b08726c8c726419c5f1ec44de8533973c9e3220d3af6b4a29b1c05957
source: Installing SARIF viewer extension...
fr: Installation de l’extension de visionneuse SARIF...
pt_br: Instalando a extensão do visualizador SARIF...
zh_cn: 正在安装 SARIF 查看器扩展...

# ++CODE++f351355077e2d6b421620f76832f108d9b4d84f31c14857d802cd8db01e4d330
source: Instance url: {0}
fr: URL de l’instance : {0}
it: URL istanza: {0}
pt_br: URL da instância: {0}
zh_cn: 实例 URL: {0}

# ++CODE++8e79146ac2ac83ff880a2a3860077ea6cfed5cdcea1ea169fed12fdd03b5360d
source: Invalid file format. The file does not contain valid metadata diff data.
pt_br: Formato de arquivo inválido. O arquivo não contém dados de comparação de metadados válidos.
zh_cn: 文件格式无效。该文件不包含有效的元数据差异数据。

# ++CODE++8d8cd546b58d91c300d3149ef40b8d98d3061dc38f15ea937d2ed785a3f25771
source: Learn More
pt_br: Saiba mais
zh_cn: 了解详情

# ++CODE++c59fe0045151cddc10b8384a437337e86eab905877883c18b53e068a3d36121d
source: Learn more about Copilot
cs: Další informace o Copilotovi
fr: En savoir plus sur Copilot
it: Scopri di più su Copilot
pt_br: Saiba mais sobre o Copilot
ru: Подробнее о Copilot
zh_cn: 详细了解 Copilot

# ++CODE++8d5ff42292d46b5c6b66b7285a701ef3b8cb3a48186944d73ed6a8d5f7ca1394
source: Let Copilot help you code
cs: Copilot vám pomůže s kódem
fr: Laissez Copilot vous aider à coder
it: Consenti a Copilot di aiutarti con il codice
pt_br: Permitir que o Copilot ajude você a codificar
ru: Copilot поможет вам писать код
zh_cn: 让 Copilot 帮助您编码

# ++CODE++39a6dab1c2d4a37e541c3b2672a019f937698e02ea34d22d502f60fc6dadc0ca
source: Like something? Tell us more.
cs: Něco se vám líbí? Řekněte nám víc.
fr: Vous aimez quelque chose ? Dites-nous en plus.
it: Ti è piaciuto qualcosa? Comunicaci altre informazioni.
pt_br: Gostou de algo? Conte-nos mais.
zh_cn: 很喜欢某些元素? 请详细跟我们说说。

# ++CODE++47dc2e01d9ad434bd03a870bdfd91281bc31d38da2cdc36c0d46a593b1d6d60c
source: Line: {0}
fr: Ligne : {0}
pt_br: Linha: {0}
zh_cn: 行: {0}

# ++CODE++8c31e6e7223097e2e4847773c47a4efab6aaf79deeecc92a7759891c74976dde
source: Local
zh_cn: 本地

# ++CODE++dff4c0c879ea2e4011d45f5b3caa7c64d15feac1416a9e90b4ba4723f7cfc6fa
source: Local Site
pt_br: Site Local
zh_cn: 本地网站

# ++CODE++9d6322c1f4d9d3f38aed8bfbe0b2bcadf66ad82c008476fa62541fa069138e94
source: Login
cs: Přihlášení
fr: Connexion
it: Accesso
pt_br: Logon
zh_cn: 登录

# ++CODE++9ecf75483ab77698700a9c2bc98a0b615500ce13cb9e487795f6c4dd782989cc
source: Login to PowerPages
fr: Connexion à PowerPages
it: Accedi a PowerPages
pt_br: Logon no PowerPages
zh_cn: 登录 PowerPages

# ++CODE++5f7a296554fdb03b163d47a479e9f37458d880e6ddcdd7fd26112464dafaff8d
source: Looking for CodeQL CLI in: {0}
fr: Recherche de CLI CodeQL dans : {0}
pt_br: Procurando a CLI do CodeQL em: {0}
zh_cn: 正在以下区域中查找 CodeQL CLI: {0}

# ++CODE++1be32f89a3d1d98bb7011850e83b5753124d58f684bae063674bfdb106026e6d
source: Make sure AI-generated content is accurate and appropriate before using. <a href="https://go.microsoft.com/fwlink/?linkid=2240145">Learn more</a> | <a href="https://go.microsoft.com/fwlink/?linkid=2189520">View terms</a>
fr: Assurez-vous que le contenu généré par l’IA est exact et approprié avant de l’utiliser. <a href="https://go.microsoft.com/fwlink/?linkid=2240145">En savoir plus</a> | <a href="https://go.microsoft.com/fwlink/?linkid=2189520">Vue conditions</a>
it: Verifica che il contenuto generato dall'IA sia accurato e appropriato prima di usarlo. <a href="https://go.microsoft.com/fwlink/?linkid=2240145">Altre informazioni</a> | <a href="https://go.microsoft.com/fwlink/?linkid=2189520">Visualizza le condizioni</a>
pt_br: Certifique-se de que o conteúdo gerado por IA seja preciso e apropriado antes de usá-lo. <a href="https://go.microsoft.com/fwlink/?linkid=2240145">Saiba mais</a> | <a href="https://go.microsoft.com/fwlink/?linkid=2189520">Exibir termos</a>
zh_cn: 确保 AI 生成的内容准确且合适，然后再使用。<a href="https://go.microsoft.com/fwlink/?linkid=2240145">了解详细信息</a> | <a href="https://go.microsoft.com/fwlink/?linkid=2189520">视图 条款</a>
