Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# microsoft-powerapps-portals.walkthrough.saveConflict.description
source: Avoid accidental overwrites when you try to save outdated code in VS Code for the Web. You can compare the changes side-by-side and decide to accept or revert the changes. To learn more, visit [Prevent accidental overwrites](command:powerplatform-walkthrough.saveConflict-learn-more).
fr: Évitez les écrasements accidentels lorsque vous essayez d’enregistrer du code obsolète dans VS Code pour le Web. Vous pouvez comparer les modifications côte à côte et décider d’accepter ou d’annuler les modifications. Pour en savoir plus, consultez [Empêcher les écrasements accidentels](command:powerplatform-walkthrough.saveConflict-learn-more).
it: Evita le sovrascritture accidentali quando tenti di salvare codice obsoleto in VS Code per il Web. Puoi confrontare le modifiche affiancandole e decidere di accettarle o annullarle. Per altre informazioni, vedi [Impedire le sovrascritture accidentali](command:powerplatform-walkthrough.saveConflict-learn-more).
pt_br: Evite substituições acidentais ao tentar salvar código desatualizado no VS Code para Web. Você pode comparar as alterações lado a lado e decidir se aceita ou reverte as alterações. Para saber mais, visite [Prevenir substituições acidentais](command:powerplatform-walkthrough.saveConflict-learn-more).
zh_cn: 尝试在 VS Code Web 版中保存过时的代码时，避免意外覆盖。可以并行比较更改，并决定接受或还原更改。 要了解详细信息，请访问 [防止意外覆盖](command:powerplatform-walkthrough.saveConflict-learn-more)。

# microsoft.powerplatform.pages.actionsHub.switchEnvironment.title
source: Change Environment
fr: Changer d’environnement
it: Modifica ambiente
pt_br: Alterar Ambiente
zh_cn: 更改环境

# pacCLI.authPanel.clearAuthProfile.title
source: Clear Auth Profiles
cs: Vymazat ověřovací profily
de: Authentifizierungsprofile löschen
es: Borrar perfiles de autenticación
fr: Effacer les profils d’authentification
it: Cancella profili di autenticazione
ja: 認証プロファイルのクリア
pt_br: Limpar Perfis de Autenticação
ru: Удаление профилей проверки подлинности
tr: Kimlik Doğrulama Profillerini Temizle
zh_cn: 清除身份验证配置文件

# microsoft.powerplatform.pages.actionsHub.metadataDiff.clear.title
source: Clear Comparison
pt_br: Limpar comparação
zh_cn: 清除比较

# powerpages.copilotPanel.clearConversation.title
source: Clear Conversation
cs: Vymazat konverzaci
fr: Effacer la conversation
it: Cancella conversazione
pt_br: Limpar Conversa
zh_cn: 清除对话

# microsoft-powerapps-portals.compareWithEnvironment.title
source: Compare with Environment
pt_br: Comparar com Ambiente
zh_cn: 与环境进行比较

# microsoft.powerplatform.pages.actionsHub.activeSite.compareWithLocal.title
source: Compare with Local
pt_br: Comparar com o local
zh_cn: 与本地比较

# powerpages.copilotPanel.title
source: Copilot In Power Pages
cs: Copilot v Power Pages
fr: Copilot dans Power Pages
pt_br: Copilot no Power Pages
zh_cn: Power Pages 中的助手

# pacCLI.envAndSolutionsPanel.copyDisplayName.title
source: Copy Display Name
cs: Zkopírovat zobrazované jméno
de: Anzeigename kopieren
es: Copiar nombre para mostrar
fr: Copier le nom complet
it: Copia nome visualizzato
ja: 表示名のコピー
pt_br: Copiar Nome de Exibição
ru: Копировать отображаемое имя
tr: Görünen Adı Kopyala
zh_cn: 复制显示名称

# pacCLI.envAndSolutionsPanel.copyEnvironmentId.title
source: Copy Environment Id
cs: Zkopírovat ID prostředí
de: Umgebungs-ID kopieren
es: Copiar id. de entorno
fr: Copier l’ID d’environnement
it: Copia ID ambiente
ja: 環境 ID のコピー
pt_br: Copiar ID do Ambiente
ru: Копировать ИД среды
tr: Ortam Kimliğini Kopyala
zh_cn: 复制环境 ID

# pacCLI.envAndSolutionsPanel.copyEnvironmentUrl.title
source: Copy Environment Url
cs: Zkopírovat adresu URL prostředí
de: Umgebungs-URL kopieren
es: Copiar URL de entorno
fr: Copier l’URL de l’environnement
it: Copia URL ambiente
ja: 環境 URL のコピー
pt_br: Copiar URL do Ambiente
ru: Копировать URL-адрес среды
tr: Ortam URL'sini Kopyala
zh_cn: 复制环境 URL

# pacCLI.envAndSolutionsPanel.copyFriendlyName.title
source: Copy Friendly Name
cs: Zkopírovat popisné jméno
de: Anzeigename kopieren
es: Copiar nombre descriptivo
fr: Copier le nom convivial
it: Copia nome descrittivo
ja: フレンドリ名のコピー
pt_br: Copiar Nome Amigável
ru: Копировать понятное имя
tr: Kolay Adı Kopyala
zh_cn: 复制友好名称

# pacCLI.envAndSolutionsPanel.copyOrganizationId.title
source: Copy Organization Id
cs: Zkopírovat kód organizace
de: Organisations-ID kopieren
es: Copiar id. de organización
fr: Copier l’ID d’organisation
it: Copia ID organizzazione
ja: 組織 ID のコピー
pt_br: Copiar ID da Organização
ru: Копировать ИД организации
tr: Kuruluş Kimliğini Kopyala
zh_cn: 复制组织 ID

# pacCLI.envAndSolutionsPanel.copyUniqueName.title
source: Copy Unique Name
cs: Zkopírovat jedinečné jméno
de: Eindeutigen Namen kopieren
es: Copiar nombre único
fr: Copier le nom unique
it: Copia nome univoco
ja: 一意の名前のコピー
pt_br: Copiar Nome Exclusivo
ru: Копировать уникальное имя
tr: Benzersiz Adı Kopyala
zh_cn: 复制唯一名称

# pacCLI.authPanel.copyUser.title
source: Copy User
cs: Zkopírovat uživatele
de: Benutzer kopieren
es: Copiar usuario
fr: Copier l’utilisateur
it: Copia utente
ja: ユーザーのコピー
pt_br: Copiar Usuário
ru: Копировать пользователя
tr: Kullanıcıyı Kopyala
zh_cn: 复制用户

# pacCLI.envAndSolutionsPanel.copyVersionNumber.title
source: Copy Version Number
cs: Zkopírovat číslo verze
de: Versionsnummer kopieren
es: Copiar número de versión
fr: Copier le numéro de version
it: Copia numero versione
ja: バージョン番号のコピー
pt_br: Copiar Número da Versão
ru: Копировать номер версии
tr: Sürüm Numarasını Kopyala
zh_cn: 复制版本号

# pacCLI.authPanel.deleteAuthProfile.title
source: Delete Auth Profile
cs: Odstranit ověřovací profil
de: Authentifizierungsprofil löschen
es: Eliminar perfil de autenticación
fr: Supprimer le profil d’authentification
it: Elimina profilo di autenticazione
ja: 認証プロファイルの削除
pt_br: Excluir Perfil de Autenticação
ru: Удаление профиля проверки подлинности
tr: Kimlik Doğrulama Profilini Sil
zh_cn: 删除身份验证配置文件

# pacCLI.disableTelemetry.title
source: Disable PAC Telemetry
cs: Zakázat telemetrii PAC
de: PAC-Telemetrie deaktivieren
es: Deshabilitar telemetría de PAC
fr: Désactiver la télémétrie PAC
it: Disabilita telemetria PAC
ja: PAC テレメトリを無効にする
pt_br: Desabilitar Telemetria de PAC
ru: Отключить телеметрию PAC
tr: PAC Telemetrisini Devre Dışı Bırak
zh_cn: 禁用 PAC 遥测

# microsoft.powerplatform.pages.actionsHub.metadataDiff.discardFolder.title
source: Discard All Local Changes
pt_br: Descartar Todas as Alterações Locais
zh_cn: 放弃所有本地更改

# microsoft.powerplatform.pages.actionsHub.metadataDiff.discardFile.title
source: Discard Local Changes
pt_br: Descartar as Alterações Locais
zh_cn: 放弃本地更改

# microsoft-powerapps-portals.walkthrough.description
source: Discover how you can make complete, modern websites right in Visual Studio Code
cs: Zjistěte, jak můžete vytvářet kompletní moderní weby přímo v editoru Visual Studio Code.
fr: Découvrez comment créer des sites web complets et modernes directement dans Visual Studio Code
it: Scopri come puoi creare siti Web completi e moderni direttamente in Visual Studio Code
ja: 完全でモダンな Web サイトを Visual Studio Code で作成する方法をご覧ください
pt_br: Descubra como você pode criar sites completos e modernos, diretamente no Visual Studio Code
ru: Узнайте, как создавать работающие современные веб-сайты в Visual Studio Code
tr: Visual Studio Code içinden eksiksiz ve modern web siteleri oluşturmayı keşfedin
zh_cn: 了解如何在 Visual Studio Code 中创建完整的新型网站

# pacCLI.openDocumentation.title
source: Documentation
cs: Dokumentace
de: Dokumentation
es: Documentación
it: Documentazione
ja: ドキュメント
pt_br: Documentação
ru: Документация
tr: Belgeler
zh_cn: 文档

# microsoft.powerplatform.pages.actionsHub.metadataDiff.generateHtmlReport.title
source: Download HTML Report
pt_br: Baixar Relatório HTML
zh_cn: 下载 HTML 报表

# microsoft.powerplatform.pages.actionsHub.activeSite.downloadSite.title
source: Download Site
fr: Télécharger le site
it: Scarica sito
pt_br: Baixar Site
zh_cn: 下载站点

# microsoft-powerapps-portals.walkthrough.title
source: Edit Power Pages code
cs: Upravit kód Power Pages
de: Power Pages-Code bearbeiten
es: Editar código de Power Pages
fr: Modifier le code Power Pages
it: Modifica codice Power Pages
ja: Power Pages コードの編集
pt_br: Editar código do Power Pages
ru: Изменить код Power Pages
tr: Power Pages kodunu düzenle
zh_cn: 编辑 Power Pages 码

# pacCLI.enableTelemetry.title
source: Enable PAC telemetry
cs: Povolit telemetrii PAC
de: PAC-Telemetrie aktivieren
es: Habilitar telemetría de PAC
fr: Activer la télémétrie PAC
it: Abilita telemetria PAC
ja: PAC テレメトリを有効にする
pt_br: Habilitar Telemetria de PAC
ru: Включить телеметрию PAC
tr: PAC telemetrisini etkinleştir
zh_cn: 启用 PAC 遥测

# pacCLI.envAndSolutionsPanel.title
source: Environments & Solutions
cs: Prostředí a řešení
de: Umgebungen und Lösungen
es: Entornos y soluciones
fr: Environnements et solutions
it: Ambienti e soluzioni
ja: 環境およびソリューション
pt_br: Ambientes e Soluções
ru: Среды и решения
tr: Ortamlar ve Çözümler
zh_cn: 环境和解决方案

# microsoft.powerplatform.pages.actionsHub.metadataDiff.export.title
source: Export Comparison
pt_br: Exportar Comparação
zh_cn: 导出比较

# microsoft-powerapps-portals.walkthrough.fileSystem.title
source: File explorer
cs: Průzkumník souborů
fr: Explorateur de fichiers
it: Esplora file
ja: ファイル エクスプローラー
pt_br: Explorador de arquivos
ru: Проводник
tr: Dosya gezgini
zh_cn: 文件资源管理器

# microsoft-powerapps-portals.walkthrough.fileSystem.description
source: Find your page files organized in folders under your site name. All your pages are arranged into HTML, CSS, and JS files within the respective site component folders. You can find site components like forms, content snippets, lists, and more to edit. To learn more, visit [Power Pages file structure in VS Code](command:powerplatform-walkthrough.fileSystem-documentation). [Visit site folder](command:powerplatform-walkthrough.fileSystem-open-folder)
fr: Trouvez vos fichiers de page organisés dans des dossiers sous le nom de votre site. Toutes vos pages sont organisées en fichiers HTML, CSS et JS dans les dossiers des composants de site respectifs. Vous pouvez trouver des composants de site tels que des formulaires, des extraits de contenu, des listes, etc. à modifier. Pour en savoir plus, visitez [Structure de fichiers Power Pages dans VS Code](command:powerplatform-walkthrough.fileSystem-documentation). [Visiter le dossier du site](command:powerplatform-walkthrough.fileSystem-open-folder)
it: I file delle pagine vengono organizzati in cartelle sotto il nome del sito. Tutte le pagine vengono disposte in file HTML, CSS e JS all'interno delle rispettive cartelle dei componenti del sito. Sono disponibili componenti del sito come moduli, frammenti di contenuto, elenchi e molti altri da modificare. Per altre informazioni, vedi [Struttura dei file di Power Pages in VS Code](command:powerplatform-walkthrough.fileSystem-documentation). [Visita la cartella del sito](command:powerplatform-walkthrough.fileSystem-open-folder)
pt_br: Encontre seus arquivos de página organizados em pastas sob o nome do seu site. Todas as suas páginas estão organizadas em arquivos HTML, CSS e JS nas respectivas pastas de componentes do site. Você pode encontrar componentes do site, como formulários, trechos de conteúdo, listas e muito mais para editar. Para saber mais, visite [Estrutura de arquivos do Power Pages no VS Code](command:powerplatform-walkthrough.fileSystem-documentation). [Visite a pasta do site](command:powerplatform-walkthrough.fileSystem-open-folder)
zh_cn: 在站点名称下的文件夹中查找整理的页面文件。所有页面都排列在相应站点组件文件夹内的 HTML、CSS 和 JS 文件中。 可以找到要编辑的网站组件，如表单、内容片段、列表等。 要了解详细信息，请访问 [VS Code 中的 Power Pages 文件结构](command:powerplatform-walkthrough.fileSystem-documentation)。 [访问站点文件夹](command:powerplatform-walkthrough.fileSystem-open-folder)

# microsoft.powerplatform.pages.actionsHub.metadataDiff.import.title
source: Import Comparison
pt_br: Importar Comparação
zh_cn: 导入比较

# microsoft-powerapps-portals.webExtension.init.title
source: Initialize Web Extension
cs: Inicializovat webové rozšíření
de: Weberweiterung initialisieren
es: Inicializar extensión web
fr: Initialiser l’extension Web
it: Inizializza estensione Web
ja: Web拡張の初期化
pt_br: Inicializar Extensão da Web
ru: Инициализация веб-расширения
tr: Web Uzantısını Başlat
zh_cn: 初始化 Web 扩展

# microsoft.powerplatform.pages.actionsHub.login
source: Login and connect to a Power Pages environment to use Power Pages actions. [Learn more](https://go.microsoft.com/fwlink/?linkid=2305702). [Login](command:microsoft.powerplatform.pages.actionsHub.newAuthProfile)
fr: Ouvrez une session et connectez-vous à un environnement Power Pages pour utiliser des actions Power Pages. [En savoir plus](https://go.microsoft.com/fwlink/?linkid=2305702). [Connexion](command:microsoft.powerplatform.pages.actionsHub.newAuthProfile)
it: Accedi e connettiti a un ambiente Power Pages per usare le azioni di Power Pages. [Altre informazioni](https://go.microsoft.com/fwlink/?linkid=2305702). [Accedi](command:microsoft.powerplatform.pages.actionsHub.newAuthProfile)
pt_br: Faça logon e conecte-se a um ambiente do Power Pages para usar as ações do Power Pages. [Saiba mais](https://go.microsoft.com/fwlink/?linkid=2305702). [Logon](command:microsoft.powerplatform.pages.actionsHub.newAuthProfile)
zh_cn: 登录并连接到 Power Pages 环境以使用 Power Pages 操作。[了解详细信息](https://go.microsoft.com/fwlink/?linkid=2305702)。 [登录](command:microsoft.powerplatform.pages.actionsHub.newAuthProfile)

# pacCLI.authPanel.nameAuthProfile.title
source: Name/Rename Auth Profile
cs: Pojmenovat nebo přejmenovat ověřovací profil
de: Authentifizierungsprofil benennen/umbenennen
es: Asignar nombre/Cambiar nombre del perfil de autenticación
fr: Nommer/Renommer le profil d’authentification
it: Assegna un nome/rinomina profilo di autorizzazione
ja: 認証プロファイルの名前の指定/変更
pt_br: Nomear/Renomear Perfil de Autenticação
ru: Установка/изменение имени профиля проверки подлинности
tr: Kimlik Doğrulama Profilini Adlandır/Yeniden Adlandır
zh_cn: 命名/重命名身份验证配置文件

# pacCLI.authPanel.navigateToResource.title
source: Navigate to Resource
cs: Přejít na zdroj
de: Zur Ressource navigieren
es: Ir a Recurso
fr: Accéder à la ressource
it: Passa a risorsa
ja: リソースに移動
pt_br: Navegar até o Recurso
ru: Переход к ресурсу
tr: Kaynağa Git
zh_cn: 导航到资源

# pacCLI.authPanel.newDataverseAuthProfile.title
source: New Auth Profile
cs: Nový ověřovací profil
de: Neues Authentifizierungsprofil
es: Nuevo perfil de autenticación
fr: Nouveau profil d’authentification
it: Nuovo profilo di autenticazione
ja: 新しい認証プロファイル
pt_br: Novo Perfil de Autenticação
ru: Новый профиль проверки подлинности
tr: Yeni Kimlik Doğrulama Profili
zh_cn: 新建身份验证配置文件

# pacCLI.authPanel.welcome.whenInteractiveNotSupported
source: No auth profiles found on this computer. Interactive Authentication is not available for remote scenarios; auth profiles must be created by the command line. The `--deviceCode` flow must be used for users with MFA requirements, or whose tenants use ADFS. [View Auth Profile Help](command:pacCLI.pacAuthHelp)
fr: Aucun profil d’authentification trouvé sur cet ordinateur. L’authentification interactive n’est pas disponible pour les scénarios à distance ; les profils d’authentification doivent être créés par ligne de commande. Le flux « --deviceCode » doit être utilisé pour les utilisateurs ayant des exigences MFA ou dont les locataires utilisent ADFS. [Afficher l’aide du profil d’authentification](command:pacCLI.pacAuthHelp)
it: Non sono stati trovati profili di autenticazione in questo computer. L'autenticazione interattiva non è disponibile per gli scenari remoti. I profili di autenticazione devono essere creati dalla riga di comando. Il flusso "--deviceCode" deve essere usato per gli utenti con requisiti MFA o i cui tenant utilizzano ADFS. [Visualizza la guida del profilo di autenticazione](comando:pacCLI.pacAuthHelp)
pt_br: Nenhum perfil de autenticação encontrado neste computador. A Autenticação Interativa não está disponível para cenários remotos; os perfis de autenticação devem ser criados pela linha de comando. O fluxo `--deviceCode` deve ser usado para usuários com requisitos de MFA ou cujos locatários usam ADFS. [Exibir Ajuda do Perfil de Autenticação](command:pacCLI.pacAuthHelp)
zh_cn: 在此计算机上找不到身份验证配置文件。 交互式身份验证不适用于远程方案；身份验证配置文件必须由命令行创建。 “--deviceCode”流必须用于具有 MFA 要求的用户或其租户使用 ADFS 的用户。 [查看身份验证配置文件帮助](command:pacCLI.pacAuthHelp)

# pacCLI.authPanel.welcome.whenInteractiveSupported
source: No auth profiles found on this computer. [Add Auth Profile](command:pacCLI.authPanel.newAuthProfile)
fr: Aucun profil d’authentification trouvé sur cet ordinateur. [Ajouter un profil d’authentification](command:pacCLI.authPanel.newAuthProfile)
it: Non sono stati trovati profili di autenticazione in questo computer. [Aggiungi un profilo di autenticazione](command:pacCLI.authPanel.newAuthProfile)
pt_br: Nenhum perfil de autenticação encontrado neste computador. [Add Perfil de Autenticação](command:pacCLI.authPanel.newAuthProfile)
zh_cn: 在此计算机上找不到身份验证配置文件。 [添加身份验证配置文件](command:pacCLI.authPanel.newAuthProfile)

# microsoft-powerapps-portals.walkthrough.overview.description
source: Now easily edit code of your Power Pages site. Access code from supported site components like forms, content snippets, lists, and more from within Visual Studio Code. To learn more, visit [Edit Power Pages code in VS Code](command:powerplatform-walkthrough.overview-learn-more).
fr: Modifiez maintenant facilement le code de votre site Power Pages. Accédez au code à partir de composants de site pris en charge tels que des formulaires, des extraits de contenu, des listes, etc. à partir de Visual Studio Code. Pour en savoir plus, visitez [Modifier le code Power Pages dans VS Code](command:powerplatform-walkthrough.overview-learn-more).
it: Ora puoi modificare facilmente il codice del tuo sito di Power Pages. Accedi al codice dai componenti del sito supportati come moduli, frammenti di contenuto, elenchi e molti altri da Visual Studio Code. Per altre informazioni, vedi [Modificare il codice di Power Pages in VS Code](command:powerplatform-walkthrough.overview-learn-more).
pt_br: Agora você pode editar facilmente o código do seu site do Power Pages. Acesse o código de componentes de site com suporte, como formulários, trechos de conteúdo, listas e muito mais, diretamente no Visual Studio Code. Para saber mais, acesse [Editar código do Power Pages no VS Code](command:powerplatform-walkthrough.overview-learn-more).
zh_cn: 现在，轻松编辑 Power Pages 站点的代码。从 Visual Studio Code 中访问受支持站点组件(如表单、内容片段、列表等)中的代码。 要了解详细信息，请访问 [在 VS Code 中编辑 Power Pages 代码](command:powerplatform-walkthrough.overview-learn-more)。

# microsoft.powerplatform.pages.actionsHub.metadataDiff.openAll.title
source: Open All Diffs
pt_br: Abrir todas as comparações
zh_cn: 打开所有差异

# microsoft.powerplatform.pages.actionsHub.metadataDiff.openFile.title
source: Open Comparison
pt_br: Abrir Comparação
zh_cn: 打开比较

source: Open Containing Folder
fr: Ouvrir le dossier conteneur
it: Apri cartella con contenuto
pt_br: Abrir Pasta Que Contém
zh_cn: 打开包含文件夹

# pacCLI.openPacLab.title
source: Open PAC Lab
cs: Otevřít testovací prostředí PAC
de: PAC-Labor öffnen
es: Abrir laboratorio de PAC
fr: Ouvrir le labo PAC
it: Apri esercitazione PAC
ja: PAC ラボを開く
pt_br: Abrir Laboratório de PAC
ru: Открыть лабораторию PAC
tr: PAC Lab'i Aç
zh_cn: 打开 PAC Lab

# microsoft.powerplatform.pages.actionsHub.activeSite.openInStudio.title
source: Open in Power Pages Studio
fr: Ouvrir dans le studio Power Pages
it: Apri nello studio di Power Pages
pt_br: Abrir no estúdio do Power Pages
zh_cn: 在 Power Pages 工作室中打开

# microsoft.powerplatform.pages.actionsHub.openSitesInStudio.title
source: Open in Power Pages Studio
fr: Ouvrir dans le studio Power Pages
it: Apri nello studio di Power Pages
pt_br: Abrir no Estúdio do Power Pages
zh_cn: 在 Power Pages 工作室中打开

# microsoft.powerplatform.pages.actionsHub.inactiveSite.openSiteManagement.title
source: Open site management
fr: Ouvrir la gestion du site
it: Apri gestione sito
pt_br: Abrir gerenciamento de sites
zh_cn: 打开站点管理

# powerPlatform.experimental.auth.testCloudOverride.description
source: Overrides `#powerPlatform.auth.cloud#` for test targets. Leave blank for default behavior.
cs: Přepíše `#powerPlatform.auth.cloud#` pro testovací cíle. Nezadávejte, pokud chcete použít výchozí chování.
fr: Remplace `#powerPlatform.auth.cloud#` pour les cibles de test. Laissez ce champ vide pour sélectionner le comportement par défaut.
it: Sostituisce `#powerPlatform.auth.cloud#` per le destinazioni del test. Lascia vuoto per il comportamento predefinito.
ja: テスト対象の `#powerPlatform.auth.cloud#` をオーバーライドします。空白のままにすると、既定の動作を行います。
pt_br: Substitui o `#powerPlatform.auth.cloud#` ara destinos de teste. Deixe em branco para o comportamento padrão.
ru: Переопределяет `#powerPlatform.auth.cloud#` для тестовых целей. Оставьте пустым, чтобы действовали параметры по умолчанию.
tr: Test hedefleri için `#powerPlatform.auth.cloud#` öğesini geçersiz kılar. Varsayılan davranış için boş bırakın.
zh_cn: 替代测试目标的 `#powerPlatform.auth.cloud#`。对于默认行为，请保留为空。

# microsoft-powerapps-portals.walkthrough.overview.title
source: Overview
cs: Přehled
de: Übersicht
es: Información general
fr: Vue d’ensemble
it: Panoramica
ja: 概要
pt_br: Visão Geral
ru: Обзор
tr: Genel bakış
zh_cn: 概览

# microsoft.powerplatform.pages.actionsHub.title
source: POWER PAGES ACTIONS
fr: ACTIONS POWER PAGES
it: AZIONI DI POWER PAGES
pt_br: AÇÕES DO POWER PAGES
zh_cn: POWER PAGES 操作

# microsoft-powerplatform-portals.navigation-loop.powerPagesFileExplorer.title
source: POWER PAGES ACTIONS
cs: AKCE POWER PAGES
fr: ACTIONS POWER PAGES
it: AZIONI DI POWER PAGES
pt_br: AÇÕES DO POWER PAGES
ru: ДЕЙСТВИЯ POWER PAGES
tr: POWER PAGES EYLEMLERİ
zh_cn: POWER PAGES 操作

# microsoft-powerapps-portals.preview-show.title
source: PowerApps Portal -> Show preview
cs: Portál PowerApps -> Zobrazit náhled
de: PowerApps-Portal -> Vorschauversion anzeigen
es: Portal de PowerApps -> Mostrar vista previa
fr: Portail PowerApps -> Afficher la version préliminaire
it: Portale PowerApps -> Mostra anteprima
ja: PowerApps ポータル -> プレビューの表示
pt_br: Portal do PowerApps -> Mostrar versão preliminar
ru: Портал PowerApps -> Показать предварительную версию
tr: PowerApps Portal -> Önizlemeyi göster
zh_cn: PowerApps 门户 -> 显示预览版

# microsoft.powerplatform.pages.actionsHub.activeSite.previewSite.title
source: Preview
fr: Afficher l’aperçu
it: Anteprima
pt_br: Visualizar
zh_cn: 预览

# powerplatform.pages.previewSite.title
source: Preview Site
fr: Afficher l’aperçu du site
it: Sito in anteprima
pt_br: Visualizar Site
zh_cn: 预览站点

# microsoft.powerplatform.pages.actionsHub.inactiveSite.reactivateSite.title
source: Reactivate Site
fr: Réactiver le site
it: Riattiva sito
pt_br: Reativar Site
zh_cn: 重新激活站点

# microsoft.powerplatform.pages.actionsHub.refresh.title
source: Refresh
fr: Actualiser
it: Aggiorna
pt_br: Atualizar
zh_cn: 刷新

# pacCLI.envAndSolutionsPanel.refresh.title
source: Refresh
cs: Aktualizovat
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
pt_br: Atualizar
ru: Обновить
tr: Yenile
zh_cn: 刷新

# pacCLI.authPanel.refresh.title
source: Refresh
cs: Aktualizovat
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ja: 最新の情報に更新
pt_br: Atualizar
ru: Обновить
tr: Yenile
zh_cn: 刷新

# microsoft.powerplatform.pages.actionsHub.metadataDiff.resync.title
source: Refresh Comparison
pt_br: Atualizar Comparação
zh_cn: 刷新比较

# microsoft.powerplatform.pages.actionsHub.metadataDiff.removeSite.title
source: Remove Comparison
pt_br: Remover Comparação
zh_cn: 移除比较

source: Reveal in Explorer
fr: Afficher dans l’explorateur
it: Rivela in Esplora risorse
pt_br: Revelar no Explorador
zh_cn: 在资源管理器中显示
