Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# ++CODE++b1ffea87cc95d3bfa308b929bb907b43e7d91be038e706a67142b15c571da334
source: Click to authenticate with a matching account
fr: Cliquez pour vous authentifier avec un compte correspondant
pt_br: Clique para autenticar com uma conta correspondente
zh_cn: 单击以使用匹配的帐户进行身份验证

# ++CODE++7d9eb7acb13e24625c404401d8e88b2350e32162455885f18276cf802f7701ed
source: Close
fr: Fermer
pt_br: Fechar
zh_cn: 关闭

# ++CODE++eef726ad55117038c05eaa478148144884ab56cadc5a46785e8221040ff7a6ec
source: Cloud Instance: {0}
cs: Cloudová instance: {0}
es: Instancia en la nube: {0}
fr: Instance de cloud : {0}
it: Istanza cloud: {0}
ja: クラウド インスタンス: {0}
pt_br: Instância na Nuvem: {0}
ru: Облачный экземпляр: {0}
tr: Bulut Kurulumu: {0}
zh_cn: 云实例: {0}

# ++CODE++e0a2ada39bb1b062967ebf06c78ad62004625c48072b3e62656836c2b775aa3f
source: Cluster category: {0}
fr: Catégorie du cluster : {0}
it: Categoria cluster: {0}
pt_br: Categoria do cluster: {0}
zh_cn: 群集类别: {0}

# ++CODE++8f3ffa30307b4f73ca60c319ab62428b539d8410f1d62f67d941ba9957b39d9e
source: Cluster environment: {0}
fr: Environnement du cluster : {0}
it: Ambiente cluster: {0}
pt_br: Ambiente de cluster: {0}
zh_cn: 群集环境: {0}

# ++CODE++396ccbc26f4551ea0d94633d40a1a5b105360b9b30cf8897e1fde4c9d064a163
source: Cluster geo name: {0}
fr: Nom de la zone géographique du cluster : {0}
it: Nome geografico cluster: {0}
pt_br: Nome geográfico do cluster: {0}
zh_cn: 群集地理名称: {0}

# ++CODE++51e495f295ba55f724b77298746e3284ff9fc8e1e582828a9a3f4051fc577cb0
source: Code Block
fr: Bloc de code
it: Blocco di codice
pt_br: Bloco de Código
zh_cn: 代码块

# ++CODE++67fe2c02a3f3e19ede0f449f4e42c477c8b6a55baee7edb23a1928df18403c07
source: CodeQL CLI is not installed or not in PATH. Please install the CodeQL extension or add CodeQL CLI to your PATH.
fr: L’interface CLI CodeQL n’est pas installée ou n’est pas dans PATH. Installez l’extension CodeQL ou ajoutez l’interface CLI CodeQL à votre chemin d’accès.
pt_br: A CLI do CodeQL não está instalada ou não está no PATH. Instale a extensão CodeQL ou adicione a CLI do CodeQL ao PATH.
zh_cn: CodeQL CLI 未安装或未在 PATH 中。请安装 CodeQL 扩展或将 CodeQL CLI 添加到你的 PATH。

# ++CODE++4d957bcbf39044dd870f5e281bc90330855835fe5e2eec59d9cc66b5c6954e19
source: CodeQL analysis completed successfully with no issues found! 🎉
fr: L’analyse CodeQL s’est terminée sans aucun problème trouvé. 🎉
pt_br: A análise do CodeQL foi concluída com sucesso e nenhuma falha foi encontrada! 🎉
zh_cn: CodeQL 分析已成功完成，未发现任何问题! 🎉

# ++CODE++c3275a1a575e00df769307ad10f3bc42c41d9a990386301c351bd29519010765
source: CodeQL analysis completed. Would you like to open the full results file?
fr: Analyse CodeQL terminée. Voulez-vous ouvrir le fichier de résultats complet ?
pt_br: Análise de CodeQL concluída. Deseja abrir o arquivo de resultados completo?
zh_cn: CodeQL 分析已完成。是否要打开完整的结果文件?

# ++CODE++cf2d63639bdb46d783628b663433203e46d6dcf4cfb915adbaad0f13eb9d9905
source: CodeQL analysis failed: {0}
fr: Échec de l’analyse CodeQL : {0}
pt_br: Falha na análise do CodeQL: {0}
zh_cn: CodeQL 分析失败: {0}

# ++CODE++eb7933b3f154963486dca26336ee1f27fea4c21f8c9b5dd0f85f05a2e38d8d5b
source: CodeQL database created successfully. You can now run queries from the CodeQL extension.
fr: La base de données CodeQL a été créée. Vous pouvez maintenant exécuter des requêtes à partir de l’extension CodeQL.
pt_br: Banco de dados CodeQL criado com sucesso. Agora você pode executar consultas da extensão CodeQL.
zh_cn: 已成功创建 CodeQL 数据库。现在可以从 CodeQL 扩展运行查询。

# ++CODE++f40beb25214e827493a66e453c0e5309a786d37ce60f3af025794baca7444c8b
source: CodeQL database created. You can now: 1. Run custom queries if you have any 2. Use the prebuilt queries from the CodeQL extension Check the CodeQL extension panel for available queries.
fr: Base de données CodeQL créée. Vous pouvez maintenant : 1. Exécuter des requêtes personnalisées si vous en avez 2. Utiliser les requêtes prédéfinies à partir de l’extension CodeQL Recherchez les requêtes disponibles dans le panneau d’extension CodeQL.
pt_br: Banco de dados CodeQL criado. Agora você pode: 1. Executar consultas personalizadas se você tiver alguma 2. Usar as consultas predefinidas da extensão CodeQL Verifique se há consultas disponíveis no painel de extensão do CodeQL.
zh_cn: 已创建 CodeQL 数据库。现在可以: 1. 运行自定义查询(如果有) 2. 使用 CodeQL 扩展中的预生成查询 检查 CodeQL 扩展面板以获取可用查询。

# ++CODE++7e89a70d023a672e36926ab684ceed3cc71049d939761459ab670c94b6339e08
source: CodeQL extension is not installed.
fr: L’extension CodeQL n’est pas installée.
pt_br: A extensão CodeQL não está instalada.
zh_cn: 未安装 CodeQL 扩展。

# ++CODE++e8235f4d23a215a1902de70069f48aee97eae99fac871b0e7044c8dd4c228d65
source: CodeQL global storage path does not exist: {0}
fr: Le chemin de stockage global CodeQL n’existe pas : {0}
pt_br: O caminho de armazenamento global do CodeQL não existe: {0}
zh_cn: CodeQL 全局存储路径不存在: {0}

# ++CODE++15f726b732553ce0ebcc6cc3d73ed78609b146df85eb6260ae7280bcbb2dbc93
source: CodeQL screening failed. Please try again later.
fr: Échec du filtrage CodeQL. Veuillez réessayer plus tard.
pt_br: Falha na triagem do CodeQL. Tente novamente mais tarde.
zh_cn: CodeQL 筛选失败。请稍后再试。

# ++CODE++ad5918a3406b99c40a41a41891e7bfddd75f66fdf226d6daa654c78d297a0636
source: CodeQL screening is not supported for this site.
fr: Le filtrage CodeQL n’est pas pris en charge pour ce site.
pt_br: Não há suporte para a triagem de CodeQL neste site.
zh_cn: 此站点不支持 CodeQL 筛选。

# ++CODE++9328c89f866668300cb2282dd173089c5e63b5e012d40b6ea73b68d7d345f2a0
source: CodeQL screening started. Creating database and analyzing
fr: Le filtrage CodeQL a démarré. Création d’une base de données et analyse
pt_br: Triagem do CodeQL iniciada. Criando banco de dados e analisando
zh_cn: CodeQL 筛选已开始。正在创建数据库和分析

# ++CODE++8c7badc0de1c1ad67ea730f2f63caa922024be334866180f5d0e7497b8be1cd1
source: CodeQL version: {0}
fr: Version de CodeQL : {0}
pt_br: Versão do CodeQL: {0}
zh_cn: CodeQL 版本: {0}

# ++CODE++55988e28a4e8720a588c5c53fd47616d929a404d3d2af7e6f8ba313dce6dc3e4
source: Collapse All
pt_br: Recolher Tudo
zh_cn: 全部折叠

# ++CODE++1fb4405a792e9eb077d2bd96517eca8d81fc43bc251d5589e9d959fd07c8f31d
source: Command completed successfully (exit code: {0})
fr: Commande terminée correctement (code de sortie : {0})
pt_br: Comando concluído com sucesso (código de saída: {0})
zh_cn: 命令已成功完成(退出代码: {0})

# ++CODE++bf281cb4dcfdee3bea566c086c3d77aa9234f6854dfbcbcb25f2bcf19828e9b5
source: Command completed successfully.
pt_br: Comando concluído com êxito.
zh_cn: 命令已成功完成。

# ++CODE++ff61c2f710070e267638038dfbd105cfffe4de4d37580f566f4537b304b6ca84
source: Command failed with exit code {0}: {1}
fr: Échec de la commande avec le code de sortie {0} : {1}
pt_br: O comando falhou com o código de saída {0}: {1}
zh_cn: 命令失败，出现退出代码 {0}: {1}

# ++CODE++67a58f1682f864bfa789f056e50bab25181dfcddf455fadaad856c826f852d6a
source: Command failed with exit code: {0}
fr: Échec de la commande avec le code de sortie : {0}
pt_br: O comando falhou com o código de saída: {0}
zh_cn: 命令失败，退出代码为: {0}

# ++CODE++95de5784f48c7fee97755bb29a90a128546a6a30201be3c73493229230ea7f72
source: Compare: {0} (Remote ↔ Local)
pt_br: Comparar: {0} (Remoto ↔ Local)
zh_cn: 比较: {0} (远程 ↔ 本地)

# ++CODE++cf8510772ff5dbeb2edc5e7209cc8f47e6c7c79810155260b41c6aec64a9f277
source: Comparing files...
pt_br: Comparando arquivos...
zh_cn: 正在比较文件...

# ++CODE++5b79ce1b6eead3275d92572d5997ed876b99fe9d47141f8b785abf94a4ff52c0
source: Comparison Details
pt_br: Detalhes da Comparação
zh_cn: 比较详细信息

# ++CODE++6f62222f8fc63948a524a47998f7426ba127721daff7b3830eaeca94ee399557
source: Comparison exported successfully to '{0}'.
pt_br: Comparação exportada com êxito para '{0}'.
zh_cn: 已成功将比较导出到“{0}”。

# ++CODE++af71f3c9dcd7adc1f7944d6fc3ca0af422603b9af8eb47c0d4c23cbeb91ea931
source: Comparison for '{0}' imported successfully.
pt_br: Comparação para '{0}' importada com êxito.
zh_cn: 已成功导入“{0}”的比较。

# ++CODE++9c67b99ff5b13af52ba4fcdf8a23543ece796a42bdca07632507f5ac3ed6d32b
source: Comparison has been refreshed with the latest data from the environment.
pt_br: A comparação foi atualizada com os dados mais recentes do ambiente.
zh_cn: 已使用环境中的最新数据刷新了比较。

# ++CODE++eebdd24a77d9ad32222660c07777163bf5f6732df2b172351f3f8d5783e4f529
source: Confirm
cs: Potvrdit
es: Confirmar
fr: Confirmer
it: Conferma
ja: 確認
pt_br: Confirmar
ru: Подтвердить
tr: Onayla
zh_cn: 确认

# ++CODE++02c3c88b02a43e1818bf427f60d8e58b84d40c0990e09d01c75fff4a934221d0
source: Continue with Copilot for Power Pages
cs: Pokračovat s Copilotem pro Power Pages
fr: Continuer avec Copilot pour Power Pages
it: Continua con Copilot per Power Pages
pt_br: Continuar com o Copilot para Power Pages
zh_cn: 继续使用适用于 Power Pages 的 Copilot

# ++CODE++916fa4a51e4d90e09a42289aa7961a6aff3401424f633240c630ac47f58a6d30
source: Copied to clipboard!
cs: Zkopírováno do schránky
fr: Copié dans le Presse-papiers !
it: Copiato negli Appunti.
ja: クリップボードにコピーしました!
pt_br: Copiado na área de transferência!
ru: Скопировано в буфер обмена.
tr: Panoya kopyalandı!
zh_cn: 已复制到剪贴板!

# ++CODE++9b44302f1c5e52f926415b952b83efce47fce76164fa64f1a42d1a1606efa11d
source: Copilot Response
fr: Réponse de Copilot
it: Risposta Copilot
pt_br: Resposta do Copilot
zh_cn: Copilot 回复

# ++CODE++b04e6767bf84555605710be1a94e48ddcbcb820353b859da427d189cf25395b4
source: Copilot illustration
fr: Illustration de Copilot
it: Illustrazione di Copilot
pt_br: Ilustração do Copilot
zh_cn: Copilot 演示

# ++CODE++b749e205302cc21952a1e9646569ca0af9017cc5f39dd741830551bdd4ae823e
source: Copy to clipboard
cs: Kopírovat do schránky
fr: Copier dans le presse-papiers
it: Copia negli Appunti
pt_br: Copiar para área de transferência
zh_cn: 复制到剪贴板

# ++CODE++a3e5be021818ca51bfb80179d97c9b7198659378a5bed3d2429d718acd4d0b82
source: Could not determine user data path.
fr: Impossible de déterminer le chemin d’accès aux données utilisateur.
pt_br: Não foi possível determinar o caminho de dados do usuário.
zh_cn: 无法确定用户数据路径。

# ++CODE++92a450b51c228fc0a45836a3cb66a77276511e8b1a48e237c97f27576695288d
source: Could not locate CodeQL CLI in global storage.
fr: Impossible de localiser l’interface CLI CodeQL dans le stockage global.
pt_br: Não foi possível localizar a CLI do CodeQL no armazenamento global.
zh_cn: 在全局存储中找不到 CodeQL CLI。

# ++CODE++47234b3978427950c2a4ef0161f6dc8484b7faf44b21d30616d5d019eebaafd8
source: Created PowerPages config file at {0} with default query suite: {1}
fr: Fichier config PowerPages créé dans {0} avec la suite de requêtes par défaut : {1}
pt_br: Arquivo de configuração do PowerPages criado em {0} com o pacote de consultas padrão: {1}
zh_cn: 使用默认查询套件创建了 PowerPages 配置文件 {0}: {1}

# ++CODE++a065334fc8846953a2dacf5096572bb814db18ac32fdb3e22cff0d387cdd4393
source: Created on: {0}
fr: Date de création : {0}
it: Data di creazione: {0}
pt_br: Criado(a) em: {0}
zh_cn: 创建时间: {0}

# ++CODE++203c445e9f2f638fcddf5e843dbaa43d55bd63740b6db268c2765e3cfa2e1608
source: Creating CodeQL database...
fr: Création de la base de données CodeQL...
pt_br: Criando banco de dados CodeQL...
zh_cn: 正在创建 CodeQL 数据库...

# ++CODE++446092146c92f1aa2441a29971d3844b0add13a951c45c491423f506bbe4edab
source: Creating {0}...
cs: Vytváří se {0}...
es: Creando {0}...
fr: Création de {0}...
it: Creazione di {0} in corso...
ja: {0} を作成しています...
pt_br: Criando {0}...
ru: Создание {0}...
tr: {0} oluşturuluyor...
zh_cn: 正在创建 {0}...

# ++CODE++ec8fd606d46114985d2f628dc67992093b8abb32489b3cbbfbb86bba96925943
source: Creator: {0}
fr: Créateur : {0}
it: Autore: {0}
pt_br: Criador: {0}
zh_cn: 创建者: {0}

# ++CODE++e0d1b68224bf0b31ef16b206c65b5f8f6b89d18161f4a7cdcb8d0ac8d952549a
source: Current
fr: Actuel
it: Corrente
pt_br: Atual
zh_cn: 当前

# ++CODE++fc47ac56c8a4446c02d8470168a888d8e0040cfc0bb5ce6173e324dccc72f24c
source: Current site path not found.
fr: Chemin d’accès au site actuel introuvable.
it: Percorso del sito corrente non trovato.
pt_br: Caminho do site atual não encontrado.
zh_cn: 找不到当前站点的路径。

# ++CODE++52587c2a224d685113316dc5961aec7749a46dded161bfe07c40b715ca61db29
source: Current site path not found. Please ensure you have a site folder open.
fr: Chemin d’accès au site actuel introuvable. Veuillez vérifier qu’un dossier de site est ouvert.
pt_br: Caminho do site atual não encontrado. Verifique se você tem uma pasta de site aberta.
zh_cn: 找不到当前站点路径。请确保已打开站点文件夹。

# ++CODE++e159063579c9e875ce444b930e8feb5d4fc1a93af6acb47d7a5cf9d5c5241153
source: Data model version: {0}
fr: Version du modèle de données : {0}
it: Versione modello di dati: {0}
pt_br: Versão do modelo de dados: {0}
zh_cn: 数据模型版本: {0}

# ++CODE++f88d5f387c99b46f054799a5bc6bac06d5b9f5dfd9eaf95627b5f34b137c7cb2
source: Database location: {0}
fr: Emplacement de la base de données : {0}
pt_br: Local do banco de dados: {0}
zh_cn: 数据库位置: {0}

# ++CODE++1a03bd2fd107c453f3183e30b9716f82200671e8270fbbefbe602f5a48705527
source: Debug
pt_br: Depurar
zh_cn: 调试

# ++CODE++c290c1e52a812e64e79be343e932a767838b3045abdc429dad559882f68f999d
source: Debug Current File
pt_br: Depurar Arquivo Atual
zh_cn: 调试当前文件

# ++CODE++187bba1fb2a0c6f665f35430ac7e2d820aab5b73b2921b99e26096a92cdf98e4
source: Debug Current Server Logic
pt_br: Depurar Lógica do Servidor Atual
zh_cn: 调试当前服务器逻辑

# ++CODE++136d1125a6f04a9c7c631e9be49bc4fca530e921f2af0fe5e2a9b1d95e0aa6ca
source: Debug Power Pages Server Logic
pt_br: Depurar Lógica do Servidor do Power Pages
zh_cn: 调试 Power Pages 服务器逻辑

# ++CODE++ff0a1f27b622e2032d9c0df2db5943ac6504497bf01e48c77335b6591f134522
source: Debug this server logic file
pt_br: Depurar este arquivo de lógica do servidor
zh_cn: 调试此服务器逻辑文件

# ++CODE++5bd78fcb75f98d65ab8f89a8f0b6681c25c13308fa8643c44ab459b7783c06c9
source: Default Environment: {0}
cs: Výchozí prostředí: {0}
fr: Environnement par défaut : {0}
it: Ambiente predefinito: {0}
pt_br: Ambiente Padrão: {0}
ru: Среда по умолчанию: {0}
zh_cn: 默认环境: {0}

# ++CODE++b48ff39c2e0f5451b9b29b09c2a74d2760db230749ffd48a6e901cc91fef9a8d
source: Deleted
pt_br: Excluído
zh_cn: 已删除

# ++CODE++bb1de92420a69402b065edb03f642d93984ea080582fb8b1ff49fee3aab7cab1
source: Deleted Locally
pt_br: Excluído Localmente
zh_cn: 已在本地删除

# ++CODE++9a983b9151d6fc6165f094e95ba9ba8cb588b59345cf8956f8fb77ee7ce36be2
source: Deleted locally
pt_br: Excluído localmente
zh_cn: 已在本地删除

# ++CODE++e07e053c2e10b3f1b6aef657d937cd91d45df4e40242788d7d621faea3380c27
source: Discard Changes
pt_br: Descartar Alterações
zh_cn: 放弃更改

# ++CODE++21c02244893ddc07c4494a2ac7eb69a143e75d7b49d04f10234a1865c2111310
source: Dislike something? Tell us more.
cs: Něco se vám nelíbí? Řekněte nám víc.
fr: Vous n’aimez pas quelque chose ? Dites-nous en plus.
it: Non ti è piaciuto qualcosa? Comunicaci altre informazioni.
pt_br: Não gostou de algo? Conte-nos mais.
zh_cn: 不喜欢某些元素? 请详细跟我们说说。

# ++CODE++e9f79ac902b11087dd0d34e8afc1de54df4e48d45861a0c0b6e4edd3c204f314
source: Display Name: {0} Unique Name: {1} Version: {2} Type: {3}
fr: Nom d’affichage : {0} Nom unique : {1} Version : {2} Type : {3}
it: Nome visualizzato: {0} Nome univoco: {1} Versione: {2} Tipo: {3}
pt_br: Nome de Exibição: {0} Nome Exclusivo: {1} Versão: {2} Tipo: {3}
zh_cn: 显示名称: {0} 唯一名称: {1} 版本: {2} 类型: {3}

# ++CODE++183c7081100618aebb39219dd011d8d9961649aad278be8fe49c0d1a8874684f
source: Do not show again
cs: Příště nezobrazovat
fr: Ne plus afficher
it: Non visualizzare più
pt_br: Não mostrar novamente
ru: Больше не показывать
zh_cn: 不再显示

# ++CODE++1d60d0cdcb5408b8e39ed364f675c9cad8a2f6174a413324d1e34437bd41269b
source: Don't Show Again
pt_br: Não Mostrar Novamente
zh_cn: 不再显示

# ++CODE++668c177d38e6f62ffe2ca64e3915151cfcd566204fd4e4b499e7fe237ad63fb1
source: Download Power Pages Site
fr: Télécharger le site Power Pages
pt_br: Baixar Site do Power Pages
zh_cn: 下载 Power Pages 站点

# ++CODE++f7bcb5a0e46a8772ca8a648ca7814c6532078d2040286bdcc8993ff7ea9db164
source: Download VS Code
fr: Télécharger VS Code
pt_br: Baixar o VS Code
zh_cn: 下载 VS Code

# ++CODE++7f3601875ec37c14ea70acbdfab60e330eec2f6b65ccad92bee9823a2eb326de
source: Download failed: {0}
pt_br: Falha no download: {0}
zh_cn: 下载失败: {0}

# ++CODE++f945885439672eb379c73eb7c9124496311c6ef5b3b04cd23ea0a1c146225b84
source: Download is complete. You can now view the report.
pt_br: O download foi concluído. Agora você pode exibir o relatório.
zh_cn: 下载已完成。现在可以查看报表。

# ++CODE++a5a4f0d8975940cbed234f9a5ee740f24e2b82f03a5b13e43f316b8395336e50
source: Downloading {0} site metadata ([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel "Show download output"))...
pt_br: Baixando os metadados do site {0} ([detalhes](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel "Mostrar saída do download"))...
zh_cn: 正在下载 {0} 网站元数据([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel "Show download output"))...

# ++CODE++ac72407b10d30bf47faf11da09b605a85fc649bd3f2e33acb281655cb9021d9d
source: Edit the site
cs: Upravit web
es: Editar el sitio
fr: Modifier le site
it: Modifica il sito
ja: サイトの編集
pt_br: Editar o site
ru: Изменить сайт
tr: Siteyi düzenle
zh_cn: 编辑站点

# ++CODE++102f547594eb0c68a16e0e5eb6661fa576c7a5fb6ce224ea36194e9fd4f87dac
source: Enhanced Data Model
pt_br: Modelo de Dados Avançado
zh_cn: 增强的数据模型

# ++CODE++0feefedc5916a0c9a464f4ef9f28fab835a23e1d035878f397e38053381aa3fa
source: Enter Organization ID
cs: Zadejte kód organizace.
fr: Entrer l’ID d’organisation
it: Immetti ID organizzazione
ja: 組織 ID を入力します
pt_br: Inserir ID da Organização
ru: Введите ИД организации
tr: Kuruluş Kimliğini Girin
zh_cn: 输入组织 ID

# ++CODE++80ccd89cd4c287f3ca9f3693982e8034544fefeba563c974f93482158e8f0737
source: Enter name
cs: Zadejte název.
es: Escribir nombre
fr: Entrer un nom
it: Immetti nome
ja: 名前を入力します
pt_br: Inserir nome
ru: Введите имя
tr: Ad girin
zh_cn: 输入名称

# ++CODE++02009b0b8ebfd63aa5f308dbee9b564a7d73eaf254c5260ce3251a7376e79a88
source: Enter the environment URL
cs: Zadejte ID prostředí.
fr: Entrer l’URL de l’environnement
it: Immetti l'URL dell'ambiente
pt_br: Inserir a URL do ambiente
ru: Введите URL-адрес среды
tr: Ortam URL'sini girin
zh_cn: 输入环境 URL

# ++CODE++048d1e764983197603f13e79d28f59bbfa358c0c11e1184c27fc687512589778
source: Enter the name of the web template
cs: Zadejte název šablony webu.
es: Escriba el nombre de la plantilla web
fr: Entrer le nom du modèle web
it: Immetti il nome del modello Web
ja: Web テンプレートの名前を入力します
pt_br: Inserir o nome do modelo da Web
ru: Введите имя веб-шаблона
tr: Web şablonunun adını girin
zh_cn: 输入 Web 模板的名称

# ++CODE++7d63bf943bc02891e817defccba51294daaf55fc6418bc5bac517fd254ed07e2
source: Environment ID is not available
fr: L’ID d’environnement n’est pas disponible
pt_br: ID do ambiente não disponível
zh_cn: 环境 ID 不可用

# ++CODE++e7543af0c2e457267ab72756c809d1cbb2f9d2c888d7c712a2022d464b3e6d57
source: Environment ID is required
pt_br: A ID do ambiente é necessária
zh_cn: 需要环境 ID

# ++CODE++b6d455a8dab8e66229a985315b5db1e1c065ba6d999dffd2795c03189fb32265
source: Environment ID: {0}
fr: ID environnement : {0}
it: ID ambiente: {0}
pt_br: ID do Ambiente: {0}
zh_cn: 环境 ID: {0}

# ++CODE++273ac70fb32a6f135f9998bf3601f83596fccea343ed551d2a405c4958486720
source: Environment changed successfully.
fr: Environnement correctement modifié.
it: Modifica dell'ambiente completata.
pt_br: Ambiente alterado com êxito.
zh_cn: 已成功更改环境。

# ++CODE++340e3fe1f8281d7070af99b12b978e9e1d0ef8e853314ed1b6dc1dcafc8bb8f7
source: Environment:
pt_br: Ambiente:
zh_cn: 环境:

# ++CODE++239d14b889f5a193581388efd042b82c5cb36e89f15b4141f740ec40d00ea868
source: Error accessing CodeQL extension: {0}
fr: Erreur lors de l’accès à l’extension CodeQL : {0}
pt_br: Erro ao acessar a extensão CodeQL: {0}
zh_cn: 访问 CodeQL 扩展时出错: {0}

# ++CODE++56e43ff4d49e0fea0222cc642310156febd5be11505e801cfccc65c2b7ebd3b6
source: Error creating config file: {0}
fr: Erreur lors de la création du fichier config : {0}
pt_br: Erro ao criar o arquivo de configuração: {0}
zh_cn: 创建配置文件时出错: {0}

# ++CODE++9c567f60562a1ccaae95f9ec1de45a0785b8a433ef8f2d559ec0bcec6cc3c13d
source: Error during CodeQL analysis: {0}
fr: Erreur lors de l’analyse CodeQL : {0}
pt_br: Erro durante a análise do CodeQL: {0}
zh_cn: CodeQL 分析期间出错: {0}

# ++CODE++4c925eac2f74f5a794b648a7e4b7a7c6a209ed6b5000411dee8a5519cd1e026b
source: Error getting CLI path from extension API: {0}
fr: Erreur lors de l’obtention du chemin d’accès CLI à partir de l’API d’extension : {0}
pt_br: Erro ao obter o caminho da CLI da API de extensão: {0}
zh_cn: 从扩展 API 获取 CLI 路径时出错: {0}

# ++CODE++fbbcdb76093366eb99ca518a403862ce87722ffe8606083c02ecef6387e987f8
source: Error opening results file: {0}
fr: Erreur lors de l’ouverture du fichier de résultats : {0}
pt_br: Erro ao abrir o arquivo de resultados: {0}
zh_cn: 打开结果文件时出错: {0}

# ++CODE++b52004d98911ff84ee9141e24f950f1a235941ad2beeb18de199c2e44354bfd1
source: Error opening with SARIF viewer: {0}
fr: Erreur lors de l’ouverture avec la visionneuse SARIF : {0}
pt_br: Erro ao abrir com o visualizador SARIF: {0}
zh_cn: 使用 SARIF 查看器打开时出错: {0}

# ++CODE++a47e4735bc198999c5a031692984499d88ad2b7a5119e4f96016cee79a4fb27f
source: Error reading config file: {0}
fr: Erreur lors de la lecture du fichier config : {0}
pt_br: Erro ao ler o arquivo de configuração: {0}
zh_cn: 读取配置文件时出错: {0}

# ++CODE++ff3a79060f3dbd86d89f487bf242ca47e64f0db6c29bfce0ae9d3d0b5606448d
source: Error reading results: {0}
fr: Erreur lors de la lecture des résultats : {0}
pt_br: Erro ao ler os resultados: {0}
zh_cn: 读取结果时出错: {0}

# ++CODE++f59ffa6ae59ffa089eb2907ceac28bf43d85e0bd647c80d66569caed29837d24
source: Error searching for CodeQL CLI: {0}
fr: Erreur lors de la recherche de l’interface CLI CodeQL : {0}
pt_br: Erro ao pesquisar a CLI do CodeQL: {0}
zh_cn: 搜索 CodeQL CLI 时出错: {0}

# ++CODE++e871c663b45be72da181a9de5bccc1b9e415ed8bab4fbc98f87cd9fe6162ded4
source: Error updating config file: {0}
fr: Erreur lors de la mise à jour du fichier config : {0}
pt_br: Erro ao atualizar o arquivo de configuração: {0}
zh_cn: 更新配置文件时出错: {0}

# ++CODE++8a6c3a849390110981cd9588c269ec59444485aed2239ad772afdb0d427523d8
source: Executing: {0}
fr: Exécution : {0}
pt_br: Executando: {0}
zh_cn: 正在执行: {0}

# ++CODE++9f5b023a413a7d0771cc3fb51b103dc0aaaafe8f7b7c88c7258d43e3bc5b243d
source: Expand All
pt_br: Expandir Tudo
zh_cn: 全部展开

# ++CODE++5a2391041cb1f6f5ab0cce07946dbf4222358fbd947768d94ac12ef5329485d3
source: Explain the following code snippet:
cs: Vysvětlit následující fragment kódu:
fr: Expliquez l’extrait de code suivant :
it: Spiega il frammento di codice seguente:
pt_br: Explique o seguinte trecho de código:
zh_cn: 解释以下代码片段:

# ++CODE++f9e17ed11037dab93f8820c30db63b2ff2a045b5761f71818b7291afae60f199
source: Explain the following code {% include 'Page Copy'%}
cs: Vysvětlit následující kód: {% include 'Page Copy'%}
fr: Expliquer le code suivant {% include 'Page Copy'%}
it: Spiega il codice seguente {% include 'Page Copy'%}
pt_br: Explique o seguinte código {% include 'Page Copy'%}
zh_cn: 解释以下代码 {% include 'Page Copy'%}

# ++CODE++faa8395365de427167672364e213e1f84ea2c3103922d44673f61ed2873f6745
source: Export Metadata Diff
pt_br: Exportar Comparação de Metadados
zh_cn: 导出元数据差异

# ++CODE++1f14b9b0b30891bec1ece43097d7ae38a34b666738f9173658022778f5ce3ebf
source: Exporting comparison...
pt_br: Exportando comparação...
zh_cn: 正在导出比较...

# ++CODE++173848927e1a6ed7f8c52d958d530c9ce90053649c734a3bc20bfb2053d8ef88
source: Extension installed but API not available yet. Opening as text file...
fr: Extension installée, mais l’API n’est pas encore disponible. Ouverture en tant que fichier texte...
pt_br: Extensão instalada, mas a API ainda não está disponível. Abrindo como arquivo de texto...
zh_cn: 已安装扩展，但 API 尚不可用。正在以文本文件形式打开...
