Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# ++CODE++bf67e1194aabff2106dde73ed7318caf658a4cebe27dbd2d03239a141e16a211
source: PowerPages config file created successfully: {0}
fr: Le fichier config PowerPages a été créé : {0}
pt_br: Arquivo de configuração do PowerPages criado com sucesso: {0}
zh_cn: 已成功创建 PowerPages 配置文件: {0}

# ++CODE++51b545b10e7c3ffa5c7a61b222ed1039c55ddba4cc130f834338e498cdd0d129
source: PowerPages config file updated successfully: {0}
fr: Le fichier config PowerPages a été mis à jour : {0}
pt_br: Arquivo de configuração do PowerPages atualizado com sucesso: {0}
zh_cn: PowerPages 配置文件已成功更新: {0}

# ++CODE++777d5f3afd46e18d42c0baad6d9a0c7a6867cdf31ae4d342ad5e695486f05ae7
source: Preparing pac CLI (v{0})...
cs: Připravuje se pac CLI (verze {0})...
es: Preparando pac CLI (v{0})...
fr: Préparation de pac CLI (v{0}) en cours...
it: Preparazione di pac CLI: in corso (v{0})...
ja: pac CLI (v{0}) を準備しています...
pt_br: Preparando a pac CLI (v{0})...
ru: Подготовка pac CLI (версия {0})...
tr: pac CLI (v{0}) hazırlanıyor...
zh_cn: 正在准备 pac CLI (v{0})...

# ++CODE++a8994ac993c5dbea35b5267f2c2ee800ee8ce17569ba51a699748b406c5170fd
source: Preparing to open Power Pages site...
pt_br: Preparando para abrir o site do Power Pages...
zh_cn: 正在准备打开 Power Pages 网站...

# ++CODE++f6412ced721a26ac3e3cb55d3ff713d8403c3dfc2efa0cff07b48478bdd57555
source: Preview site
cs: Zobrazit náhled webu
fr: Afficher l’aperçu du site
it: Sito in anteprima
pt_br: Site da versão preliminar
ru: Предварительная версия сайта
tr: Siteyi önizle
zh_cn: 预览版站点

# ++CODE++1cc20af81855b8570858ea1ac0491000d230bcf2ac53c1c1b30243a9b58a2036
source: Preview site URL is not valid
cs: Adresa URL webu verze Preview není platná.
fr: L’URL du site de version préliminaire n’est pas valide
it: URl di anteprima sito non valido
pt_br: A URL do site da versão preliminar não é válida
zh_cn: 预览版站点 URL 无效

# ++CODE++fa20488e9d7f18238d5f0c72e459c52354657b24877bb4197902daa667bd57c9
source: Primary query suite {0} failed: {1}
fr: Échec de la suite de requêtes principale {0} : {1}
pt_br: Falha no pacote {0} de consultas primárias: {1}
zh_cn: 主查询套件 {0} 失败: {1}

# ++CODE++66c77d8211180ed42d204144272cd0985a1c118696c856b61d2dd63d1f416d86
source: Process error: {0}
fr: Erreur de processus : {0}
pt_br: Erro de processo: {0}
zh_cn: 流程错误: {0}

# ++CODE++7a6098eb5ff2c2401890216bb502ce6583ff7bddc99e62f8751551eab45ae1b4
source: Profile Kind: {0}
cs: Druh profilu: {0}
es: Tipo de perfil: {0}
fr: Type de profil : {0}
it: Tipo di profilo: {0}
ja: プロファイルの種類: {0}
pt_br: Tipo de Perfil: {0}
ru: Вид профиля: {0}
tr: Profil Türü: {0}
zh_cn: 配置文件种类: {0}

# ++CODE++6e31aef31ad6cc82d8d8d41fd45043885761a11b9222b1ec7ce9d78a36dd4451
source: Ready to select download folder
pt_br: Pronto para selecionar a pasta de download
zh_cn: 已准备好选择下载文件夹

# ++CODE++fdc383411e8354c470e19c960527019a9bf48c61c08a5c3ec3fb8b7b32ccba34
source: Refreshing comparison for {0} ([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel "Show download output"))...
pt_br: Atualizando comparação para {0} ([detalhes](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel "Mostrar saída de download"))...
zh_cn: 正在刷新 {0} 的比较([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel "Show download output"))...

# ++CODE++95e154398a4bc0091aa4d6b607472ac5a89e41fbc84a3a49f823314d6de9eebc
source: Replace
pt_br: Substituir
zh_cn: 替换

# ++CODE++b62120c5416487f4c793d75aee7fea083971e5ac665a3f35767023f408f482e5
source: Response data is empty
cs: Data odpovědi jsou prázdná.
fr: Les données de la réponse sont vides
it: I dati della risposta sono vuoti
pt_br: Os dados da resposta estão vazios
ru: Данные ответа пусты
zh_cn: 响应数据为空

# ++CODE++b87504a6b179044cf99d39cf641f47aa5e76c4c5b949413ec33953ec35c10ac4
source: Results opened in SARIF viewer successfully.
fr: Les résultats ont été ouverts dans la visionneuse SARIF.
pt_br: Resultados abertos no visualizador SARIF com sucesso.
zh_cn: 已成功在 SARIF 查看器中打开结果。

# ++CODE++00d60e31a4e6b8344d4201f25a6a7dee770713107f6d097abb01559d32b17f26
source: Run
pt_br: Executar
zh_cn: 运行

# ++CODE++ea703d2310b31c503c3e81398804a049aa6e65f78dbe7014f8f52dae263dadfb
source: Run Server Logic
pt_br: Executar Lógica do Servidor
zh_cn: 运行服务器逻辑

# ++CODE++80b0001b823cb916650c75c5c08b3bdf9be4951036ec14ee4086b487125d05c8
source: Run this server logic file without debugging
pt_br: Executar este arquivo de lógica do servidor sem depuração
zh_cn: 在不调试的情况下运行此服务器逻辑文件

# ++CODE++9eb3810da0fd0dbacf4b6f4d7ad58e6e631ab807c0dd404dcb9f03066da8443b
source: Running CodeQL analysis...
fr: Exécution de l’analyse CodeQL...
pt_br: Executando a análise do CodeQL...
zh_cn: 正在运行 CodeQL 分析...

# ++CODE++3a74613b70fb8cc650773d71501f0c370322e9ae7d7739857db61c95a3b1bc80
source: SARIF viewer extension does not expose expected API. Falling back to text editor...
fr: L’extension de visionneuse SARIF n’expose pas l’API attendue. Retour à l’éditeur de texte...
pt_br: A extensão do visualizador SARIF não expõe a API esperada. Voltando ao editor de texto...
zh_cn: SARIF 查看器扩展不公开预期的 API。正在回退到文本编辑器...

# ++CODE++3404d61aa3fdceef4ff6d5c7fe612d467f785bf5e3159771b4cde9b1e83e0f22
source: SARIF viewer extension installed successfully. Activating...
fr: L’extension de visionneuse SARIF a été installée. Activation en cours...
pt_br: Extensão do visualizador SARIF instalada com sucesso. Ativando...
zh_cn: 已成功安装 SARIF 查看器扩展。正在激活...

# ++CODE++ceaca7d5816edb7826d84436807510a3a840ee0808fd62a568e2e1541eae6457
source: SARIF viewer extension not found.
fr: Extension de visionneuse SARIF introuvable.
pt_br: Extensão do visualizador SARIF não encontrada.
zh_cn: 找不到 SARIF 查看器扩展。

# ++CODE++3b90c194a93acd61648464bdc410c9e872fc30596445a619618cf9ee51fe82c0
source: Save HTML Report
pt_br: Salvar Relatório HTML
zh_cn: 保存 HTML 报表

# ++CODE++915bcbc369a5a2312efe4634e7330f5820896912ea40d6086089e2edfb7f95d7
source: Save Report
pt_br: Salvar Relatório
zh_cn: 保存报表

# ++CODE++0134bc37f2fdeb11daa9e760ecee0ef9706989b33f77a38daadb8b7aae685749
source: Saving your file ...
cs: Ukládá se soubor...
es: Guardando su archivo...
fr: Enregistrement de votre fichier en cours...
it: Salvataggio del file in corso...
ja: ファイルを保存しています...
pt_br: Salvando seu arquivo...
ru: Сохранение файла...
tr: Dosyanız kaydediliyor...
zh_cn: 正在保存文件...

# ++CODE++e597da9c984517f802536a83c825cd4f017898c5f28030fe1f62fb94f5228828
source: Select Folder
fr: Sélectionner un dossier
it: Seleziona cartella
pt_br: Selecionar Pasta
zh_cn: 选择文件夹

# ++CODE++6e26632772595a9d2fdf17191f6d7b59983c308d884deed6ba317054f7d30688
source: Select Folder for new PCF Control
cs: Vyberte složku pro nový ovládací prvek PCF.
fr: Sélectionner un dossier pour le nouveau contrôle PCF
it: Seleziona cartella per nuovo controllo PCF
pt_br: Selecionar Pasta para novo Controle PCF
ru: Выберите папку для нового элемента управления PCF
tr: Yeni PCF Denetimi için Klasör Seçin
zh_cn: 为新的 PCF 控件选择文件夹

# ++CODE++e4efd0ebbc891e539d343ce3247c566fbb105ea4f5746251a256995cdeaefcd3
source: Select Folder to Download Power Pages Site
fr: Sélectionner le dossier pour télécharger le site Power Pages
pt_br: Selecione a Pasta para Baixar o Site do Power Pages
zh_cn: 选择文件夹以下载 Power Pages 站点

# ++CODE++a40f78f3a7f5c5ab1b101e95cdf044552542712fdcf45a83dfea3f455b6f638a
source: Select Type
cs: Vybrat typ
es: Seleccionar tipo
fr: Sélectionner le type
it: Seleziona tipo
ja: 種類の選択
pt_br: Selecionar Tipo
ru: Выбрать тип
tr: Tür Seç
zh_cn: 选择类型

# ++CODE++84744ab78214e2fc629e2925963080b5ad6c4ab1db6cce278900c3e6403bbc2f
source: Select a website to compare with
pt_br: Selecione um site para comparação
zh_cn: 选择要与之进行比较的网站

# ++CODE++87468e6a845b82466220c11dd0ca315a4389dc1cb8e0ee102035bb4ce5cb7e39
source: Select an environment
fr: Sélectionner un environnement
it: Seleziona un ambiente
pt_br: Selecionar um ambiente
zh_cn: 选择环境

# ++CODE++fafd4e6859e28fd1f76851b8a08f6d3ccb58402fb65e44f3c342575741b056e6
source: Select an environment to compare with
pt_br: Selecione um ambiente com o qual comparar
zh_cn: 选择要与之进行比较的环境

# ++CODE++58ea04f09a2cbf67d55e70c45a6da4998e72e8e50f91e63862c0d65d14dfb1f5
source: Select folder for CodeQL database
fr: Sélectionner un dossier pour la base de données CodeQL
pt_br: Selecionar pasta para o banco de dados CodeQL
zh_cn: 选择 CodeQL 数据库的文件夹

# ++CODE++259b03b37447930b5127e28e350f988803a3047bbb0c7be4441c7da4f9b517d4
source: Select the folder that contains your compiled output
fr: Sélectionner le dossier qui contient votre sortie compilée
it: Seleziona la cartella che contiene l'output compilato
pt_br: Selecione a pasta que contém a sua saída compilada
zh_cn: 选择包含经编译的输出的文件夹

# ++CODE++26297069e403c73e147151f2964757b7e9149762cf3a8e04ffd833907fb979e4
source: Select the folder that will contain your project root for your site
fr: Sélectionner le dossier qui contiendra la racine de votre projet pour votre site
it: Seleziona la cartella che conterrà la radice del progetto per il sito
pt_br: Selecionar a pasta que conterá a raiz do projeto para o site
zh_cn: 选择将包含站点的项目根的文件夹

# ++CODE++4d6f03fa73020c945e651c34d40c5529f3477ac02df254c1764a68d576575e14
source: Selection is empty.
cs: Výběr je prázdný.
fr: La sélection est vide.
it: Selezione vuota.
pt_br: A seleção está vazia.
ru: Ничего не выбрано.
zh_cn: 选择是空的。

# ++CODE++d4e969ee5e3ea8fe5e7f9195be448fd5fd5d2cb6f487929c3e495cbbe7e8f1e8
source: Selection is too large. Try making a shorter selection.
cs: Výběr je příliš velký. Zkuste vybrat méně položek.
fr: La sélection est trop grande. Essayez d’effectuer une sélection plus petite.
it: La selezione è troppo ampia. Provare a eseguire una selezione più breve.
pt_br: A seleção é muito grande. Tente fazer uma seleção mais curta.
zh_cn: 选择过大。请尝试缩短选择。

# ++CODE++f460c321b3d56be39d9fae8946e759608e6b8f34c0378aaa91e2996b2bd8f2b5
source: Server Logic debugging requires an open workspace.
pt_br: A depuração da Lógica do Servidor requer um workspace aberto.
zh_cn: 服务器逻辑调试需要开放的工作区。

# ++CODE++142027a259879fdd2b6410360a9cd3798f433c2fc5668bb685dd4ff513072e16
source: Session Details
fr: Détails de la session
it: Dettagli sessione
pt_br: Detalhes da Sessão
zh_cn: 会话详细信息

# ++CODE++08b44927dd7cd913d5c36c74e3ccf55ef966b6c2f067b173fbbe4e3c32f30d15
source: Session ID: {0}
fr: ID de session : {0}
it: ID sessione: {0}
pt_br: ID da Sessão: {0}
zh_cn: 会话 ID: {0}

# ++CODE++b874846bfcc51aecfc0366c676894ca6aa980e7f8de9a6632bb6ade00b49bc47
source: Show Diff
pt_br: Mostrar Comparação
zh_cn: 显示差异

# ++CODE++899fb203e6c2faac8093e21a2fa8db0d4b13d16ea5492461d8b72dbcee3ecf2a
source: Show Output Panel
cs: Zobrazit panel výstupu
fr: Afficher le volet de sortie
it: Mostra pannello di output
pt_br: Mostrar Painel de Saída
zh_cn: 显示输出面板

# ++CODE++2f65ba5aa38a9acac3a9a9c0a9aeecd7b32796008dc63432bedbe6ef62982558
source: Sign in to VS Code with PAC CLI account
fr: Se connecter à VS Code avec un compte CLI PAC
pt_br: Entre no VS Code com a conta CLI do PAC
zh_cn: 使用 PAC CLI 帐户登录 VS Code

# ++CODE++524bca0347e50e3801bebf27374124b3babf072729b4da4bcc45ef5c385ee8f4
source: Site Details
fr: Détails du site
it: Dettagli sito
pt_br: Detalhes do Site
zh_cn: 站点详细信息

# ++CODE++b7cc9930c5fbe6d45071fbce87e513399eda01d1be3cdcaa8c5c1426e98e8066
source: Site Name:
pt_br: Nome do Site:
zh_cn: 网站名称:

# ++CODE++4fa72d80ab1b04e31f450bacc89bff526a5e52e3d104d153b3b493b108330b3c
source: Site download cancelled. Authentication is required to proceed.
fr: Téléchargement du site annulé. L’authentification est requise pour continuer.
pt_br: Download do site cancelado. A autenticação é obrigatória para continuar.
zh_cn: 站点下载已取消。需要进行身份验证才能继续。

# ++CODE++ca57fa2618956b4946832e64d4815e0a68f623ab2d39b25dff228afbcdd8d008
source: Site download cancelled. Correct environment connection is required.
fr: Téléchargement du site annulé. Une connexion d’environnement correcte est requise.
pt_br: Download do site cancelado. É necessária uma conexão correta com o ambiente.
zh_cn: 站点下载已取消。需要正确的环境连接。

# ++CODE++c0917a71517a4a08ef56adaaec8f79404a4d5cc14afc8d141e9aa6181bee8622
source: Site download cancelled. No folder selected.
fr: Téléchargement du site annulé. Aucun dossier sélectionné.
pt_br: Download do site cancelado. Nenhuma pasta selecionada.
zh_cn: 站点下载已取消。未选择任何文件夹。

# ++CODE++e14f56f166e3f1c738244eb549eed009edbcede757905ce707cc30dbffd60c8b
source: Site download failed. Please try again later.
pt_br: Falha ao baixar o site. Tente novamente mais tarde.
zh_cn: 网站下载失败。请稍后重试。

# ++CODE++a72357d268bce5e1643bfd74563495784179f75ace0d652db8f808f293586b63
source: Site management URL not found for the selected site. Please try again after refreshing the environment.
fr: L’URL de gestion de site est introuvable pour le site sélectionné. Veuillez réessayer après avoir actualisé l’environnement.
it: URL di gestione del sito non trovato per il sito selezionato. Riprova dopo aver aggiornato l'ambiente.
pt_br: URL de gerenciamento de sites não encontrada para o site selecionado. Tente novamente depois de atualizar o ambiente.
zh_cn: 未找到所选站点的站点管理 URL。请刷新环境后重试。

# ++CODE++f7094162bd4c4b59aa706387714347223e1569c79c5b37eb19ac754a33a0fdd0
source: Site runtime preview feature is not enabled.
fr: La fonctionnalité d’évaluation de runtime du site n’est pas activée.
it: La funzionalità di anteprima di esecuzione del sito non è abilitata.
pt_br: A versão preliminar do recurso do runtime do site não está habilitada.
zh_cn: 未启用站点运行时预览功能。

# ++CODE++a2eb2f1a32eedafa3e666685f09ee073175d309d6137b80edac517b51bffd84d
source: Site visibility: {0}
fr: Visibilité du site : {0}
it: Visibilità sito: {0}
pt_br: Visibilidade do site: {0}
zh_cn: 站点可见性: {0}

# ++CODE++27dd8c8e67d15783f51c6b71ed60d5350731daa85b418f1e84c2e5828ae2d54e
source: Some references might be broken. Please check diagnostics for details.
cs: Některé odkazy mohou být nefunkční. Podrobnosti najdete v diagnostice.
fr: Certaines références peuvent être rompues. Consultez les diagnostics pour obtenir des détails.
it: Alcuni riferimenti potrebbero essere danneggiati. Per altre informazioni, controlla la diagnostica.
pt_br: Algumas referências podem estar com problemas. Verifique o diagnóstico para obter detalhes.
zh_cn: 有些引用可能已损坏。请查看诊断资料以了解详细信息。

# ++CODE++189f24adc299ea91ceab21d8100a58d89294ed17395c4e4dbc4733c9b92543df
source: Something went wrong. Don’t worry, you can try again.
fr: Un problème s’est produit. Ne vous inquiétez pas, vous pouvez réessayer.
it: Si è verificato un errore. Non preoccuparti. Puoi riprovare.
pt_br: Algo deu errado. Não se preocupe, você pode tentar novamente.
zh_cn: 出现问题。别担心，可以重试。

# ++CODE++9363df99329b30b2e856758ea1e1f08e117936f1a8116e29f8d64b4bc62f9ab6
source: Standard Data Model
pt_br: Modelo de Dados Standard
zh_cn: 标准数据模型

# ++CODE++1cb2204ec480119230ac755787106a1550d9329553d146abd56da1947079d577
source: Starting CodeQL analysis for: {0}
fr: Démarrage de l’analyse CodeQL pour : {0}
pt_br: Iniciando a análise do CodeQL para: {0}
zh_cn: 正在为以下项启动 CodeQL 分析: {0}

# ++CODE++155f816c0407310c0dab222493370773e045ee7fe04e6c9a951b07f495531264
source: Submit
cs: Odeslat
fr: Soumettre
it: Invia
pt_br: Enviar
zh_cn: 提交

# ++CODE++9543efee4b5aadd6f27f5d4a06361b18d153aaf0b66e0121622fb9fd3581fdf8
source: Successfully discarded local changes to '{0}'.
pt_br: Alterações locais descartadas com sucesso em ''{0}''.
zh_cn: 已成功放弃对 "{0}" 的本地更改。

# ++CODE++52901a0a85676bc5805d19ecfc4921edeff3246e815b0d199dad38874519f160
source: Successfully discarded local changes to {0} files in '{1}'.
pt_br: Alterações locais descartadas com sucesso nos arquivos {0} em ''{1}''.
zh_cn: 已成功放弃对 "{1}" 中 {0} 个文件的本地更改。

# ++CODE++e3a0cecb7c0c51b4a918164be2e4a75795139fbc652adbed3c6a144cf4adc009
source: Switching environment...
pt_br: Alternando ambiente...
zh_cn: 正在切换环境...

# ++CODE++550b4ee4e0ae69ddf9c18f9d46f59e59da633a2644633d140197d62ded3f2657
source: Tell us more.
cs: Řekněte nám víc.
fr: Dites-nous en plus.
it: Fornisci altre informazioni.
pt_br: Conte-nos mais.
zh_cn: 详细跟我们说说。

# ++CODE++d676394d137346db95d191c756b08c5be6fbaef4a6ca2159b8e53736e54f98e1
source: Tenant ID: {0}
fr: ID client : {0}
it: ID tenant: {0}
pt_br: ID do Locatário: {0}
zh_cn: 租户 ID: {0}

# ++CODE++438c442a839dca3bb4dbecd0421f454f268650517fe631e5900233b73a874bc7
source: The CodeQL extension is required to run this command. Do you want to install it now?
fr: L’extension CodeQL est nécessaire pour exécuter cette commande. Voulez-vous l’installer maintenant ?
pt_br: A extensão CodeQL é necessária para executar este comando. Deseja instalá-la agora?
zh_cn: 若要运行此命令，需要 CodeQL 扩展。是否要立即安装?

# ++CODE++618f7afd7be2f12bf2ebbaba5bc7e951d2ebfb11d4480647f991fbb664caa26e
source: The Power Pages generator is ready for use in your VS Code extension!
cs: Generátor Power Pages je připraven k použití v rozšíření editoru VS Code.
es: ¡El generador de Power Pages ya se puede usar en su extensión de VS Code!
fr: Le générateur Power Pages est prêt à être utilisé dans votre extension VS Code !
it: Il generatore Power Pages è pronto per l'utilizzo nell'estensione VS Code.
ja: Power Pages ジェネレーターは、VS Code 拡張機能での使用準備が完了しています。
pt_br: O gerador do Power Pages está pronto para uso na sua extensão do VS Code.
ru: Генератор Power Pages готов к использованию в расширении VS Code.
tr: Power Pages oluşturucusu, VS Code uzantınızda kullanıma hazır!
zh_cn: Power Pages 生成器已可供在 VS Code 扩展中使用!

# ++CODE++3ed1f203bd6f7102d8c5dcf88fe4fb5327b54a1e88962adcddbf9a023bcf8875
source: The SARIF Viewer extension is recommended for viewing CodeQL results. Would you like to install it now?
fr: L’extension de visionneuse SARIF est recommandée pour afficher les résultats CodeQL. Voulez-vous l’installer maintenant ?
pt_br: A extensão do Visualizador SARIF é recomendada para exibir os resultados do CodeQL. Gostaria de instalá-la agora?
zh_cn: 建议使用 SARIF 查看器扩展查看 CodeQL 结果。是否要立即安装?

# ++CODE++98a4cf89a57d927fce50521aaf27e9fd7dc5046e82725348cf6024469a4f2bdf
source: The account signed in to VS Code differs from the one authenticated in PAC CLI (Power Platform CLI). This mismatch can cause data not to load or actions to fail because UI commands run through the CLI. To fix it, sign in to VS Code using the same account as your PAC CLI. If needed, you can update your PAC CLI authentication separately via the command line.
fr: Le compte connecté à VS Code diffère de celui authentifié dans l’interface CLI PAC (CLI Power Platform). Cette incompatibilité peut empêcher le chargement des données ou l’échec des actions, car les commandes d’interface utilisateur s’exécutent via l’interface CLI. Pour résoudre ce problème, connectez-vous à VS Code à l’aide du même compte que votre CLI PAC. Si nécessaire, vous pouvez mettre à jour votre authentification CLI PAC séparément via la ligne de commande.
pt_br: A conta conectada ao VS Code é diferente da autenticada na CLI do PAC (Power Platform CLI). Essa incompatibilidade pode fazer com que os dados não sejam carregados ou as ações falhem, pois os comandos da interface do usuário são executados pela CLI. Para corrigir isso, entre no VS Code com a mesma conta da sua CLI do PAC. Se necessário, você pode atualizar a autenticação da CLI do PAC separadamente por meio da linha de comando.
zh_cn: 登录到 VS Code 的帐户不同于在 PAC CLI (Power Platform CLI)中进行身份验证的帐户。这种不匹配可能会导致数据无法加载或操作失败，因为 UI 命令通过 CLI 运行。若要解决此问题，请使用与 PAC CLI 相同的帐户登录 VS Code。如果需要，可以通过命令行单独更新 PAC CLI 身份验证。

# ++CODE++0bc2e4918b64f82220bde3dae30dc007a45fb59c3677833fb5a0e275a3b6b54b
source: The extension 'Microsoft Edge Tools' is required to run this command. Do you want to install it now?
fr: L’extension 'Microsoft Edge Tools' est nécessaire pour exécuter cette commande. Voulez-vous l’installer maintenant ?
it: Per eseguire questo comando è necessaria l'estensione "Microsoft Edge Tools". Installarla ora?
pt_br: A extensão "Microsoft Edge Tools" é necessária para executar este comando. Deseja instalá-la agora?
zh_cn: 运行此命令需要扩展程序 "Microsoft Edge Tools"。是否要立即安装?

# ++CODE++e4a2396fd7a366292a40abc87b18a2329458c258f4d0e0e593e6189dff19a117
source: The name you want to give to this authentication profile
cs: Název, který chcete dát tomuto ověřovacímu profilu
es: Nombre que desea asignar a este perfil de autenticación
fr: Nom que vous souhaitez attribuer à ce profil d’authentification
it: Il nome che vuoi assegnare a questo profilo di autenticazione
ja: この認証プロファイルに指定する名前
pt_br: O nome que você deseja dar a este perfil de autenticação
ru: Имя, которое вы хотите дать этому профилю проверки подлинности
tr: Bu kimlik doğrulama profiline vermek istediğiniz ad
zh_cn: 要为此身份验证配置文件指定的名称

# ++CODE++5eccedc8c04d2137a9eb74edf18ea469b4b63e7315de4b8fe49c48bb8d0780e9
source: The pac CLI is ready for use in your VS Code terminal!
cs: Tento pac CLI je připraven k použití v terminálu editoru VS Code.
es: ¡pac CLI ya se puede usar en su terminal de VS Code!
fr: Le pac CLI est prêt à être utilisé dans votre terminal VS Code !
it: pac CLI è pronto per l'utilizzo nel terminale VS Code.
ja: pac CLI は、VS Code ターミナルでの使用準備が完了しています。
pt_br: A pac CLI está pronta para uso no seu terminal do VS Code!
ru: Компонент pac CLI готов к использованию в терминале VS Code!
tr: pac CLI, VS Kod terminalinizde kullanıma hazır!
zh_cn: pac CLI 已可供在 VS Code 终端中使用!

# ++CODE++51d2fcbba3e5fc15afbd85f1d179e58b9c4328b466cd7872ec77dc0c9cb34afe
source: The preview shown is for published changes. Please publish any pending changes to see them in the preview.
fr: L’aperçu affiché est celui des modifications publiées. Publiez les modifications en attente pour les voir dans l’aperçu.
it: L'anteprima mostrata è per le modifiche pubblicate. Pubblica tutte le modifiche in sospeso per vederle nell'anteprima.
pt_br: A visualização mostrada refere-se às alterações publicadas. Publique quaisquer alterações pendentes para vê-las na visualização.
zh_cn: 预览显示的是已发布的更改。请发布任何挂起的更改，以便在预览中查看它们。

# ++CODE++1f362261e8bb9564245fa7e590732de71b5f6cbb3e9963a8d8573b51ae18cbfe
source: The website was not found in the selected environment. Please select a different environment.
pt_br: O site não foi encontrado no ambiente selecionado. Selecione um ambiente diferente.
zh_cn: 在所选环境中找不到该网站。请选择其他环境。

# ++CODE++6f309003581fafdd78e247cd0fe8b4b7f57ed89a60325b01e6725e8c078f23de
source: The website you selected is different from the local site. Are you sure you want to compare with this website?
pt_br: O site selecionado é diferente do site local. Tem certeza de que deseja comparar com este site?
zh_cn: 所选网站与本地网站不同。确定要与此网站进行比较吗?

# ++CODE++18f3be2933741b96e56b1e1f70818fcba46ec9c5b3dcd0e28d801eab15791d84
source: There was a permissions problem with the server
cs: Na serveru došlo k problému s oprávněními.
es: Se produjo un problema de permisos con el servidor
fr: Problème d’autorisations avec le serveur
it: Si è verificato un problema di autorizzazione con il server
ja: サーバーのアクセス許可に関する問題が発生しました
pt_br: Houve um problema de permissões com o servidor
ru: Возникла проблема с разрешениями на сервере
tr: Sunucuyla ilgili bir izin sorunu yaşandı
zh_cn: 存在服务器权限问题

# ++CODE++51cb4178967d50f62f3e41976c0063aa5f9ab3d1be4cef3a820e59e4baa7a069
source: There was a problem opening the workspace
cs: Při otevírání pracovního prostoru se vyskytl problém.
es: Hubo un problema al abrir el área de trabajo
fr: Un problème s’est produit lors de l’ouverture de l’espace de travail
it: Si è verificato un problema durante l'apertura dell'area di lavoro
ja: ワークスペースを開くときに問題が発生しました
pt_br: Houve um problema ao abrir o espaço de trabalho
ru: При открытии рабочей области возникла проблема
tr: Çalışma alanı açılırken bir sorun oluştu
zh_cn: 打开工作区时出现问题

# ++CODE++37ea190531b914739bf1ff100b3d44579b6d703de0b79b380094714aa3b3c259
source: There’s a problem on the back end
fr: Problème dans le back-end
it: Si è verificato un problema nel back-end
pt_br: Há um problema no back-end
zh_cn: 后端出现问题
