Repository: microsoft/powerplatform-vscode
Catalog: loc/translations-import/vscode-powerplatform.*.xlf
Languages: cs, de, es, fr, it, ja, pt_br, ru, tr, zh_cn

# microsoft.powerplatform.pages.actionsHub.currentActiveSite.revealInOS.mac.title
source: Reveal in Finder
fr: Afficher dans le Finder
it: Rivela nel Finder
pt_br: Revelar no Localizador
zh_cn: 在查找器中显示

source: Run CodeQL Screening
fr: Exécuter le filtrage CodeQL
pt_br: Executar Triagem do CodeQL
zh_cn: 运行 CodeQL 筛选

# microsoft-powerapps-portals.walkthrough.saveConflict.title
source: Save conflict
cs: Konflikt při ukládání
fr: Conflit d’enregistrement
it: Conflitto di salvataggio
ja: 競合の保存
pt_br: Salvar conflito
ru: Сохранить конфликт
tr: Çakışmayı kaydet
zh_cn: 保存冲突

# pacCLI.authPanel.selectAuthProfile.title
source: Select Auth Profile
cs: Vybrat ověřovací profil
de: Authentifizierungsprofil auswählen
es: Seleccionar perfil de autenticación
fr: Sélectionner un profil d’authentification
it: Seleziona profilo autenticazione
ja: 認証プロファイルの選択
pt_br: Selecionar Perfil de Autenticação
ru: Выбор профиля проверки подлинности
tr: Kimlik Doğrulama Profili Seçin
zh_cn: 选择身份验证配置文件

# pacCLI.envAndSolutionsPanel.selectEnvironment.title
source: Select Environment
cs: Vybrat prostředí
fr: Sélectionner un environnement
it: Seleziona ambiente
pt_br: Selecionar Ambiente
ru: Выберите среду
tr: Ortam seçin
zh_cn: 选择环境

# microsoft.powerplatform.pages.actionsHub.showEnvironmentDetails.title
source: Show Environment Details
fr: Afficher les détails de l’environnement
it: Mostra dettagli ambiente
pt_br: Mostrar Detalhes do Ambiente
zh_cn: 显示环境详细信息

# pacCLI.pacAuthHelp.title
source: Show PAC Authentication Help
cs: Zobrazit nápovědu k ověřování PAC
de: Hilfe zur PAC-Authentifizierung anzeigen
es: Mostrar ayuda de autenticación de PAC
fr: Afficher l’aide de l’authentification PAC
it: Mostra la Guida per l'autenticazione PAC
ja: PAC 認証のヘルプを表示する
pt_br: Mostrar Ajuda da Autenticação de PAC
ru: Показать справку по проверке подлинности в PAC
tr: PAC Kimlik Doğrulama Yardımını Göster
zh_cn: 显示 PAC 身份验证帮助

# pacCLI.pacHelp.title
source: Show PAC Help
cs: Zobrazit nápovědu k PAC
de: PAC-Hilfe anzeigen
es: Mostrar ayuda de PAC
fr: Afficher l’aide de PAC
it: Mostra Guida PAC
ja: PAC のヘルプを表示する
pt_br: Mostrar Ajuda de PAC
ru: Показать справку по PAC
tr: PAC Yardımını Göster
zh_cn: 显示 PAC 帮助

# pacCLI.pacPcfHelp.title
source: Show PAC PCF Help
cs: Zobrazit nápovědu k PCF PAC
de: PAC PCF-Hilfe anzeigen
es: Mostrar ayuda de PCF de PAC
fr: Afficher l’aide de PCF PAC
it: Mostra Guida PAC PCF
ja: PAC PCF のヘルプを表示する
pt_br: Mostrar Ajuda de PCF de PAC
ru: Показать справку по PAC PCF
tr: PAC PCF Yardımını Göster
zh_cn: 显示 PAC PCF 帮助

# pacCLI.pacPackageHelp.title
source: Show PAC Package Help
cs: Zobrazit nápovědu k balíčku PAC
de: Hilfe zum PAC-Paket anzeigen
es: Mostrar ayuda del paquete de PAC
fr: Afficher l’aide du package PAC
it: Mostra la Guida del pacchetto PAC
ja: PAC パッケージ のヘルプを表示する
pt_br: Mostrar Ajuda do Pacote de PAC
ru: Показать справку по пакету PAC
tr: PAC Paketi Yardımını Göster
zh_cn: 显示 PAC 包帮助

# pacCLI.pacSolutionHelp.title
source: Show PAC Solution Help
cs: Zobrazit nápovědu k řešení PAC
de: Hilfe zur PAC-Lösung anzeigen
es: Mostrar ayuda de la solución de PAC
fr: Afficher l’aide de la solution PAC
it: Mostra la Guida per la soluzione PAC
ja: PAC ソリューションのヘルプを表示する
pt_br: Mostrar Ajuda da Solução PAC
ru: Показать справку по решению PAC
tr: PAC Çözümü Yardımını Göster
zh_cn: 显示 PAC 解决方案帮助

source: Show a confirmation dialog when comparing with a different website than the local site. Set to false to suppress this confirmation.
pt_br: Mostrar um diálogo de confirmação ao comparar com um site diferente do site local. Defina como falso para suprimir esta confirmação.
zh_cn: 在与不同于本地网站的网站进行比较时，显示确认对话框。设置为 false 以抑制此确认。

# microsoft.powerplatform.pages.actionsHub.siteDetails.title
source: Site Details
fr: Détails du site
it: Dettagli sito
pt_br: Detalhes do Site
zh_cn: 站点详细信息

# microsoft.powerplatform.pages.actionsHub.metadataDiff.sortByName.title
source: Sort by Name
pt_br: Classificar por Nome
zh_cn: 按名称排序

# microsoft.powerplatform.pages.actionsHub.metadataDiff.sortByPath.title
source: Sort by Path
pt_br: Classificar por Caminho
zh_cn: 按路径排序

# microsoft.powerplatform.pages.actionsHub.metadataDiff.sortByStatus.title
source: Sort by Status
pt_br: Classificar por Status
zh_cn: 按状态排序

# microsoft.powerplatform.pages.actionsHub.configuration.downloadSite.description
source: The folder where site will be downloaded when using Power Pages Actions. Leave this empty to ask for a folder every time you download a site.
fr: Dossier dans lequel le site sera téléchargé lors de l’utilisation d’actions Power Pages. Laissez ce champ vide pour demander un dossier à chaque téléchargement d’un site.
it: Cartella in cui verrà scaricato il sito quando si utilizzano le azioni Power Pages. Lascia vuoto questo campo per richiedere una cartella ogni volta che scarichi un sito.
pt_br: A pasta para a qual o site será baixado durante a utilização de Ações do Power Pages. Deixe vazio para solicitar uma pasta sempre que você baixar um site.
zh_cn: 使用 Power Pages 操作时将下载站点的文件夹。如果留空，则每次下载站点时都会要求输入文件夹。

# microsoft.powerplatform.pages.actionsHub.activeSite.uploadSite.title
source: Upload Site
fr: Site de chargement
it: Carica sito
pt_br: Carregar Site
zh_cn: 上传站点

# microsoft.powerplatform.pages.actionsHub.metadataDiff.viewAsList.title
source: View as List
pt_br: Exibir como Lista
zh_cn: 以列表形式查看

# microsoft.powerplatform.pages.actionsHub.metadataDiff.viewAsTree.title
source: View as Tree
pt_br: Exibir como Árvore
zh_cn: 以树状图查看

# microsoft-powerapps-portals.walkthrough.advancedCapabilities.description
source: Visual Studio Code for Web enables editing and publishing of web pages on your website. For a command line interface and more advanced capabilities, install the Power Platform Extension for VS Code, available in the VS Code Marketplace for desktop. [Learn More](command:powerplatform-walkthrough.advancedCapabilities-learn-more) about the difference between Visual Studio Code for desktop and web. [Start coding](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
fr: Visual Studio Code pour le Web permet la modification et la publication de pages web sur votre site web. Pour une interface de ligne de commande et des fonctionnalités plus avancées, installez l’extension Power Platform pour VS Code, disponible sur la Place de marché de VS Code pour le bureau. [En savoir plus](command:powerplatform-walkthrough.advancedCapabilities-learn-more) sur la différence entre Visual Studio Code pour le bureau et pour le Web. [Commencer à coder](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
it: Grazie a Visual Studio Code per il Web, puoi modificare e pubblicare le pagine del tuo sito Web. Per poter usare un'interfaccia della riga di comando e funzionalità più avanzate, installa l'estensione di Power Platform per VS Code, disponibile in VS Code Marketplace per il desktop. [Altre informazioni](command:powerplatform-walkthrough.advancedCapabilities-learn-more) sulla differenze tra Visual Studio Code per il desktop e per il Web. [Inizia a scrivere codice](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
pt_br: O Visual Studio Code para Web permite a edição e a publicação de páginas da Web em seu site. Para obter uma interface de linha de comando e recursos mais avançados, instale a Extensão do Power Platform para VS Code, disponível no Marketplace do VS Code para área de trabalho. [Saiba Mais](command:powerplatform-walkthrough.advancedCapabilities-learn-more) sobre a diferença entre o Visual Studio Code para área de trabalho e a Web. [Comece a programar](command:powerplatform-walkthrough.advancedCapabilities-start-coding)
zh_cn: Visual Studio Code for Web 支持在网站上编辑和发布网页。 对于命令行接口和更高级的功能，请安装适用于VS Code 的 Power Platform 扩展，该扩展在桌面版 VS Code 市场中提供。 [详细了解](command:powerplatform-walkthrough.advancedCapabilities-learn-more)桌面版和 Web 版 Visual Studio Code 之间的区别。 [开始编码](command:powerplatform-walkthrough.advancedCapabilities-start-coding)

# powerPlatform.auth.cloud.description
source: Which Azure Cloud Power Platform Tools should use for authentication.
cs: Cloudové nástroje Power Platform Tools ve službě Azure, které se mají používat k ověřování
fr: Cloud Azure Power Platform Tools à utiliser pour l'authentification.
it: Quali Azure cloud Power Platform Tools utilizzare per l'autenticazione.
ja: 認証で使用するべき Azure クラウド Power Platform Tools を指定します。
pt_br: Quais Power Platform Tools a Nuvem do Azure deve usar para autenticação.
ru: Какие инструменты Power Platform Tools облака Azure следует использовать для проверки подлинности.
tr: Kimlik doğrulaması için kullanılması gereken Azure Bulut Power Platform Tools.
zh_cn: 应使用哪些 Azure 云 Power Platform Tools 来进行身份验证。

# ++CODE++17e4f785a8957503f2cbe34d549c9a4808bcf596614c44414d4a456931982022
source: PAC CLI
pt_br: CLI do PAC

# ++CODE++469a3c89adc4cb4df3a6f0114cd45795248e4e1dcab2546a685e42982b1a22e6
source: Authentication failed. Cannot proceed with site download.
fr: Échec de l’authentification. Impossible de poursuivre le téléchargement du site.

# ++CODE++876831b143507fffa7cbdec8d0d72b9dc328976180b4206c83331911a27d6740
source: CodeQL Analysis
fr: Analyse CodeQL

# ++CODE++60e02fb26e383f47ea262baa6265c7634e9363869eac536dc91ce1264977ccce
source: Downloading Power Pages site using model version {0}...
fr: Téléchargement du site Power Pages à l’aide de la version {0} du modèle...

# ++CODE++9a0318af6b9d6517ef62b7c029a20fda8164d0d717bccbac3c6f926fb6564bd4
source: Downloading Power Pages site, please wait...
fr: Téléchargement du site Power Pages. Veuillez patienter...

# ++CODE++6bba2e23a239b42ce9624ffd5bb2c56f483a7975ecaf2e872a8fe3aa9006b818
source: Environment ID is required but not provided
fr: L’ID d’environnement est obligatoire, mais il n’est pas fourni

# ++CODE++b74986ed2b0cdaef84e06b7f230e13c42308a76ea6445d0cf9b0319d01ea7f74
source: Error switching environment: {0}
fr: Erreur lors du changement d’environnement : {0}

# ++CODE++f14378498d13f7345aec709c662e475e8cd16b8c4bda8ed0009fa62f413726aa
source: Failed to download site: {0}
fr: Échec du téléchargement du site : {0}

# ++CODE++1431fc40490dda7265400636e401674fe94e75224aa179af9ce1cded2a155808
source: Failed to switch to the required environment.
fr: Échec du basculement vers l’environnement requis.

# ++CODE++3f4dec2f1d73d14fdcb63e9a2da87892f19450b714ec81b6db45d1e0bdd25f02
source: Get Extension
fr: Obtenir l’extension

# ++CODE++43fda167d567df5f43ec87655e1d27557664874f1f804387174027f5e8e2e602
source: Organization URL is required but not provided
fr: L’URL de l’organisation est obligatoire, mais elle n’est pas fournie

# ++CODE++e019497156f9ccd01e4c4fa2cb01c31e293460acdf116949dc29680e64660de5
source: Preparing to download Power Pages site...
fr: Préparation du téléchargement du site Power Pages...

# ++CODE++5e297c22bc5c0423614ebe6e20c7fb26fc01c43d3d5cbcdcce15dab605384e13
source: Processing download request...
fr: Traitement de la demande de téléchargement...

# ++CODE++64c2870068032d4e5c46e710ba9422633c8f8228527d59b27f449fdf55216bb6
source: Website ID is required but not provided
fr: L’ID de site web est obligatoire, mais pas fourni

# ++CODE++6f6ff1fc17821e030a88681092957c279c6a5b1177f940017a4c5fd99fd1ea7b
source: Copilot is not available. Please contact your administrator.
cs: Copilot není dostupný. Obraťte se na správce.

# ++CODE++e9f79ac902b11087dd0d34e8afc1de54df4e48d45861a0c0b6e4edd3c204f314
source: Display Name: {0} Unique Name: {1} Version: {2} Type: {3}
cs: Zobrazované jméno: {0} Jedinečné jméno: {1} Verze: {2} Typ: {3}
ja: 表示名: {0} 一意の名前: {1} バージョン: {2} 種類: {3}
ru: Отображаемая имя: {0} Уникальное имя: {1} Версия: {2} Тип: {3}
tr: Görünen Ad: {0} Benzersiz Ad: {1} Sürüm: {2} Tür: {3}

# ++CODE++61dd014ff85ae4c042dbfd3b581668ee350e515d4abbf0d682df335b22bf703a
source: Hi! Power Pages lets you build secure, professional websites that you can quickly configure and publish across web browsers and devices. To create your website, visit the [Power Pages](https://powerpages.microsoft.com/). Return to this chat and @powerpages can help you write and edit your website code.
cs: Zdravím! Power Pages umožňuje vytvářet bezpečné profesionální weby, které můžete rychle nakonfigurovat a publikovat pro různé webové prohlížeče a zařízení. Chcete-li vytvořit svůj web, navštivte adresu [Power Pages](https://powerpages.microsoft.com/) . Vraťte se do tohoto chatu a @powerpages vám pomůže napsat a upravit kód vašeho webu.

# ++CODE++1d9bc50f05b58d430726840f771cd25056be57873eb33a5d6aeedfff2ca7e2db
source: Hi! Your Microsoft account doesnâ€™t currently support Copilot. Contact your admin for details.
cs: Dobrý den! Váš účet Microsoft aktuálně nepodporuje Copilota. Podrobnosti vám sdělí správce.

# ++CODE++1be32f89a3d1d98bb7011850e83b5753124d58f684bae063674bfdb106026e6d
source: Make sure AI-generated content is accurate and appropriate before using. <a href="https://go.microsoft.com/fwlink/?linkid=2240145">Learn more</a> | <a href="https://go.microsoft.com/fwlink/?linkid=2189520">View terms</a>
cs: Před použitím obsahu vygenerovaného umělou inteligencí se ujistěte, že je přesný a vhodný. <a href="https://go.microsoft.com/fwlink/?linkid=2240145">Další informace</a> | <a href="https://go.microsoft.com/fwlink/?linkid=2189520">Zobrazit podmínky</a>

# ++CODE++7fcd8b1c5225f7d9a771a4a02ca3e4795c3c9202cf2b3c3c879c625abb8b43e4
source: Microsoft wants your feeback
cs: Microsoft chce znát váš názor
es: Microsoft quiere conocer sus comentarios
ja: Microsoft にご意見をお寄せください
ru: Корпорацию Майкрософт интересует ваше мнение
tr: Microsoft geri bildiriminizi almak istiyor

# ++CODE++ebff96df55032b8c41dd4e275bc8df4d2c16c8fc18f36bd4c79cfa8a5de2d335
source: Name: {0} URL: {1} Environment ID: {2} Organization ID: {3}
cs: Název: {0} Adresa URL: {1} ID prostředí: {2} Kód organizace: {3}
es: Nombre: {0} URL: {1} Id. de entorno: {2} Id. de organización: {3}
ja: 名前: {0} URL: {1} 環境 ID: {2} 組織 ID: {3}
ru: Имя: {0} URL-адрес: {1} ИД среды: {2} ИД организации: {3}
tr: Ad: {0} URL: {1} Ortam Kimliği: {2} Kuruluş Kimliği: {3}

# ++CODE++f190e8061b8cbadd991ff217210525eff0000a8c6ddc2d44baec8388b7bd1a3e
source: Preview site URL is not available
cs: Adresa URL náhledu webu není k dispozici.

# ++CODE++189f24adc299ea91ceab21d8100a58d89294ed17395c4e4dbc4733c9b92543df
source: Something went wrong. Donâ€™t worry, you can try again.
cs: Došlo k nějakému problému. Nemějte obavy, můžete to zkusit znovu.

# ++CODE++37ea190531b914739bf1ff100b3d44579b6d703de0b79b380094714aa3b3c259
source: Thereâ€™s a problem on the back end
cs: U back-endu se vyskytl problém.
es: Hay un problema en el back-end
ja: バック エンドに問題があります
ru: Возникла проблема на сервере
tr: Arka uçta bir sorun oluştu

# ++CODE++6f65376f47dd6d9867102ea8c57d776161ac941091f2a9d52fdd4c8228575e7b
source: Whether itâ€™s HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.
cs: Stačí popsat, co potřebujete, a umělá inteligence za vás vytvoří kód v jazyce HTML, CSS, JS nebo Liquid.

# microsoft-powerapps-portals.walkthrough.saveConflict.description
source: Avoid accidental overwrites when you try to save outdated code in VS Code for the Web. You can compare the changes side-by-side and decide to accept or revert the changes. To learn more, visit [Prevent accidental overwrites](command:powerplatform-walkthrough.saveConflict-learn-more).
cs: Vyhněte se náhodným přepisům při pokusu o uložení zastaralého kódu v editoru VS Code pro web. Změny můžete porovnat vedle sebe a rozhodnout, zda je přijmete, nebo vrátíte zpět. Další informace najdete v článku, který popisuje, jak se [vyhnout náhodným přepisům](command:powerplatform-walkthrough.saveConflict-learn-more).
ja: Web 版 VS Code で過去のコードを保存する際に、意図しない上書きを回避します。変更を並べて比較し、変更を適用するか元に戻すかを決定できます。 詳細については [意図しない上書きを防ぐ](command:powerplatform-walkthrough.saveConflict-learn-more) を参照してください。
ru: Веб-версия VS Code позволяет избежать случайной перезаписи при сохранении устаревшего кода. Вы можете сравнить изменения и принять или отклонить их. Дополнительные сведения см. в разделе [Как избежать случайной перезаписи](command:powerplatform-walkthrough.saveConflict-learn-more).
tr: Web için VS Code'da eski kodu kaydetmeye çalıştığınızda yanlışlıkla üzerine yazmaktan kaçının. Değişiklikleri yan yana karşılaştırabilir ve değişiklikleri kabul etmeye veya geri almaya karar verebilirsiniz. Daha fazla bilgi edinmek için [Yanlışlıkla üzerine yazılmasını önleme](command:powerplatform-walkthrough.saveConflict-learn-more) bölümüne bakın.

# microsoft-powerapps-portals.walkthrough.fileSystem.description
source: Find your page files organized in folders under your site name. All your pages are arranged into HTML, CSS, and JS files within the respective site component folders. You can find site components like forms, content snippets, lists, and more to edit. To learn more, visit [Power Pages file structure in VS Code](command:powerplatform-walkthrough.fileSystem-documentation). [Visit site folder](command:powerplatform-walkthrough.fileSystem-open-folder)
cs: Soubory stránek jsou umístěny ve složkách pod názvem webu. Všechny stránky jsou uspořádané do souborů HTML, CSS a JS ve složkách příslušných komponent webu. Komponenty webu, jako jsou formuláře, fragmenty obsahu, seznamy a další, lze upravit. Další informace popisuje článek věnovaný [struktuře souborů Power Pages v editoru VS Code](command:powerplatform-walkthrough.fileSystem-documentation). [Přejít do složky webu](command:powerplatform-walkthrough.fileSystem-open-folder)
ja: サイト名配下のフォルダーに整理されたページ ファイルを見つけます。それぞれのサイト コンポーネント フォルダーが含む HTML、CSS、JS の各ファイルに、すべてのページが配置されます。 ここにはフォーム、コンテンツ スニペット、リストなど、編集するべきサイト コンポーネントが存在します。 詳細については [VS Code の Power Pages ファイル構造](command:powerplatform-walkthrough.fileSystem-documentation) を参照してください。 [サイトのフォルダーに移動する](command:powerplatform-walkthrough.fileSystem-open-folder)
ru: Файлы страниц в форматах HTML, CSS и JS распределяются по подпапкам внутри папки с именем сайта. Вы можете редактировать такие компоненты сайта, как формы, фрагменты содержимого, списки и т. д. Дополнительные сведения см. в разделе [Структура файлов Power Pages в VS Code](command:powerplatform-walkthrough.fileSystem-documentation). [Открыть папку сайта](command:powerplatform-walkthrough.fileSystem-open-folder)
tr: Site adınız altındaki klasörlerde düzenlenmiş sayfa dosyalarınızı bulun. Tüm sayfalarınız, ilgili site bileşeni klasörleri içinde HTML, CSS ve JS dosyaları olarak düzenlenir. Düzenlenecek formlar, içerik kod parçacıkları, listeler ve daha birçok site bileşeni bulabilirsiniz. Daha fazla bilgi edinmek için [VS Code'da Power Pages dosya yapısı](command:powerplatform-walkthrough.fileSystem-documentation) bölümüne bakın. [Site klasörüne bakın](command:powerplatform-walkthrough.fileSystem-open-folder)

# pacCLI.authPanel.welcome.whenInteractiveNotSupported
source: No auth profiles found on this computer. Interactive Authentication is not availalbe for remote scenarios; auth profiles must be created by the command line. The `--deviceCode` flow must be used for users with MFA requirements, or whose tenants use ADFS. [View Auth Profile Help](command:pacCLI.pacAuthHelp)
cs: V tomto počítači nebyly nalezeny žádné ověřovací profily. Interaktivní ověřování není dostupné pro vzdálené scénáře; ověřovací profily musí být vytvořeny pomocí příkazového řádku. Tok --deviceCode se musí použít pro uživatele s požadavky na vícefaktorové ověřování (MFA) nebo na ty, jejichž tenanty používají ADFS. [Zobrazit nápovědu k ověřovacímu profilu](command:pacCLI.pacAuthHelp)
de: Auf diesem Computer wurden keine Authentifizierungsprofile gefunden. Die interaktive Authentifizierung ist für Remoteszenarien nicht verfügbar. Authentifizierungsprofile müssen mithilfe der Befehlszeile erstellt werden. Der Flow `--deviceCode` muss für Benutzer mit MFA-Anforderungen oder falls deren Mandanten ADFS nutzen, verwendet werden. [Hilfe zum Authentifizierungsprofil anzeigen](command:pacCLI.pacAuthHelp)
es: No se han encontrado perfiles de autenticación en este equipo. La autenticación interactiva no está disponible en escenarios remotos; los perfiles de autenticación deben crearse desde la línea de comandos. Se debe usar el flujo "--deviceCode" para los usuarios que tengan requisitos de MFA o cuyos inquilinos utilicen ADFS. [Ver ayuda de los perfiles de autenticación](command:pacCLI.pacAuthHelp)
ja: このコンピューターには認証プロファイルが見つかりません。 対話型認証をリモート シナリオで使用できません。認証プロファイルをコマンド ラインで作成する必要があります。`--deviceCode` フローは、MFA 要件を満たすユーザー、またはテナントが ADFS を使用するユーザーに対して使用する必要があります。 [認証プロファイルのヘルプを表示](command:pacCLI.pacAuthHelp)
ru: На компьютере не найдены профили проверки подлинности. Интерактивная проверка подлинности недоступна для удаленных сценариев; необходимо создать профили проверки подлинности с помощью командной строки. Для пользователей, которым требуется MFA или клиенты которых используют AD FS, необходимо использовать поток --deviceCode. [Смотреть справку по профилям проверки подлинности](command:pacCLI.pacAuthHelp)
tr: Bu bilgisayarda hiçbir kimlik doğrulama profili bulunamadı. Uzaktan senaryolar için Etkileşimli Kimlik Doğrulaması kullanılamaz; kimlik doğrulama profilleri komut satırı ile oluşturulmalıdır. MFA gereksinimleri olan veya kiracıları ADFS kullanan kullanıcılar için "--deviceCode" akışı kullanılmalıdır. [Kimlik Doğrulama Profili Yardımını Görüntüle](command:pacCLI.pacAuthHelp)

# pacCLI.authPanel.welcome.whenInteractiveSupported
source: No auth profiles found on this computer. [Add Auth Profile](command:pacCLI.authPanel.newAuthProfile)
cs: V tomto počítači nebyly nalezeny žádné ověřovací profily. [Přidat ověřovací profil](command:pacCLI.authPanel.newAuthProfile)
de: Auf diesem Computer wurden keine Authentifizierungsprofile gefunden. [Authentifizierungsprofil hinzufügen](command:pacCLI.authPanel.newAuthProfile)
es: No se han encontrado perfiles de autenticación en este equipo. [Agregar perfil de autenticación](command:pacCLI.authPanel.newAuthProfile)
ja: このコンピューターには認証プロファイルが見つかりません。 [認証プロファイルを追加](command:pacCLI.authPanel.newAuthProfile)
ru: На компьютере не найдены профили проверки подлинности. [Добавить профиль проверки подлинности](command:pacCLI.authPanel.newAuthProfile)
tr: Bu bilgisayarda hiçbir kimlik doğrulama profili bulunamadı. [Kimlik Doğrulama Profili Ekle](command:pacCLI.authPanel.newAuthProfile)

# microsoft-powerapps-portals.walkthrough.overview.description
source: Now easily edit code of your Power Pages site. Access code from supported site components like forms, content snippets, lists, and more from within Visual Studio Code. To learn more, visit [Edit Power Pages code in VS Code](command:powerplatform-walkthrough.overview-learn-more).
cs: Nyní můžete kód webu Power Pages snadno upravit. Ke kódu podporovaných komponent webu, jako jsou formuláře, fragmenty obsahu, seznamy a další, získáte přístup z editoru Visual Studio Code. Další informace najdete v článku věnovaném [úpravě kódu Power Pages v editoru VS Code](command:powerplatform-walkthrough.overview-learn-more).
ja: Power Pages サイトのコードを簡単に編集できます。フォーム、コンテンツ スニペット、リストなど、対応しているサイト コンポーネントのコードに、Visual Studio Code からアクセスします。 詳細については [VS Code で Power Pages のコードを編集する](command:powerplatform-walkthrough.overview-learn-more) を参照してください。
ru: Вы можете редактировать код сайта Power Pages в Visual Studio Code. Вам доступны такие компоненты сайта, как формы, фрагменты содержимого, списки и т. д. Дополнительные сведения см. в разделе [Редактирование кода Power Pages в VS Code](command:powerplatform-walkthrough.overview-learn-more).
tr: Artık Power Pages sitenizin kodunu kolayca düzenleyebilirsiniz. Visual Studio Code içinde formlar, içerik kod parçacıkları, listeler ve daha birçok desteklenen site bileşeninden koda erişin. Daha fazla bilgi edinmek için [VS Code'da Power Pages kodunu düzenleme](command:powerplatform-walkthrough.overview-learn-more) bölümüne bakın.
