{
  " End of Code Block ": " Fin del bloque de c贸digo ",
  "@PowerPages is not yet available in your region.": "@PowerPages a煤n no est谩 disponible en su regi贸n.",
  "A content snippet with the same name already exists. Please enter a different name.": "Ya existe un fragmento de contenido con el mismo nombre. Especifique otro nombre.",
  "A page template with the same name already exists. Please enter a different name.": "Ya existe una plantilla de p谩gina con el mismo nombre. Especifique otro nombre.",
  "A webpage with the same name already exists. Please enter a different name.": "Ya existe una p谩gina web con el mismo nombre. Especifique otro nombre.",
  "A webtemplate with the same name already exists. Please enter a different name.": "Ya existe una plantilla web con el mismo nombre. Especifique otro nombre.",
  "AI features have been disabled by your organization. Contact your admin for details. [Learn more](https://go.microsoft.com/fwlink/?linkid=2285848)": "Su organizaci贸n ha deshabilitado las caracter铆sticas de IA. P贸ngase en contacto con el administrador para obtener m谩s informaci贸n. [M谩s informaci贸n](https://go.microsoft.com/fwlink/?linkid=2285848)",
  "AI-generated content can contain mistakes": "El contenido generado por IA puede contener errores",
  "Accounts don't match, data may not load.": "Las cuentas no coinciden, es posible que los datos no se carguen.",
  "Activating CodeQL extension...": "Activando la extensi贸n CodeQL...",
  "Activating SARIF viewer extension...": "Activando la extensi贸n del visor SARIF...",
  "Active Sites": "Sitios activos",
  "Active auth profile is not found or has expired. Please try again.": "El perfil de autenticaci贸n activo no se encuentra o ha expirado. Vuelva a intentarlo.",
  "Active auth profile is not found or has expired. To create a new auth profile, enter the environment URL.": "El perfil de autenticaci贸n activo no se encuentra o ha expirado. Para crear un nuevo perfil de autenticaci贸n, introduzca la direcci贸n URL del entorno.",
  "Add content snippet name (name should be unique)": "Agregar el nombre del fragmento de contenido (el nombre debe ser 煤nico)",
  "Added default query suite to config: {0}": "Se agreg贸 un conjunto de consultas predeterminado a la configuraci贸n: {0}",
  "Adding {0} web file(s). Existing files will be skipped/{0} represents the number of web files": "Agregando {0} archivos web. Se omitir谩n los archivos existentes",
  "Analysis complete! Results saved to: {0}": "隆An谩lisis completo! Resultados guardados en: {0}",
  "Analysis completed using query suite: {0}": "An谩lisis completado con el conjunto de consultas: {0}",
  "Are you sure you want to clear all the Auth Profiles?": "驴Seguro que desea borrar todos los perfiles de autenticaci贸n?",
  "Are you sure you want to delete the Auth Profile {0}-{1}?/{0} is the user name, {1} is the URL of environment of the auth profile": "驴Seguro que desea eliminar el perfil de autenticaci贸n {0}-{1}?",
  "Arrow icon": "Icono de flecha",
  "Authenticating...": "Autenticando...",
  "Authentication failed. Cannot proceed with site download.": "Error de autenticaci贸n. No se puede continuar con la descarga del sitio.",
  "Authentication failed. Please login and try again.": "No se pudo autenticar. Inicie sesi贸n y vuelva a intentarlo.",
  "Authentication failed. Please try again.": "Error de autenticaci贸n. Int茅ntelo de nuevo.",
  "Authorization Failed. Please run again to authorize it": "No se pudo autorizar. Vuelva a ejecutarla para autorizarla",
  "Be careful making changes. Anyone can see the changes you make immediately. Choose Edit the site to make edits, or close the editor tab to cancel without editing.": "Tenga cuidado al hacer cambios. Cualquier usuario puede ver inmediatamente los cambios que usted realice. Elija Editar el sitio para realizar cambios o cierre la pesta帽a del editor para cancelar sin hacer cambios.",
  "Be careful when you're updating public sites. The changes you make are visible to anyone immediately. Do you want to continue?": "Tenga cuidado cuando actualice sitios p煤blicos. Los cambios que realice ser谩n visibles para cualquier persona inmediatamente. 驴Desea continuar?",
  "Browse...": "Examinar...",
  "Cancel": "Cancelar",
  "Cannot install Power Pages generator. Please install npm and try again./Do not translate 'npm'": "No se puede instalar el generador de Power Pages. Instale npm y vuelva a intentarlo.",
  "Cannot install Power Pages generator: {0}/{0} represents the error message returned from the exception": "No se puede instalar el generador de Power Pages: {0}",
  "Cannot install pac CLI: {0}/{0} represents the error message returned from the exception": "No se puede instalar pac CLI: {0}",
  "Changing environment...": "Cambiando entorno...",
  "Check the URL and verify the parameters are correct": "Compruebe la direcci贸n URL y aseg煤rese de que los par谩metros sean correctos",
  "Checking for active auth profile...": "Buscando un perfil de autenticaci贸n activo...",
  "Choose page template": "Elegir plantilla de p谩gina",
  "Choose parent page": "Elegir p谩gina primaria",
  "Choose web template": "Elegir plantilla web",
  "Clearing cache. See [details](https://aka.ms/pages-clear-cache)./This is a markdown formatting which must persist across translations.The second line should be '[TRANSLATION HERE](https://aka.ms/pages-clear-cache).', keeping brackets and the text in the parentheses unmodified": "Borrando cach茅. Consulte [detalles](https://aka.ms/pages-clear-cache).",
  "Click to authenticate with a matching account": "Haga clic para autenticarse con una cuenta coincidente",
  "Close": "Cerrar",
  "Cloud Instance: {0}/The {0} represents profile's Azure Cloud Instances": "Instancia en la nube: {0}",
  "Cluster category: {0}/{0} is the Cluster category": "Categor铆a de cl煤ster: {0}",
  "Cluster environment: {0}/{0} is the Cluster environment": "Entorno de cl煤ster: {0}",
  "Cluster geo name: {0}/{0} is the cluster geo name": "Nombre de geo谩rea del cl煤ster: {0}",
  "Code Block ": "Bloque de c贸digo ",
  "CodeQL Analysis": "An谩lisis de CodeQL",
  "CodeQL CLI is not installed or not in PATH. Please install the CodeQL extension or add CodeQL CLI to your PATH.": "La CLI de CodeQL no est谩 instalada o no est谩 en PATH. Instale la extensi贸n CodeQL o agregue la CLI de CodeQL a su RUTA.",
  "CodeQL analysis completed successfully with no issues found! ": "隆El an谩lisis de CodeQL se complet贸 con 茅xito sin encontrar problemas! ",
  "CodeQL analysis completed. Would you like to open the full results file?": "An谩lisis de CodeQL completado. 驴Desea abrir el archivo de resultados completo?",
  "CodeQL analysis failed: {0}": "Error en el an谩lisis de CodeQL: {0}",
  "CodeQL database created successfully. You can now run queries from the CodeQL extension.": "La base de datos CodeQL se cre贸 correctamente. Ahora puede ejecutar consultas desde la extensi贸n CodeQL.",
  "CodeQL database created. You can now:\n\n1. Run custom queries if you have any\n2. Use the prebuilt queries from the CodeQL extension\n\nCheck the CodeQL extension panel for available queries.": "Base de datos de CodeQL creada. Ahora puede:\n\n1. Ejecutar consultas personalizadas si tiene alguna\n2. Usar las consultas predefinidas de la extensi贸n CodeQL\n\nConsulte el panel de la extensi贸n CodeQL para ver las consultas disponibles.",
  "CodeQL extension is not installed.": "La extensi贸n CodeQL no est谩 instalada.",
  "CodeQL global storage path does not exist: {0}": "La ruta de almacenamiento global de CodeQL no existe: {0}",
  "CodeQL screening failed. Please try again later.": "Error en la verificaci贸n con CodeQL. Int茅ntelo de nuevo m谩s tarde.",
  "CodeQL screening is not supported for this site.": "La verificaci贸n con CodeQL no es compatible con este sitio.",
  "CodeQL screening started. Creating database and analyzing": "Comenz贸 la verificaci贸n con CodeQL. Creando base de datos y analizando",
  "CodeQL version: {0}": "Versi贸n de CodeQL: {0}",
  "Command completed successfully (exit code: {0})": "El comando se complet贸 correctamente (c贸digo de salida: {0})",
  "Command failed with exit code {0}: {1}": "Error en el comando con el c贸digo de salida {0}: {1}",
  "Command failed with exit code: {0}": "Error en el comando con el c贸digo de salida: {0}",
  "Confirm": "Confirmar",
  "Continue with Copilot for Power Pages": "Continuar con Copilot para Power Pages",
  "Copied to clipboard!": "Copiado al portapapeles.",
  "Copilot Response": "Respuesta de Copilot",
  "Copilot illustration": "Ilustraci贸n de Copilot",
  "Copy to clipboard": "Copiar al Portapapeles",
  "Could not determine user data path.": "No se pudo determinar la ruta de datos del usuario.",
  "Could not locate CodeQL CLI in global storage.": "No se pudo encontrar la CLI de CodeQL en el almacenamiento global.",
  "Created PowerPages config file at {0} with default query suite: {1}": "Archivo de configuraci贸n de PowerPages creado en {0} con el conjunto de consultas predeterminado: {1}",
  "Created on: {0}/{0} is the created date": "Fecha de creaci贸n: {0}",
  "Creating CodeQL database...": "Creaci贸n de una base de datos CodeQL...",
  "Creating {0}.../{0} will be replaced by the entity type.": "Creando {0}...",
  "Creator: {0}/{0} is the creator": "Creador: {0}",
  "Current": "Actual",
  "Current site path not found.": "No se encontr贸 la ruta de acceso del sitio actual.",
  "Current site path not found. Please ensure you have a site folder open.": "No se encontr贸 la ruta de acceso del sitio actual. Aseg煤rese de tener abierta una carpeta del sitio.",
  "Data model version: {0}/{0} is the data model version": "Versi贸n del modelo de datos: {0}",
  "Database location: {0}": "Ubicaci贸n de la base de datos: {0}",
  "Default Environment: {0}/The {0} represents profile's resource/environment URL": "Entorno predeterminado: {0}",
  "Dislike something? Tell us more.": "驴Hay algo que no le guste? Cu茅ntenos m谩s.",
  "Display Name: {0}\nUnique Name: {1}\nVersion: {2}\nType: {3}/This is a multi-line tooltipThe {0} represents Solution's Friendly / Display nameThe {1} represents Solution's unique nameThe {2} represents Solution's Version numberThe {3} represents Solution's Type (Managed or Unmanaged), but that test is localized separately.": "Nombre para mostrar: {0}\nNombre 煤nico: {1}\nVersi贸n: {2}\nTipo: {3}",
  "Do not show again": "No volver a mostrar",
  "Download Power Pages Site": "Descargar sitio de Power Pages",
  "Download VS Code": "Descargar VS Code",
  "Downloading Power Pages site using model version {0}...": "Descargando el sitio de Power Pages con la versi贸n del modelo {0}...",
  "Downloading Power Pages site, please wait...": "Descargando el sitio de Power Pages, espere...",
  "Edit the site": "Editar el sitio",
  "Enter Organization ID": "Escriba el id. de organizaci贸n",
  "Enter name": "Escribir nombre",
  "Enter the environment URL": "Escribir la URL del entorno",
  "Enter the name of the web template": "Escriba el nombre de la plantilla web",
  "Environment ID is not available": "El id. de entorno no est谩 disponible",
  "Environment ID is required but not provided": "El id. de entorno es obligatorio, pero no se proporciona",
  "Environment ID: {0}/{0} is the Environment ID": "Id. de entorno: {0}",
  "Environment changed successfully.": "Se ha cambiado el entorno correctamente.",
  "Error accessing CodeQL extension: {0}": "Error al acceder a la extensi贸n CodeQL: {0}",
  "Error creating config file: {0}": "Error al crear el archivo de configuraci贸n: {0}",
  "Error during CodeQL analysis: {0}": "Error durante el an谩lisis de CodeQL: {0}",
  "Error getting CLI path from extension API: {0}": "Error al obtener la ruta de la CLI desde la API de extensi贸n: {0}",
  "Error opening results file: {0}": "Error al abrir el archivo de resultados: {0}",
  "Error opening with SARIF viewer: {0}": "Error al abrir con SARIF Viewer: {0}",
  "Error reading config file: {0}": "Error al leer el archivo de configuraci贸n: {0}",
  "Error reading results: {0}": "Error al leer los resultados: {0}",
  "Error searching for CodeQL CLI: {0}": "Error al buscar la CLI de CodeQL: {0}",
  "Error switching environment: {0}": "Error al cambiar de entorno: {0}",
  "Error updating config file: {0}": "Error al actualizar el archivo de configuraci贸n: {0}",
  "Executing: {0}": "Ejecutando: {0}",
  "Explain the following code snippet:": "Explique el siguiente fragmento de c贸digo:",
  "Explain the following code {% include 'Page Copy'%}": "Explicar el siguiente c贸digo {% include 'Page Copy'%}",
  "Extension installed but API not available yet. Opening as text file...": "Extensi贸n instalada, pero la API a煤n no est谩 disponible. Abriendo como archivo de texto...",
  "Failed to create a new Power Pages site. Please try again.": "No se pudo crear un sitio nuevo de Power Pages. Vuelva a intentarlo.",
  "Failed to create: {0}./{0} will be replaced by the error message.": "No se pudo crear: {0}.",
  "Failed to disable PAC telemetry.": "No se pudo deshabilitar la telemetr铆a de PAC.",
  "Failed to download site: {0}": "No se pudo descargar el sitio: {0}",
  "Failed to enable PAC telemetry.": "No se pudo habilitar la telemetr铆a de PAC.",
  "Failed to fetch some files.": "No se pudieron capturar algunos archivos.",
  "Failed to generate VS Code Desktop URL: {0}": "No se pudo generar la URL de VS Code Desktop: {0}",
  "Failed to get file ready for edit: {0}": "No se pudo preparar el archivo para su edici贸n: {0}",
  "Failed to get organization details. Please try again later": "No se pudieron obtener los detalles de la organizaci贸n. Vuelva a intentarlo m谩s tarde",
  "Failed to get website endpoint. Please try again later": "No se pudo obtener el punto de conexi贸n de sitio web. Vuelva a intentarlo m谩s tarde",
  "Failed to handle Power Pages URI: {0}": "No se pudo controlar el URI de Power Pages: {0}",
  "Failed to install SARIF viewer extension. Opening results as text file.": "No se pudo instalar la extensi贸n del visor SARIF. Abriendo los resultados como archivo de texto.",
  "Failed to install SARIF viewer extension: {0}": "No se pudo instalar la extensi贸n SARIF Viewer: {0}",
  "Failed to open in VS Code Desktop: {0}": "No se pudo abrir en VS Code Desktop: {0}",
  "Failed to switch to the required environment.": "No se pudo cambiar al entorno requerido.",
  "Feature is not enabled for this geo.": "La caracter铆stica no est谩 habilitada para esta geo谩rea.",
  "Feedback": "Comentarios",
  "Fetching your file ...": "Capturando su archivo...",
  "File might be referenced by name {0} here./{0} represents the name of the file": "Se puede hacer referencia al archivo por su nombre {0} aqu铆.",
  "File(s) already exist. No new files to add": "Los archivos ya existen. No hay archivos nuevos que agregar",
  "File: {0}": "Archivo: {0}",
  "Found CodeQL CLI at: {0}": "Se encontr贸 la CLI de CodeQL en: {0}",
  "Found CodeQL CLI via extension API: {0}": "Se encontr贸 la CLI de CodeQL a trav茅s de la API de extensi贸n: {0}",
  "Found PowerPages config file: {0}": "Archivo de configuraci贸n de PowerPages encontrado: {0}",
  "Found distribution directories: {0}": "Directorios de distribuci贸n encontrados: {0}",
  "Found {0} issue(s):": "{0} problema(s) encontrado(s):",
  "Friendly name: {0}/{0} is the website name": "Nombre descriptivo: {0}",
  "GETTING STARTED": "INTRODUCCIN",
  "Generating a new Power Pages site...": "Generando un sitio nuevo de Power Pages...",
  "Generating webpages...": "Generando p谩ginas web...",
  "Get Extension": "Obtener extensi贸n",
  "Get GitHub Copilot to try @powerpages": "Hacer que GitHub Copilot pruebe @powerpages",
  "Getting organization details...": "Obteniendo detalles de la organizaci贸n...",
  "Getting region information...": "Obteniendo informaci贸n de la regi贸n...",
  "Getting website endpoint...": "Obteniendo punto de conexi贸n de sitio web...",
  "Here are a few suggestions to get you started": "Aqu铆 le presentamos algunas sugerencias para empezar",
  "Hi": "Hola",
  "Hi! @powerpages can help you write, edit, and even summarize your website code.": "隆Hola! @powerpages puede ayudarle a escribir, editar e incluso resumir el c贸digo de su sitio web.",
  "Hi! Instantly generate code for Power Pages sites by typing in what you need. To start using Copilot, log in to your Microsoft account.": "隆Hola! Genere al instante c贸digo para sitios de Power Pages escribiendo lo que necesita. Para empezar a usar Copilot, inicie sesi贸n en su cuenta Microsoft.",
  "Hi! Power Pages lets you build secure, professional websites that you can quickly configure and publish across web browsers and devices.\n\nTo create your website, visit the [Power Pages](https://powerpages.microsoft.com/).\nReturn to this chat and @powerpages can help you write and edit your website code.": "Hola: Power Pages le permite crear sitios web seguros y profesionales que puede configurar y publicar r谩pidamente en exploradores web y dispositivos.\n\nPara crear su sitio web, visite [Power Pages](https://powerpages.microsoft.com/).\nVuelve a este chat y @powerpages puede ayudarle a escribir y editar el c贸digo de su sitio web.",
  "Hi! Your Microsoft account doesnt currently support Copilot. Contact your admin for details.": "Hola: Su cuenta de Microsoft no es compatible actualmente con Copilot. P贸ngase en contacto con su administrador para obtener m谩s informaci贸n.",
  "In your own words, describe what you need. You can get help with writing code for Power Pages sites in HTML, CSS, and JS languages.": "Describa con sus propias palabras lo que necesita. Puede obtener ayuda con la escritura de c贸digo para sitios de Power Pages en los lenguajes HTML, CSS y JS.",
  "Inactive Sites": "Sitios inactivos",
  "Initializing site preview": "Inicializando la vista previa del sitio",
  "Initializing site preview. Please try again after few seconds.": "Inicializando la vista previa del sitio. Vuelva a intentarlo despu茅s de unos segundos.",
  "Insert code into editor": "Insertar c贸digo en el editor",
  "Install": "Instalar",
  "Installing Power Pages generator(v{0}).../{0} represents the version number": "Instalando el generador de Power Pages (v{0})...",
  "Installing SARIF viewer extension...": "Instalando la extensi贸n del visor SARIF...",
  "Instance url: {0}/{0} is the Instance Url": "Direcci贸n URL de la instancia: {0}",
  "Learn more about Copilot": "M谩s informaci贸n sobre Copilot",
  "Let Copilot help you code": "Deje que Copilot le ayude a programar",
  "Like something? Tell us more.": "驴Hay algo que le guste? Cu茅ntenos m谩s.",
  "Line: {0}": "L铆nea: {0}",
  "Login": "Inicio de sesi贸n",
  "Login to PowerPages": "Iniciar sesi贸n en PowerPages",
  "Looking for CodeQL CLI in: {0}": "Buscando la CLI de CodeQL en: {0}",
  "Make sure AI-generated content is accurate and appropriate before using. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Learn more</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">View\n              terms</a>": "Aseg煤rese de que el contenido generado por IA sea preciso y apropiado antes de usarlo. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">M谩s informaci贸n</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">Ver\n              t茅rminos y condiciones</a>",
  "Make sure AI-generated content is accurate and appropriate before using. [Learn more](https://go.microsoft.com/fwlink/?linkid=2240145) | [View terms](https://go.microsoft.com/fwlink/?linkid=2189520)": "Aseg煤rese de que el contenido generado por IA sea preciso y adecuado antes de usarlo. [M谩s informaci贸n](https://go.microsoft.com/fwlink/?linkid=2240145) | [Ver t茅rminos](https://go.microsoft.com/fwlink/?linkid=2189520)",
  "Managed": "Administrado",
  "Maximum 30 characters allowed": "Se permite un m谩ximo de 30 caracteres",
  "Microsoft wants your feedback": "Microsoft desea recibir sus comentarios",
  "Missing required site information for reactivation.": "Falta informaci贸n del sitio necesaria para la reactivaci贸n.",
  "NEW": "NUEVO",
  "Name/Rename Auth Profile": "Asignar nombre/Cambiar nombre del perfil de autenticaci贸n",
  "Name: {0}\nURL: {1}\nEnvironment ID: {2}\nOrganization ID: {3}/This is a multi-line tooltipThe {0} represents Dataverse Environment's Friendly / Display nameThe {1} represents Dataverse Environment's URLThe {2} represents Dataverse Environment's Environment ID (GUID)The {3} represents Dataverse Environment's Organization ID (GUID)": "Nombre: {0}\nURL: {1}\nId. de entorno: {2}\nId. de organizaci贸n: {3}",
  "Name: {0}/The {0} represents the optional name the user provided for the profile)": "Nombre: {0}",
  "New Content Snippet": "Nuevo fragmento de contenido",
  "New Page Template": "Nueva plantilla de p谩gina",
  "New Webpage": "Nueva p谩gina web",
  "No": "No",
  "No Website Data Found in Current Directory. Please switch to a directory that contains the PAC downloaded website data to continue.": "No se encontraron datos del sitio web en el directorio actual. Cambie a un directorio que contenga los datos del sitio web descargado de PAC para continuar.",
  "No analysis results found.": "No se encontraron resultados de an谩lisis.",
  "No environments found": "No se encontraron entornos",
  "No issues found!": "No se han encontrado problemas.",
  "No message": "Sin mensaje",
  "No page templates found": "No se encontr贸 ninguna plantilla de p谩gina",
  "No parent pages found for adding webfile": "No se ha encontrado ninguna p谩gina primaria para agregar el archivo web",
  "No sites found": "No se encontraron sitios",
  "No webpages found": "No se ha encontrado ninguna p谩gina web",
  "No workspace folder found": "No se ha encontrado ninguna carpeta del 谩rea de trabajo",
  "No workspace folder opened. Please open a site folder to preview.": "No se ha abierto ninguna carpeta del 谩rea de trabajo. Abra una carpeta del sitio para obtener una vista previa.",
  "Not Now": "Ahora no",
  "Object ID: {0}/{0} is the Object ID": "Id. de objeto: {0}",
  "One or more attribute names have been changed or removed. Contact your admin.": "Se han cambiado o quitado uno o m谩s nombres de atributo. P贸ngase en contacto con su administrador.",
  "Open Folder": "Abrir carpeta",
  "Open Results": "Abrir resultados",
  "Open as Text": "Abrir como texto",
  "Open in New Workspace": "Abrir en nueva 谩rea de trabajo",
  "Open in Power Pages studio": "Abrir en el estudio de Power Pages",
  "Open in VS Code Desktop": "Abrir en VS Code Desktop",
  "Opening in VS Code Desktop. If it doesn't open or shows an error, you may need to install VS Code or update the Power Platform extension.": "Opening in VS Code Desktop. If it doesn't open or shows an error, you may need to install VS Code or update the Power Platform extension.",
  "Opening preview site...": "Abriendo sitio de versi贸n preliminar...",
  "Opening results with SARIF viewer...": "Abriendo resultados con SARIF Viewer...",
  "Opening results with newly installed SARIF viewer...": "Abriendo resultados con SARIF Viewer reci茅n instalado...",
  "Opening site preview...": "Abriendo la vista previa del sitio...",
  "Operation failed. See output panel for details.": "No se pudo realizar la operaci贸n. Consulte el panel de salida para obtener m谩s informaci贸n.",
  "Organization ID: {0}/{0} is the Organization ID": "Id. de organizaci贸n: {0}",
  "Organization URL is required but not provided": "La direcci贸n URL de la organizaci贸n es obligatoria, pero no se proporciona",
  "Other Sites": "Otros sitios",
  "PAC Telemetry disabled": "Telemetr铆a de PAC deshabilitada",
  "PAC Telemetry enabled": "Telemetr铆a de PAC habilitada",
  "PREVIEW": "VERSIN PRELIMINAR",
  "Page Template name cannot be empty.": "El nombre de la plantilla de p谩gina no puede estar vac铆o.",
  "Please enter a name for the content snippet.": "Escriba un nombre para el fragmento de contenido.",
  "Please enter a name for the page template.": "Escriba un nombre para la plantilla de p谩gina.",
  "Please enter a name for the web template.": "Escriba un nombre para la plantilla web.",
  "Please enter a name for the webpage.": "Escriba un nombre para la p谩gina web.",
  "Please login to preview the site.": "Inicie sesi贸n para obtener una vista previa del sitio.",
  "Please select the folder that contains your compiled output to upload your site.": "Seleccione la carpeta que contiene la salida compilada para cargar su sitio.",
  "Power Pages Copilot is now connected to the environment: {0} : {1}/{0} represents the environment name": "Power Pages Copilot est谩 conectado ahora al entorno {0}: {1}",
  "Power Pages site download completed successfully. Would you like to open the downloaded site folder?": "La descarga del sitio de Power Pages se complet贸 correctamente. 驴Le gustar铆a abrir la carpeta del sitio web que ha descargado?",
  "Power Pages studio URL is not available": "La direcci贸n URL del estudio de Power Pages no est谩 disponible",
  "PowerPages config file created successfully: {0}": "Archivo de configuraci贸n de PowerPages creado correctamente: {0}",
  "PowerPages config file updated successfully: {0}": "El archivo de configuraci贸n de PowerPages se actualiz贸 correctamente: {0}",
  "Preparing pac CLI (v{0}).../{0} represents the version number": "Preparando pac CLI (v{0})...",
  "Preparing to download Power Pages site...": "Preparando la descarga del sitio de Power Pages...",
  "Preview site": "Sitio de versi贸n preliminar",
  "Preview site URL is not valid": "La direcci贸n URL del sitio de versi贸n preliminar no es v谩lida",
  "Primary query suite {0} failed: {1}": "Error de {0} del conjunto de consultas principal: {1}",
  "Process error: {0}": "Error de proceso: {0}",
  "Processing download request...": "Procesando solicitud de descarga...",
  "Profile Kind: {0}/The {0} represents the profile type (Admin vs Dataverse)": "Tipo de perfil: {0}",
  "Response data is empty": "Los datos de respuesta est谩n vac铆os",
  "Results opened in SARIF viewer successfully.": "Los resultados se abrieron correctamente en SARIF Viewer.",
  "Running CodeQL analysis...": "Ejecutando an谩lisis de CodeQL...",
  "SARIF viewer extension does not expose expected API. Falling back to text editor...": "La extensi贸n del visor SARIF no expone la API esperada. Volviendo al editor de texto...",
  "SARIF viewer extension installed successfully. Activating...": "La extensi贸n SARIF Viewer se instal贸 correctamente. Activando...",
  "SARIF viewer extension not found.": "No se encontr贸 la extensi贸n SARIF Viewer.",
  "Saving your file ...": "Guardando su archivo...",
  "Select Folder": "Seleccionar carpeta",
  "Select Folder for new PCF Control/Do not translate 'PCF' as it is a product name.": "Seleccione Carpeta para el nuevo control PCF",
  "Select Folder to Download Power Pages Site": "Seleccionar carpeta para descargar el sitio de Power Pages",
  "Select Type": "Seleccionar tipo",
  "Select an environment": "Seleccionar un entorno",
  "Select folder for CodeQL database": "Seleccionar carpeta para la base de datos de CodeQL",
  "Select the folder that contains your compiled output": "Seleccione la carpeta que contiene la salida compilada",
  "Select the folder that will contain your project root for your site": "Seleccione la carpeta que contendr谩 la ra铆z del proyecto para su sitio",
  "Selection is empty.": "La selecci贸n est谩 vac铆a.",
  "Selection is too large. Try making a shorter selection.": "La selecci贸n es demasiado grande. Intente acortar la selecci贸n.",
  "Session Details": "Detalles de la sesi贸n",
  "Session ID: {0}/{0} is the Session ID": "Id. de sesi贸n: {0}",
  "Show Output Panel": "Mostrar panel de salida",
  "Sign in to VS Code with PAC CLI account": "Iniciar sesi贸n en VS Code con la cuenta de la CLI de PAC",
  "Site Details": "Detalles del sitio",
  "Site download cancelled. Authentication is required to proceed.": "Descarga del sitio cancelada. Se requiere autenticaci贸n para continuar.",
  "Site download cancelled. Correct environment connection is required.": "Descarga del sitio cancelada. Se requiere una conexi贸n de entorno correcta.",
  "Site download cancelled. No folder selected.": "Descarga del sitio cancelada. No hay ninguna carpeta seleccionada.",
  "Site management URL not found for the selected site. Please try again after refreshing the environment.": "No se encontr贸 la direcci贸n URL de administraci贸n del sitio para el sitio seleccionado. Vuelva a intentarlo despu茅s de actualizar el entorno.",
  "Site runtime preview feature is not enabled.": "La caracter铆stica de vista previa en tiempo de ejecuci贸n del sitio no est谩 habilitada.",
  "Site visibility: {0}/{0} is the site visibility": "Visibilidad del sitio: {0}",
  "Some references might be broken. Please check diagnostics for details.": "Es posible que algunas referencias est茅n rotas. Consulte los diagn贸sticos para ver m谩s detalles.",
  "Something went wrong. Dont worry, you can try again.": "Se ha producido un error. No se preocupe, puede intentarlo de nuevo.",
  "Starting CodeQL analysis for: {0}": "Inicio del an谩lisis de CodeQL para: {0}",
  "Submit": "Enviar",
  "Tell us more.": "Cu茅ntenos m谩s.",
  "Tenant ID: {0}/{0} is the Tenant ID": "Id. de inquilino: {0}",
  "The CodeQL extension is required to run this command. Do you want to install it now?": "Se requiere la extensi贸n \"CodeQL\" para ejecutar este comando. 驴Desea instalarla ahora?",
  "The Power Pages generator is ready for use in your VS Code extension!": "隆El generador de Power Pages ya se puede usar en su extensi贸n de VS Code!",
  "The SARIF Viewer extension is recommended for viewing CodeQL results. Would you like to install it now?": "Se recomienda la extensi贸n SARIF Viewer para ver los resultados de CodeQL. 驴Desea instalarla ahora?",
  "The account signed in to VS Code differs from the one authenticated in PAC CLI (Power Platform CLI). This mismatch can cause data not to load or actions to fail because UI commands run through the CLI. To fix it, sign in to VS Code using the same account as your PAC CLI. If needed, you can update your PAC CLI authentication separately via the command line.": "La cuenta que inici贸 sesi贸n en VS Code difiere de la autenticada en la CLI de PAC (CLI de Power Platform). Esta falta de coincidencia puede hacer que los datos no se carguen o que se produzca un error en las acciones porque los comandos de la interfaz de usuario se ejecutan a trav茅s de la CLI. Para corregirlo, inicie sesi贸n en VS Code con la misma cuenta que la CLI de PAC. Si es necesario, puede actualizar la autenticaci贸n de la CLI de PAC por separado a trav茅s de la l铆nea de comandos.",
  "The extension 'Microsoft Edge Tools' is required to run this command. Do you want to install it now?/Do not translate 'Microsoft Edge Tools' ": "Se requiere la extensi贸n \"Microsoft Edge Tools\" para ejecutar este comando. 驴Desea instalarla ahora?",
  "The name you want to give to this authentication profile": "Nombre que desea asignar a este perfil de autenticaci贸n",
  "The pac CLI is ready for use in your VS Code terminal!": "隆pac CLI ya se puede usar en su terminal de VS Code!",
  "The preview shown is for published changes. Please publish any pending changes to see them in the preview.": "La vista previa que se muestra corresponde a los cambios publicados. Publique los cambios pendientes para verlos en la vista previa.",
  "There was a permissions problem with the server": "Se produjo un problema de permisos con el servidor",
  "There was a problem opening the workspace": "Hubo un problema al abrir el 谩rea de trabajo",
  "Theres a problem on the back end": "Hay un problema en el back-end",
  "Thumbs Down": "Pulgar hacia abajo",
  "Thumbs Up": "Pulgar hacia arriba",
  "Timestamp: {0}/{0} is the timestamp": "Marca de tiempo: {0}",
  "To know more, see <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">Copilot in Power Pages documentation.": "Para obtener m谩s informaci贸n, consulte la <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">documentaci贸n de Copilot en Power Pages.",
  "Try @powerpages with GitHub Copilot": "Probar @powerpages con GitHub Copilot",
  "Try again": "Volver a intentarlo",
  "Try and be as specific as possible. Your feedback will be used to improve Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> View privacy details </a>": "Trate de ser lo m谩s espec铆fico posible. Sus comentarios se utilizar谩n para mejorar Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> Ver informaci贸n de privacidad </a>",
  "Unable to clear cache": "No se puede borrar la cach茅",
  "Unable to complete the request": "No se puede completar la solicitud",
  "Unable to find that app": "No se puede encontrar esa aplicaci贸n",
  "Unable to generate VS Code Desktop URL": "No se pudo generar la URL de VS Code Desktop",
  "Unable to locate website root folder.": "No se puede encontrar la carpeta ra铆z del sitio web.",
  "Unique name: {0}/{0} is the Unique name": "Nombre 煤nico: {0}",
  "Unmanaged": "No administrado",
  "Update Extension": "Update Extension",
  "Upload changes": "Cargar cambios",
  "Upload failed. Please try again later.": "Error de carga. Vuelva a intentarlo m谩s tarde.",
  "Use current site folder": "Usar la carpeta del sitio actual",
  "User cancelled opening results.": "El usuario cancel贸 la apertura de los resultados.",
  "User: {0}/The {0} represents auth profile's user name (email address))": "Usuario: {0}",
  "Using custom CodeQL query suite: {0}": "Uso del conjunto de consultas de CodeQL personalizado: {0}",
  "Using default query suite: {0}": "Uso del conjunto de consultas predeterminado: {0}",
  "VS Code - PAC CLI authentication mismatch detected": "VS Code: se detect贸 un error de coincidencia de autenticaci贸n de la CLI de PAC",
  "We encountered an error preparing the files for edit.": "Se detect贸 un error al preparar los archivos para su edici贸n.",
  "Web files": "Archivos web",
  "Webfile(s) added successfully": "Sitios web agregados correctamente",
  "Webpage names should contain only letters, numbers, hyphens, or underscores.": "Los nombres de p谩gina web solo deben contener letras, n煤meros, guiones o caracteres de subrayado.",
  "Website ID is not available": "El id. del sitio web no est谩 disponible",
  "Website ID is required but not provided": "El id. del sitio web es obligatorio, pero no se proporciona",
  "Website Id: {0}/{0} is the website ID": "Id. de sitio web: {0}",
  "Website Url: {0}/{0} is the website Url": "URL del sitio web: {0}",
  "Website not found in the environment. Please check the credentials and login with correct account.": "No se encontr贸 el sitio web en el entorno. Compruebe las credenciales e inicie sesi贸n con la cuenta correcta.",
  "What do you need help with?": "驴Con qu茅 necesita ayuda?",
  "Whether its HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.": "Ya sea c贸digo HTML, CSS, JS o Liquid, simplemente describa lo que necesita y deje que la IA lo construya por usted.",
  "Working on it...": "En proceso...",
  "Write JavaScript code for form field validation to check phone field value is in the valid format.": "Escriba c贸digo JavaScript para validar el campo del formulario de forma que se compruebe que el valor del campo de tel茅fono tiene el formato v谩lido.",
  "Write JavaScript code to highlight the row where email field is empty in table list.": "Escriba c贸digo JavaScript para resaltar la fila en la que el campo de correo electr贸nico est谩 vac铆o en la lista de tablas.",
  "Write web API code to query active contact records.": "Escriba c贸digo de API web para consultar los registros de contactos activos.",
  "Yes": "S铆",
  "You are currently connected to a different environment. Would you like to switch to the required environment?": "Actualmente est谩 conectado a un entorno diferente. 驴Le gustar铆a cambiar al entorno requerido?",
  "You are editing a live, public site ": "Est谩 editando un sitio p煤blico activo ",
  "You can use this in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot with @powerpages</a> and leverage best of both world.": "Puede usar esto en <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot con @powerpages</a> y aprovechar lo mejor de ambos mundos.",
  "You need to authenticate with Power Platform to download the site. Would you like to authenticate now?": "Debe autenticarse con Power Platform para descargar el sitio. 驴Le gustar铆a autenticarse ahora?",
  "Your preview isn't updated. Please upload your site to see the latest changes.": "La vista previa no est谩 actualizada. Cargue su sitio para ver los cambios m谩s recientes.",
  "dotnet sdk 6.0 or greater must be installed/Do not translate 'dotnet' or 'sdk'": "debe estar instalado dotnet sdk 6.0 o una versi贸n posterior",
  "{0} created!/{0} will be replaced by the entity type.": "Se ha creado {0}."
}