{
  " End of Code Block ": " Fine del blocco di codice ",
  "@PowerPages is not yet available in your region.": "@PowerPages non è ancora disponibile nella tua area geografica.",
  "A content snippet with the same name already exists. Please enter a different name.": "Esiste già un frammento di contenuto con lo stesso nome. Immetti un nome diverso.",
  "A page template with the same name already exists. Please enter a different name.": "Esiste già un modello di pagina con lo stesso nome. Immetti un nome diverso.",
  "A webpage with the same name already exists. Please enter a different name.": "Esiste già una pagina Web con lo stesso nome. Immetti un nome diverso.",
  "A webtemplate with the same name already exists. Please enter a different name.": "Esiste già un webtemplate con lo stesso nome. Immetti un nome diverso.",
  "AI features have been disabled by your organization. Contact your admin for details. [Learn more](https://go.microsoft.com/fwlink/?linkid=2285848)": "Le funzionalità dell'IA sono state disabilitate dall'organizzazione. Contatta l'amministratore per i dettagli. [Altre informazioni](https://go.microsoft.com/fwlink/?linkid=2285848)",
  "AI-generated content can contain mistakes": "Il contenuto generato dall'IA contiene errori",
<<<<<<< HEAD
=======
  "Accounts don't match, data may not load.": "Gli account non corrispondono. È possibile che i dati non vengano caricati.",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Activating CodeQL extension...": "Attivazione dell'estensione CodeQL in corso...",
  "Activating SARIF viewer extension...": "Attivazione dell'estensione del visualizzatore SARIF in corso...",
  "Active Sites": "Siti attivi",
  "Active auth profile is not found or has expired. Please try again.": "Profilo di autenticazione attivo non trovato o scaduto. Riprova.",
  "Active auth profile is not found or has expired. To create a new auth profile, enter the environment URL.": "Profilo di autenticazione attivo non trovato o scaduto. Per creare un nuovo profilo di autenticazione, immetti l'URL dell'ambiente.",
  "Add content snippet name (name should be unique)": "Aggiungi nome frammento di contenuto (il nome deve essere univoco)",
  "Added default query suite to config: {0}": "Suite di query predefinita aggiunta alla configurazione: {0}",
  "Adding {0} web file(s). Existing files will be skipped/{0} represents the number of web files": "Aggiunta di {0} file Web in corso. I file esistenti verranno ignorati",
  "Analysis complete! Results saved to: {0}": "Analisi completata. Risultati salvati in: {0}",
  "Analysis completed using query suite: {0}": "Analisi completata tramite la suite di query: {0}",
  "Are you sure you want to clear all the Auth Profiles?": "Cancellare tutti i profili di autenticazione?",
  "Are you sure you want to delete the Auth Profile {0}-{1}?/{0} is the user name, {1} is the URL of environment of the auth profile": "Eliminare il profilo di autenticazione {0}-{1}?",
  "Arrow icon": "Icona a forma di freccia",
  "Authenticating...": "Autenticazione in corso...",
<<<<<<< HEAD
  "Authentication failed. Please login and try again.": "Autenticazione non riuscita. Accedi e riprova.",
=======
  "Authentication failed. Cannot proceed with site download.": "Autenticazione non riuscita. Non è possibile continuare il download del sito.",
  "Authentication failed. Please login and try again.": "Autenticazione non riuscita. Accedi e riprova.",
  "Authentication failed. Please try again.": "Autenticazione non riuscita. Riprova.",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Authorization Failed. Please run again to authorize it": "Autorizzazione non riuscita. Esegui di nuovo per autorizzarla",
  "Be careful making changes. Anyone can see the changes you make immediately. Choose Edit the site to make edits, or close the editor tab to cancel without editing.": "Presta attenzione quando apporti le modifiche. Chiunque può vedere le modifiche che hai apportato immediatamente. Scegli Modifica il sito per apportare modifiche o chiudi la scheda dell'editor per annullare senza modificare.",
  "Be careful when you're updating public sites. The changes you make are visible to anyone immediately. Do you want to continue?": "Presta attenzione quando aggiorni i siti pubblici. Le modifiche apportate sono immediatamente visibili a chiunque. Continuare?",
  "Browse...": "Sfoglia...",
  "Cancel": "Annulla",
  "Cannot install Power Pages generator. Please install npm and try again./Do not translate 'npm'": "Impossibile installare il generatore di Power Pages. Installa npm e riprova.",
  "Cannot install Power Pages generator: {0}/{0} represents the error message returned from the exception": "Impossibile installare il generatore di Power Pages: {0}",
  "Cannot install pac CLI: {0}/{0} represents the error message returned from the exception": "Impossibile installare pac CLI: {0}",
  "Changing environment...": "Modifica dell'ambiente in corso...",
  "Check the URL and verify the parameters are correct": "Controlla l'URL e verifica che i parametri siano corretti",
  "Checking for active auth profile...": "Verifica del profilo di autenticazione attivo in corso...",
  "Choose page template": "Scegli modello di pagina",
  "Choose parent page": "Scegli pagina padre",
  "Choose web template": "Scegli modello Web",
  "Clearing cache. See [details](https://aka.ms/pages-clear-cache)./This is a markdown formatting which must persist across translations.The second line should be '[TRANSLATION HERE](https://aka.ms/pages-clear-cache).', keeping brackets and the text in the parentheses unmodified": "Cancellazione della cache in corso. Vedi i [dettagli](https://aka.ms/pages-clear-cache).",
<<<<<<< HEAD
=======
  "Click to authenticate with a matching account": "Fai clic per eseguire l'autenticazione con un account corrispondente",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Close": "Chiudi",
  "Cloud Instance: {0}/The {0} represents profile's Azure Cloud Instances": "Istanza cloud: {0}",
  "Cluster category: {0}/{0} is the Cluster category": "Categoria cluster: {0}",
  "Cluster environment: {0}/{0} is the Cluster environment": "Ambiente cluster: {0}",
  "Cluster geo name: {0}/{0} is the cluster geo name": "Nome geografico cluster: {0}",
  "Code Block ": "Blocco di codice ",
  "CodeQL Analysis": "Analisi CodeQL",
  "CodeQL CLI is not installed or not in PATH. Please install the CodeQL extension or add CodeQL CLI to your PATH.": "L'interfaccia della riga di comando di CodeQL non è installata o non è presente in PATH. Installa l'estensione CodeQL o aggiungi l'interfaccia della riga di comando di CodeQL in PATH.",
  "CodeQL analysis completed successfully with no issues found! 🎉": "L'analisi di CodeQL è stata completata senza problemi. 🎉",
  "CodeQL analysis completed. Would you like to open the full results file?": "Analisi di CodeQL completata. Vuoi aprire il file dei risultati completi?",
  "CodeQL analysis failed: {0}": "Analisi di CodeQL non riuscita: {0}",
  "CodeQL database created successfully. You can now run queries from the CodeQL extension.": "Creazione del database di CodeQL completata. Ora puoi eseguire query dall'estensione CodeQL.",
  "CodeQL database created. You can now:\n\n1. Run custom queries if you have any\n2. Use the prebuilt queries from the CodeQL extension\n\nCheck the CodeQL extension panel for available queries.": "Database di CodeQL creato. Ora puoi:\n\n1. Eseguire le query personalizzate eventualmente presenti\n2. Usare le query predefinite dell'estensione CodeQL\n\nControlla le query disponibili nel pannello dell'estensione CodeQL.",
  "CodeQL extension is not installed.": "L'estensione CodeQL non è installata.",
  "CodeQL global storage path does not exist: {0}": "Il percorso di archiviazione globale di CodeQL non esiste: {0}",
  "CodeQL screening failed. Please try again later.": "Screening di CodeQL non riuscito. Riprova più tardi.",
  "CodeQL screening is not supported for this site.": "Lo screening di CodeQL non è supportato per questo sito.",
  "CodeQL screening started. Creating database and analyzing": "Screening di CodeQL avviato. Creazione del database e analisi",
  "CodeQL version: {0}": "Versione CodeQL: {0}",
  "Command completed successfully (exit code: {0})": "Comando completato (codice di uscita: {0})",
  "Command failed with exit code {0}: {1}": "Comando non riuscito con codice di uscita {0}: {1}",
  "Command failed with exit code: {0}": "Comando non riuscito con codice di uscita: {0}",
  "Confirm": "Conferma",
  "Continue with Copilot for Power Pages": "Continua con Copilot per Power Pages",
  "Copied to clipboard!": "Copiato negli Appunti.",
  "Copilot Response": "Risposta Copilot",
  "Copilot illustration": "Illustrazione di Copilot",
  "Copy to clipboard": "Copia negli Appunti",
  "Could not determine user data path.": "Non è possibile determinare il percorso dei dati utente.",
  "Could not locate CodeQL CLI in global storage.": "Non è possibile individuare l'interfaccia della riga di comando di CodeQL nello spazio di archiviazione globale.",
  "Created PowerPages config file at {0} with default query suite: {1}": "Il file di configurazione di PowerPages è stato creato in {0} con la suite di query predefinita: {1}",
  "Created on: {0}/{0} is the created date": "Data di creazione: {0}",
  "Creating CodeQL database...": "Creazione del database di CodeQL in corso...",
  "Creating {0}.../{0} will be replaced by the entity type.": "Creazione di {0} in corso...",
  "Creator: {0}/{0} is the creator": "Autore: {0}",
  "Current": "Corrente",
  "Current site path not found.": "Percorso del sito corrente non trovato.",
  "Current site path not found. Please ensure you have a site folder open.": "Percorso del sito corrente non trovato. Assicurati di avere una cartella del sito aperta.",
  "Data model version: {0}/{0} is the data model version": "Versione modello di dati: {0}",
  "Database location: {0}": "Percorso database: {0}",
  "Default Environment: {0}/The {0} represents profile's resource/environment URL": "Ambiente predefinito: {0}",
  "Dislike something? Tell us more.": "Non ti è piaciuto qualcosa? Comunicaci altre informazioni.",
  "Display Name: {0}\nUnique Name: {1}\nVersion: {2}\nType: {3}/This is a multi-line tooltipThe {0} represents Solution's Friendly / Display nameThe {1} represents Solution's unique nameThe {2} represents Solution's Version numberThe {3} represents Solution's Type (Managed or Unmanaged), but that test is localized separately.": "Nome visualizzato: {0}\nNome univoco: {1}\nVersione: {2}\nTipo: {3}",
  "Do not show again": "Non visualizzare più",
  "Download Power Pages Site": "Scarica il sito di Power Pages",
  "Download VS Code": "Scarica VS Code",
  "Downloading Power Pages site using model version {0}...": "È in corso il download del sito di Power Pages con la versione del modello {0}...",
  "Downloading Power Pages site, please wait...": "Download del sito di Power Pages in corso. Attendi...",
  "Edit the site": "Modifica il sito",
  "Enter Organization ID": "Immetti ID organizzazione",
  "Enter name": "Immetti nome",
  "Enter the environment URL": "Immetti l'URL dell'ambiente",
  "Enter the name of the web template": "Immetti il nome del modello Web",
<<<<<<< HEAD
=======
  "Environment ID is not available": "L'ID dell'ambiente non è disponibile",
  "Environment ID is required but not provided": "L'ID dell'ambiente è obbligatorio ma non è stato specificato",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Environment ID: {0}/{0} is the Environment ID": "ID ambiente: {0}",
  "Environment changed successfully.": "Modifica dell'ambiente completata.",
  "Error accessing CodeQL extension: {0}": "Errore durante l'accesso all'estensione CodeQL: {0}",
  "Error creating config file: {0}": "Errore durante la creazione del file di configurazione: {0}",
  "Error during CodeQL analysis: {0}": "Errore durante l'analisi di CodeQL: {0}",
  "Error getting CLI path from extension API: {0}": "Errore durante il recupero del percorso dell'interfaccia della riga di comando dall'API dell'estensione: {0}",
  "Error opening results file: {0}": "Errore durante l'apertura del file dei risultati: {0}",
  "Error opening with SARIF viewer: {0}": "Errore durante l'apertura con il visualizzatore SARIF: {0}",
  "Error reading config file: {0}": "Errore durante la lettura del file di configurazione: {0}",
  "Error reading results: {0}": "Errore durante la lettura dei risultati: {0}",
  "Error searching for CodeQL CLI: {0}": "Errore durante la ricerca dell'interfaccia della riga di comando per CodeQL: {0}",
<<<<<<< HEAD
=======
  "Error switching environment: {0}": "Errore durante il cambio dell'ambiente: {0}",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Error updating config file: {0}": "Errore durante l'aggiornamento del file di configurazione: {0}",
  "Executing: {0}": "In esecuzione: {0}",
  "Explain the following code snippet:": "Spiega il frammento di codice seguente:",
  "Explain the following code {% include 'Page Copy'%}": "Spiega il codice seguente {% include 'Page Copy'%}",
  "Extension installed but API not available yet. Opening as text file...": "L'estensione è stata installata ma l'API non è ancora disponibile. Apertura come file di testo in corso...",
  "Failed to create a new Power Pages site. Please try again.": "Impossibile creare un nuovo sito Power Pages. Riprova.",
  "Failed to create: {0}./{0} will be replaced by the error message.": "Impossibile creare: {0}.",
  "Failed to disable PAC telemetry.": "Impossibile disabilitare telemetria PAC.",
  "Failed to download site: {0}": "Non è possibile scaricare il sito: {0}",
  "Failed to enable PAC telemetry.": "Impossibile abilitare telemetria PAC.",
  "Failed to fetch some files.": "Impossibile recuperare alcuni file.",
  "Failed to generate VS Code Desktop URL: {0}": "Non è possibile generare l'URL di VS Code Desktop: {0}",
  "Failed to get file ready for edit: {0}": "Impossibile preparare il file per la modifica: {0}",
  "Failed to get organization details. Please try again later": "Impossibile recuperare i dettagli dell'organizzazione. Riprova più tardi",
  "Failed to get website endpoint. Please try again later": "Impossibile recuperare l'endpoint del sito Web. Riprova più tardi",
<<<<<<< HEAD
  "Failed to install SARIF viewer extension. Opening results as text file.": "Installazione dell'estensione del visualizzatore SARIF non riuscita. I risultati verranno aperti come file di testo.",
  "Failed to install SARIF viewer extension: {0}": "Non è possibile installare l'estensione del visualizzatore SARIF: {0}",
=======
  "Failed to handle Power Pages URI: {0}": "Non è possibile gestire l'URI di Power Pages: {0}",
  "Failed to install SARIF viewer extension. Opening results as text file.": "Installazione dell'estensione del visualizzatore SARIF non riuscita. I risultati verranno aperti come file di testo.",
  "Failed to install SARIF viewer extension: {0}": "Non è possibile installare l'estensione del visualizzatore SARIF: {0}",
  "Failed to open in VS Code Desktop: {0}": "Non è possibile eseguire l'apertura in VS Code Desktop: {0}",
  "Failed to switch to the required environment.": "Non è possibile passare all'ambiente richiesto.",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Feature is not enabled for this geo.": "La funzionalità non è abilitata per questa area geografica.",
  "Feedback": "Feedback",
  "Fetching your file ...": "Recupero del file in corso...",
  "File might be referenced by name {0} here./{0} represents the name of the file": "È possibile che qui si faccia riferimento al file con il nome {0}.",
  "File(s) already exist. No new files to add": "I file esistono già. Nessun nuovo file da aggiungere",
  "File: {0}": "File: {0}",
  "Found CodeQL CLI at: {0}": "Trovata interfaccia della riga di comando di CodeQL in: {0}",
  "Found CodeQL CLI via extension API: {0}": "Trovata interfaccia della riga di comando di CodeQL tramite l'API dell'estensione: {0}",
  "Found PowerPages config file: {0}": "Trovato file di configurazione di PowerPages: {0}",
  "Found distribution directories: {0}": "Directory di distribuzione trovate: {0}",
  "Found {0} issue(s):": "Problemi trovati: {0}",
  "Friendly name: {0}/{0} is the website name": "Nome descrittivo: {0}",
  "GETTING STARTED": "ATTIVITÀ INIZIALI",
  "Generating a new Power Pages site...": "Generazione di un nuovo sito di Power Pages in corso...",
  "Generating webpages...": "Generazione delle pagine Web in corso...",
<<<<<<< HEAD
=======
  "Get Extension": "Ottieni estensione",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Get GitHub Copilot to try @powerpages": "Recupera GitHub Copilot per provare @powerpages",
  "Getting organization details...": "Recupero dei dettagli dell'organizzazione in corso...",
  "Getting region information...": "Recupero informazioni area geografica in corso...",
  "Getting website endpoint...": "Recupero dell'endpoint del sito Web in corso...",
  "Here are a few suggestions to get you started": "Ecco alcuni suggerimenti per iniziare",
  "Hi": "Ciao",
  "Hi! @powerpages can help you write, edit, and even summarize your website code.": "Ciao! @powerpages può aiutarti a scrivere, modificare e anche riepilogare il codice del sito Web.",
  "Hi! Instantly generate code for Power Pages sites by typing in what you need. To start using Copilot, log in to your Microsoft account.": "Ciao! Genera immediatamente il codice per i siti di Power Pages digitando ciò che ti serve. Per iniziare a utilizzare Copilot, accedi al tuo account Microsoft.",
  "Hi! Power Pages lets you build secure, professional websites that you can quickly configure and publish across web browsers and devices.\n\nTo create your website, visit the [Power Pages](https://powerpages.microsoft.com/).\nReturn to this chat and @powerpages can help you write and edit your website code.": "Ciao! Power Pages consente di creare siti Web sicuri e professionali che puoi configurare e pubblicare rapidamente in Web browser e dispositivi.\n\nPer creare il tuo sito Web, visita [Power Pages](https://powerpages.microsoft.com/).\nTorna in questa chat e @powerpages potrà aiutarti a scrivere e modificare il codice del tuo sito Web.",
  "Hi! Your Microsoft account doesn’t currently support Copilot. Contact your admin for details.": "Ciao! Il tuo account Microsoft al momento non supporta Copilot. Per informazioni dettagliate, contatta l'amministratore.",
  "In your own words, describe what you need. You can get help with writing code for Power Pages sites in HTML, CSS, and JS languages.": "Descrivi ciò di cui hai bisogno con parole tue. Puoi ottenere assistenza con la scrittura di codice per i siti Power Pages nei linguaggi HTML, CSS e JS.",
  "Inactive Sites": "Siti inattivi",
  "Initializing site preview": "Inizializzazione dell'anteprima del sito in corso",
  "Initializing site preview. Please try again after few seconds.": "Inizializzazione dell'anteprima del sito in corso. Riprova tra alcuni secondi.",
  "Insert code into editor": "Inserisci codice nell'editor",
  "Install": "Installa",
  "Installing Power Pages generator(v{0}).../{0} represents the version number": "Installazione del generatore di Power Pages in corso(v{0})...",
  "Installing SARIF viewer extension...": "Installazione dell'estensione del visualizzatore SARIF in corso...",
  "Instance url: {0}/{0} is the Instance Url": "URL istanza: {0}",
  "Learn more about Copilot": "Scopri di più su Copilot",
  "Let Copilot help you code": "Consenti a Copilot di aiutarti con il codice",
  "Like something? Tell us more.": "Ti è piaciuto qualcosa? Comunicaci altre informazioni.",
  "Line: {0}": "Riga: {0}",
  "Login": "Accesso",
  "Login to PowerPages": "Accedi a PowerPages",
  "Looking for CodeQL CLI in: {0}": "Ricerca dell'interfaccia della riga di comando di CodeQL in: {0}",
  "Make sure AI-generated content is accurate and appropriate before using. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Learn more</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">View\n              terms</a>": "Verifica che il contenuto generato dall'IA sia accurato e appropriato prima di usarlo. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Altre informazioni</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">Visualizza\n              le condizioni</a>",
  "Make sure AI-generated content is accurate and appropriate before using. [Learn more](https://go.microsoft.com/fwlink/?linkid=2240145) | [View terms](https://go.microsoft.com/fwlink/?linkid=2189520)": "Verifica che contenuto generato dall'IA sia accurato e appropriato prima di utilizzarlo. [Altre informazioni](https://go.microsoft.com/fwlink/?linkid=2240145) | [Visualizza le condizioni](https://go.microsoft.com/fwlink/?linkid=2189520)",
  "Managed": "Gestita",
  "Maximum 30 characters allowed": "È consentito un massimo di 30 caratteri",
  "Microsoft wants your feedback": "Microsoft desidera ricevere i tuoi commenti",
  "Missing required site information for reactivation.": "Mancano le informazioni richieste sul sito per la riattivazione.",
  "NEW": "NUOVO",
  "Name/Rename Auth Profile": "Assegna un nome/rinomina profilo di autorizzazione",
  "Name: {0}\nURL: {1}\nEnvironment ID: {2}\nOrganization ID: {3}/This is a multi-line tooltipThe {0} represents Dataverse Environment's Friendly / Display nameThe {1} represents Dataverse Environment's URLThe {2} represents Dataverse Environment's Environment ID (GUID)The {3} represents Dataverse Environment's Organization ID (GUID)": "Nome: {0}\nURL: {1}\nID ambiente: {2}\nID organizzazione: {3}",
  "Name: {0}/The {0} represents the optional name the user provided for the profile)": "Nome: {0}",
  "New Content Snippet": "Nuovo frammento di contenuto",
  "New Page Template": "Nuovo modello di pagina",
  "New Webpage": "Nuova pagina Web",
  "No": "No",
  "No Website Data Found in Current Directory. Please switch to a directory that contains the PAC downloaded website data to continue.": "Nessun dato sul sito Web trovato nella directory corrente. Per continuare, passa a una directory che contiene i dati del sito Web scaricati.",
  "No analysis results found.": "Non sono stati trovati risultati dell'analisi.",
  "No environments found": "Nessun ambiente trovato",
  "No issues found!": "Nessun problema trovato.",
  "No message": "Nessun messaggio",
  "No page templates found": "Non sono stati trovati modelli di pagina",
  "No parent pages found for adding webfile": "Nessuna pagina padre trovata per l'aggiunta di un file Web",
  "No sites found": "Nessun sito trovato",
  "No webpages found": "Nessuna pagina Web trovata",
  "No workspace folder found": "Nessuna cartella dell'area di lavoro trovata",
  "No workspace folder opened. Please open a site folder to preview.": "Nessuna cartella dell'area di lavoro aperta. Apri una cartella del sito per visualizzarla in anteprima.",
<<<<<<< HEAD
  "Object ID: {0}/{0} is the Object ID": "ID oggetto: {0}",
  "One or more attribute names have been changed or removed. Contact your admin.": "Uno o più nomi di attributo sono stati modificati o rimossi. Contatta l'amministratore.",
  "Open Results": "Apri risultati",
  "Open as Text": "Apri come testo",
=======
  "Not Now": "Non ora",
  "Object ID: {0}/{0} is the Object ID": "ID oggetto: {0}",
  "One or more attribute names have been changed or removed. Contact your admin.": "Uno o più nomi di attributo sono stati modificati o rimossi. Contatta l'amministratore.",
  "Open Folder": "Apri cartella",
  "Open Results": "Apri risultati",
  "Open as Text": "Apri come testo",
  "Open in New Workspace": "Apri nella nuova area di lavoro",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Open in Power Pages studio": "Apri nello studio di Power Pages",
  "Open in VS Code Desktop": "Apri in VS Code Desktop",
  "Opening in VS Code Desktop. If it doesn't open or shows an error, you may need to install VS Code or update the Power Platform extension.": "Opening in VS Code Desktop. If it doesn't open or shows an error, you may need to install VS Code or update the Power Platform extension.",
  "Opening preview site...": "Apertura sito in anteprima in corso...",
  "Opening results with SARIF viewer...": "Apertura dei risultati con il visualizzatore SARIF in corso...",
  "Opening results with newly installed SARIF viewer...": "È in corso l'apertura dei risultati con il visualizzatore SARIF appena installato...",
  "Opening site preview...": "Apertura anteprima sito Web in corso...",
  "Operation failed. See output panel for details.": "Operazione non riuscita. Per i dettagli, vedi il pannello di output.",
  "Organization ID: {0}/{0} is the Organization ID": "ID organizzazione: {0}",
<<<<<<< HEAD
=======
  "Organization URL is required but not provided": "L'URL dell'organizzazione è obbligatorio ma non è stato specificato",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Other Sites": "Altri siti",
  "PAC Telemetry disabled": "Telemetria PAC disabilitata",
  "PAC Telemetry enabled": "Telemetria PAC abilitata",
  "PREVIEW": "ANTEPRIMA",
  "Page Template name cannot be empty.": "Il nome del modello di pagina non può essere vuoto.",
  "Please enter a name for the content snippet.": "Immetti un nome per il frammento di contenuto.",
  "Please enter a name for the page template.": "Immetti un nome per il modello di pagina.",
  "Please enter a name for the web template.": "Immetti un nome per il modello Web.",
  "Please enter a name for the webpage.": "Immetti un nome per la pagina Web.",
  "Please login to preview the site.": "Effettua il login per visualizzare l'anteprima del sito.",
  "Please select the folder that contains your compiled output to upload your site.": "Seleziona la cartella che contiene l'output compilato per caricare il tuo sito.",
  "Power Pages Copilot is now connected to the environment: {0} : {1}/{0} represents the environment name": "Copilot di Power Pages è ora connesso all'ambiente: {0}: {1}",
  "Power Pages site download completed successfully. Would you like to open the downloaded site folder?": "Il download del sito di Power Pages è stato completato correttamente. Vuoi aprire la cartella del sito scaricato?",
  "Power Pages studio URL is not available": "L'URL dello studio di Power Pages non è disponibile",
  "PowerPages config file created successfully: {0}": "Creazione del file di configurazione di PowerPages completata: {0}",
  "PowerPages config file updated successfully: {0}": "Aggiornamento del file di configurazione di PowerPages completato: {0}",
  "Preparing pac CLI (v{0}).../{0} represents the version number": "Preparazione di pac CLI: in corso (v{0})...",
  "Preparing to download Power Pages site...": "Preparazione del download del sito di Power Pages in corso...",
  "Preview site": "Sito in anteprima",
  "Preview site URL is not valid": "URl di anteprima sito non valido",
  "Primary query suite {0} failed: {1}": "Suite di query primaria {0} non riuscita: {1}",
  "Process error: {0}": "Errore del processo: {0}",
<<<<<<< HEAD
=======
  "Processing download request...": "Elaborazione della richiesta di download in corso...",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Profile Kind: {0}/The {0} represents the profile type (Admin vs Dataverse)": "Tipo di profilo: {0}",
  "Response data is empty": "I dati della risposta sono vuoti",
  "Results opened in SARIF viewer successfully.": "I risultati sono stati aperti nel visualizzatore SARIF.",
  "Running CodeQL analysis...": "Esecuzione dell'analisi di CodeQL in corso...",
  "SARIF viewer extension does not expose expected API. Falling back to text editor...": "L'estensione del visualizzatore SARIF non espone l'API prevista. Fallback all'editor di testo in corso...",
  "SARIF viewer extension installed successfully. Activating...": "Installazione dell'estensione del visualizzatore SARIF completata. Attivazione in corso...",
  "SARIF viewer extension not found.": "Estensione del visualizzatore SARIF non trovata.",
  "Saving your file ...": "Salvataggio del file in corso...",
  "Select Folder": "Seleziona cartella",
  "Select Folder for new PCF Control/Do not translate 'PCF' as it is a product name.": "Seleziona cartella per nuovo controllo PCF",
  "Select Folder to Download Power Pages Site": "Seleziona la cartella per scaricare il sito di Power Pages",
  "Select Type": "Seleziona tipo",
  "Select an environment": "Seleziona un ambiente",
  "Select folder for CodeQL database": "Seleziona la cartella per il database di CodeQL",
  "Select the folder that contains your compiled output": "Seleziona la cartella che contiene l'output compilato",
  "Select the folder that will contain your project root for your site": "Seleziona la cartella che conterrà la radice del progetto per il sito",
  "Selection is empty.": "Selezione vuota.",
  "Selection is too large. Try making a shorter selection.": "La selezione è troppo ampia. Provare a eseguire una selezione più breve.",
  "Session Details": "Dettagli sessione",
  "Session ID: {0}/{0} is the Session ID": "ID sessione: {0}",
  "Show Output Panel": "Mostra pannello di output",
<<<<<<< HEAD
  "Site Details": "Dettagli sito",
=======
  "Sign in to VS Code with PAC CLI account": "Accedi a VS Code con l'account dell'interfaccia della riga di comando PAC",
  "Site Details": "Dettagli sito",
  "Site download cancelled. Authentication is required to proceed.": "Download del sito annullato. Per continuare, è necessaria l'autenticazione.",
  "Site download cancelled. Correct environment connection is required.": "Download del sito annullato. È necessaria la connessione all'ambiente corretto.",
  "Site download cancelled. No folder selected.": "Download del sito annullato. Nessuna cartella selezionata.",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Site management URL not found for the selected site. Please try again after refreshing the environment.": "URL di gestione del sito non trovato per il sito selezionato. Riprova dopo aver aggiornato l'ambiente.",
  "Site runtime preview feature is not enabled.": "La funzionalità di anteprima di esecuzione del sito non è abilitata.",
  "Site visibility: {0}/{0} is the site visibility": "Visibilità sito: {0}",
  "Some references might be broken. Please check diagnostics for details.": "Alcuni riferimenti potrebbero essere danneggiati. Per altre informazioni, controlla la diagnostica.",
  "Something went wrong. Don’t worry, you can try again.": "Si è verificato un errore. Non preoccuparti. Puoi riprovare.",
  "Starting CodeQL analysis for: {0}": "Avvio dell'analisi di CodeQL per: {0}",
  "Submit": "Invia",
  "Tell us more.": "Fornisci altre informazioni.",
  "Tenant ID: {0}/{0} is the Tenant ID": "ID tenant: {0}",
  "The CodeQL extension is required to run this command. Do you want to install it now?": "Per eseguire questo comando, è necessaria l'estensione CodeQL. Vuoi installarla ora?",
  "The Power Pages generator is ready for use in your VS Code extension!": "Il generatore Power Pages è pronto per l'utilizzo nell'estensione VS Code.",
  "The SARIF Viewer extension is recommended for viewing CodeQL results. Would you like to install it now?": "Per la visualizzazione dei risultati di CodeQL, è consigliabile l'estensione del visualizzatore SARIF. Vuoi installarla ora?",
<<<<<<< HEAD
=======
  "The account signed in to VS Code differs from the one authenticated in PAC CLI (Power Platform CLI). This mismatch can cause data not to load or actions to fail because UI commands run through the CLI. To fix it, sign in to VS Code using the same account as your PAC CLI. If needed, you can update your PAC CLI authentication separately via the command line.": "L'account connesso a VS Code è diverso da quello che ha eseguito l'autenticazione nell'interfaccia della riga di comando PAC (Power Platform CLI). A causa di questa mancata corrispondenza, è possibile che i dati non vengano caricati o che le azioni non vengano eseguite correttamente perché i comandi dell'interfaccia utente vengono eseguiti tramite l'interfaccia della riga di comando. Per risolvere il problema, accedi a VS Code usando lo stesso account dell'interfaccia della riga di comando PAC. Se necessario, puoi aggiornare separatamente l'autenticazione dell'interfaccia della riga di comando PAC tramite la riga di comando.",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "The extension 'Microsoft Edge Tools' is required to run this command. Do you want to install it now?/Do not translate 'Microsoft Edge Tools' ": "Per eseguire questo comando è necessaria l'estensione \"Microsoft Edge Tools\". Installarla ora?",
  "The name you want to give to this authentication profile": "Il nome che vuoi assegnare a questo profilo di autenticazione",
  "The pac CLI is ready for use in your VS Code terminal!": "pac CLI è pronto per l'utilizzo nel terminale VS Code.",
  "The preview shown is for published changes. Please publish any pending changes to see them in the preview.": "L'anteprima mostrata è per le modifiche pubblicate. Pubblica tutte le modifiche in sospeso per vederle nell'anteprima.",
  "There was a permissions problem with the server": "Si è verificato un problema di autorizzazione con il server",
  "There was a problem opening the workspace": "Si è verificato un problema durante l'apertura dell'area di lavoro",
  "There’s a problem on the back end": "Si è verificato un problema nel back-end",
  "Thumbs Down": "Pollice giù",
  "Thumbs Up": "Pollice su",
  "Timestamp: {0}/{0} is the timestamp": "Timestamp: {0}",
  "To know more, see <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">Copilot in Power Pages documentation.": "Per altre informazioni, vedi la <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">documentazione di Copilot in Power Pages.",
  "Try @powerpages with GitHub Copilot": "Prova @powerpages con GitHub Copilot",
  "Try again": "Riprova",
  "Try and be as specific as possible. Your feedback will be used to improve Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> View privacy details </a>": "Prova a essere il più specifico possibile. Il tuo feedback verrà utilizzato per migliorare Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> Visualizza i dettagli sulla privacy</a>",
  "Unable to clear cache": "Impossibile eliminare la cache",
  "Unable to complete the request": "Impossibile completare la richiesta",
  "Unable to find that app": "Impossibile trovare tale app",
<<<<<<< HEAD
  "Unable to locate website root folder.": "Impossibile individuare la cartella radice del sito Web.",
  "Unique name: {0}/{0} is the Unique name": "Nome univoco: {0}",
  "Unmanaged": "Non gestita",
=======
  "Unable to generate VS Code Desktop URL": "Non è possibile generare l'URL di VS Code Desktop",
  "Unable to locate website root folder.": "Impossibile individuare la cartella radice del sito Web.",
  "Unique name: {0}/{0} is the Unique name": "Nome univoco: {0}",
  "Unmanaged": "Non gestita",
  "Update Extension": "Update Extension",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Upload changes": "Carica modifiche",
  "Upload failed. Please try again later.": "Caricamento non riuscito. Riprovare in seguito.",
  "Use current site folder": "Usa cartella del sito corrente",
  "User cancelled opening results.": "L'utente ha annullato l'apertura dei risultati.",
  "User: {0}/The {0} represents auth profile's user name (email address))": "Utente: {0}",
  "Using custom CodeQL query suite: {0}": "Uso della suite di query di CodeQL personalizzata: {0}",
  "Using default query suite: {0}": "Uso della suite di query predefinita: {0}",
<<<<<<< HEAD
=======
  "VS Code - PAC CLI authentication mismatch detected": "VS Code - Rilevata mancata corrispondenza dell'autenticazione dell'interfaccia della riga di comando PAC",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "We encountered an error preparing the files for edit.": "Si è verificato un errore durante la preparazione dei file per la modifica.",
  "Web files": "File Web",
  "Webfile(s) added successfully": "Aggiunta file Web completata",
  "Webpage names should contain only letters, numbers, hyphens, or underscores.": "I nomi delle pagine Web possono contenere solo lettere, numeri, segni meno e caratteri di sottolineatura.",
<<<<<<< HEAD
=======
  "Website ID is not available": "L'ID del sito Web non è disponibile",
  "Website ID is required but not provided": "L'ID del sito Web è obbligatorio ma non è stato specificato",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Website Id: {0}/{0} is the website ID": "ID sito Web: {0}",
  "Website Url: {0}/{0} is the website Url": "URL sito Web: {0}",
  "Website not found in the environment. Please check the credentials and login with correct account.": "Sito Web non trovato nell'ambiente. Controlla le credenziali e accedi con l'account corretto.",
  "What do you need help with?": "Per cosa hai bisogno di aiuto?",
  "Whether it’s HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.": "Indipendentemente dal codice che vuoi usare, HTML, CSS, JS o Liquid, descrivi ciò che ti serve e l'IA farà il resto.",
  "Working on it...": "Operazione in corso...",
  "Write JavaScript code for form field validation to check phone field value is in the valid format.": "Scrivi codice JavaScript per la convalida del campo del modulo per verificare che il valore del campo telefono sia nel formato valido.",
  "Write JavaScript code to highlight the row where email field is empty in table list.": "Scrivi codice JavaScript per evidenziatore la riga in cui il campo del messaggio e-mail è vuoto nell'elenco delle tabelle.",
  "Write web API code to query active contact records.": "Scrivi codice API Web per eseguire una query sui record del contatto attivi.",
  "Yes": "Sì",
<<<<<<< HEAD
  "You are editing a live, public site ": "Stai modificando un sito pubblico live ",
  "You can use this in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot with @powerpages</a> and leverage best of both world.": "Puoi utilizzarlo in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot con @powerpages</a> e sfruttare il meglio entrambe le soluzioni.",
=======
  "You are currently connected to a different environment. Would you like to switch to the required environment?": "Al momento sei connesso a un ambiente diverso. Vuoi passare all'ambiente richiesto?",
  "You are editing a live, public site ": "Stai modificando un sito pubblico live ",
  "You can use this in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot with @powerpages</a> and leverage best of both world.": "Puoi utilizzarlo in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot con @powerpages</a> e sfruttare il meglio entrambe le soluzioni.",
  "You need to authenticate with Power Platform to download the site. Would you like to authenticate now?": "Devi eseguire l'autenticazione con Power Platform per scaricare il sito. Vuoi eseguire l'autenticazione ora?",
>>>>>>> d85e5a1a658d0ac54bb86a2d86262ecd99231241
  "Your preview isn't updated. Please upload your site to see the latest changes.": "L'anteprima non è aggiornata. Carica il sito per vedere le modifiche più recenti.",
  "dotnet sdk 6.0 or greater must be installed/Do not translate 'dotnet' or 'sdk'": "È necessario installare dotnet SDK 6.0 o versione successiva",
  "{0} created!/{0} will be replaced by the entity type.": "{0} creato."
}