{
  " End of Code Block ": " Fin del bloque de código ",
  "(click to expand diff)": "(haga clic para expandir las diferencias)",
  "1 file changed": "1 archivo cambiado",
  "@PowerPages is not yet available in your region.": "@PowerPages aún no está disponible en su región.",
  "A content snippet with the same name already exists. Please enter a different name.": "Ya existe un fragmento de contenido con el mismo nombre. Especifique otro nombre.",
  "A page template with the same name already exists. Please enter a different name.": "Ya existe una plantilla de página con el mismo nombre. Especifique otro nombre.",
  "A webpage with the same name already exists. Please enter a different name.": "Ya existe una página web con el mismo nombre. Especifique otro nombre.",
  "A webtemplate with the same name already exists. Please enter a different name.": "Ya existe una plantilla web con el mismo nombre. Especifique otro nombre.",
  "AI features have been disabled by your organization. Contact your admin for details. [Learn more](https://go.microsoft.com/fwlink/?linkid=2285848)": "Su organización ha deshabilitado las características de IA. Póngase en contacto con el administrador para obtener más información. [Más información](https://go.microsoft.com/fwlink/?linkid=2285848)",
  "AI-generated content can contain mistakes": "El contenido generado por IA puede contener errores",
  "Accounts don't match, data may not load.": "Las cuentas no coinciden, es posible que los datos no se carguen.",
  "Activating CodeQL extension...": "Activando la extensión CodeQL...",
  "Activating SARIF viewer extension...": "Activando la extensión del visor SARIF...",
  "Active Sites": "Sitios activos",
  "Active auth profile is not found or has expired. Please try again.": "El perfil de autenticación activo no se encuentra o ha expirado. Vuelva a intentarlo.",
  "Active auth profile is not found or has expired. To create a new auth profile, enter the environment URL.": "El perfil de autenticación activo no se encuentra o ha expirado. Para crear un nuevo perfil de autenticación, introduzca la dirección URL del entorno.",
  "Add content snippet name (name should be unique)": "Agregar el nombre del fragmento de contenido (el nombre debe ser único)",
  "Added Locally": "Agregado localmente",
  "Added default query suite to config: {0}": "Se agregó un conjunto de consultas predeterminado a la configuración: {0}",
  "Added locally": "Agregado localmente",
  "Adding {0} web file(s). Existing files will be skipped/{0} represents the number of web files": "Agregando {0} archivos web. Se omitirán los archivos existentes",
  "All": "Todo",
  "All changed files are binary files (e.g., images) and cannot be displayed in the diff viewer. You can view them individually in the file tree.": "Todos los archivos modificados son archivos binarios (por ejemplo, imágenes) y no se pueden mostrar en el visor de diferencias. Puede verlos individualmente en el árbol de archivos.",
  "An imported comparison already exists for this site. Do you want to replace it?": "Ya existe una comparación importada para este sitio. ¿Desea reemplazarla?",
  "Analysis complete! Results saved to: {0}": "¡Análisis completo! Resultados guardados en: {0}",
  "Analysis completed using query suite: {0}": "Análisis completado con el conjunto de consultas: {0}",
  "Are you sure you want to clear all the Auth Profiles?": "¿Seguro que desea borrar todos los perfiles de autenticación?",
  "Are you sure you want to delete the Auth Profile {0}-{1}?/{0} is the user name, {1} is the URL of environment of the auth profile": "¿Seguro que desea eliminar el perfil de autenticación {0}-{1}?",
  "Are you sure you want to discard all {0} local changes in '{1}'?\n\nLocal path: {2}\n\nThis action cannot be undone./Confirmation message before discarding all local changes in a site.": "¿Está seguro de que desea descartar todos los {0} cambios locales en \"{1}\"?\n\nRuta de acceso local: {2}\n\nEsta acción no se puede deshacer.",
  "Are you sure you want to discard local changes to '{0}'? This action cannot be undone./Confirmation message before discarding local changes to a file.": "¿Está seguro de que desea descartar los cambios locales en \"{0}\"? Esta acción no se puede deshacer.",
  "Are you sure you want to discard local changes to all {0} files in '{1}'? This action cannot be undone./Confirmation message before discarding all local changes in a folder.": "¿Está seguro de que desea descartar los cambios locales en todos los archivos de {0} en “{1}”? Esta acción no se puede deshacer.",
  "Arrow icon": "Icono de flecha",
  "Authenticating...": "Autenticando...",
  "Authentication failed after user initiated auth": "Error de autenticación después de que el usuario iniciara la autenticación",
  "Authentication failed. Please login and try again.": "No se pudo autenticar. Inicie sesión y vuelva a intentarlo.",
  "Authentication failed. Please try again.": "Error de autenticación. Inténtelo de nuevo.",
  "Authentication required...": "Se requiere autenticación...",
  "Authorization Failed. Please run again to authorize it": "No se pudo autorizar. Vuelva a ejecutarla para autorizarla",
  "Be careful making changes. Anyone can see the changes you make immediately. Choose Edit the site to make edits, or close the editor tab to cancel without editing.": "Tenga cuidado al hacer cambios. Cualquier usuario puede ver inmediatamente los cambios que usted realice. Elija Editar el sitio para realizar cambios o cierre la pestaña del editor para cancelar sin hacer cambios.",
  "Be careful when you're updating public sites. The changes you make are visible to anyone immediately. Do you want to continue?": "Tenga cuidado cuando actualice sitios públicos. Los cambios que realice serán visibles para cualquier persona inmediatamente. ¿Desea continuar?",
  "Binary file - content comparison not available": "Archivo binario: comparación de contenido no disponible",
  "Binary file content is not available in imported comparisons. The original file was not included in the export.": "El contenido del archivo binario no está disponible en las comparaciones importadas. El archivo original no se incluyó en la exportación.",
  "Browse...": "Examinar...",
  "Cancel": "Cancelar",
  "Cannot debug: Please open a server logic file (.js) from the server-logics folder.": "No se puede depurar: abra un archivo de lógica de servidor (.js) desde la carpeta server-logics.",
  "Cannot install Power Pages generator. Please install npm and try again./Do not translate 'npm'": "No se puede instalar el generador de Power Pages. Instale npm y vuelva a intentarlo.",
  "Cannot install Power Pages generator: {0}/{0} represents the error message returned from the exception": "No se puede instalar el generador de Power Pages: {0}",
  "Cannot install pac CLI: {0}/{0} represents the error message returned from the exception": "No se puede instalar pac CLI: {0}",
  "Cannot refresh an imported comparison. Import a new file or run a new comparison.": "No se puede actualizar una comparación importada. Importe un archivo nuevo o ejecute una nueva comparación.",
  "Changed Files": "Archivos cambiados",
  "Changing environment...": "Cambiando entorno...",
  "Check the URL and verify the parameters are correct": "Compruebe la dirección URL y asegúrese de que los parámetros sean correctos",
  "Checking environment...": "Comprobando entorno...",
  "Checking for active auth profile...": "Buscando un perfil de autenticación activo...",
  "Choose page template": "Elegir plantilla de página",
  "Choose parent page": "Elegir página primaria",
  "Choose web template": "Elegir plantilla web",
  "Clear": "Borrar",
  "Clear All": "Borrar todo",
  "Clear all results?": "¿Borrar todos los resultados?",
  "Clear result?": "¿Borrar resultado?",
  "Clearing cache. See [details](https://aka.ms/pages-clear-cache)./This is a markdown formatting which must persist across translations.The second line should be '[TRANSLATION HERE](https://aka.ms/pages-clear-cache).', keeping brackets and the text in the parentheses unmodified": "Borrando caché. Consulte [detalles](https://aka.ms/pages-clear-cache).",
  "Click to authenticate with a matching account": "Haga clic para autenticarse con una cuenta coincidente",
  "Click to compare your local site with an environment": "Haga clic para comparar el sitio local con un entorno",
  "Close": "Cerrar",
  "Cloud Instance: {0}/The {0} represents profile's Azure Cloud Instances": "Instancia en la nube: {0}",
  "Cluster category: {0}/{0} is the Cluster category": "Categoría de clúster: {0}",
  "Cluster environment: {0}/{0} is the Cluster environment": "Entorno de clúster: {0}",
  "Cluster geo name: {0}/{0} is the cluster geo name": "Nombre de geoárea del clúster: {0}",
  "Code Block ": "Bloque de código ",
  "CodeQL CLI is not installed or not in PATH. Please install the CodeQL extension or add CodeQL CLI to your PATH.": "La CLI de CodeQL no está instalada o no está en PATH. Instale la extensión CodeQL o agregue la CLI de CodeQL a su RUTA.",
  "CodeQL analysis completed successfully with no issues found! 🎉": "¡El análisis de CodeQL se completó con éxito sin encontrar problemas! 🎉",
  "CodeQL analysis completed. Would you like to open the full results file?": "Análisis de CodeQL completado. ¿Desea abrir el archivo de resultados completo?",
  "CodeQL analysis failed: {0}": "Error en el análisis de CodeQL: {0}",
  "CodeQL database created successfully. You can now run queries from the CodeQL extension.": "La base de datos CodeQL se creó correctamente. Ahora puede ejecutar consultas desde la extensión CodeQL.",
  "CodeQL database created. You can now:\n\n1. Run custom queries if you have any\n2. Use the prebuilt queries from the CodeQL extension\n\nCheck the CodeQL extension panel for available queries.": "Base de datos de CodeQL creada. Ahora puede:\n\n1. Ejecutar consultas personalizadas si tiene alguna\n2. Usar las consultas predefinidas de la extensión CodeQL\n\nConsulte el panel de la extensión CodeQL para ver las consultas disponibles.",
  "CodeQL extension is not installed.": "La extensión CodeQL no está instalada.",
  "CodeQL global storage path does not exist: {0}": "La ruta de almacenamiento global de CodeQL no existe: {0}",
  "CodeQL screening failed. Please try again later.": "Error en la verificación con CodeQL. Inténtelo de nuevo más tarde.",
  "CodeQL screening is not supported for this site.": "La verificación con CodeQL no es compatible con este sitio.",
  "CodeQL screening started. Creating database and analyzing": "Comenzó la verificación con CodeQL. Creando base de datos y analizando",
  "CodeQL version: {0}": "Versión de CodeQL: {0}",
  "Collapse All": "Contraer todo",
  "Command completed successfully (exit code: {0})": "El comando se completó correctamente (código de salida: {0})",
  "Command completed successfully.": "El comando se completó correctamente.",
  "Command failed with exit code {0}: {1}": "Error en el comando con el código de salida {0}: {1}",
  "Command failed with exit code: {0}": "Error en el comando con el código de salida: {0}",
  "Compare site with environment": "Comparar con el entorno",
  "Compare site...": "Comparar sitio...",
  "Compare: {0} (Remote ↔ Local)/Title for the multi-diff editor when comparing all files in a site.": "Comparar: {0} (Remoto ↔ Local)",
  "Comparing files...": "Comparando archivos...",
  "Comparison Details": "Detalles de comparación",
  "Comparison exported successfully to '{0}'./Success message when export is saved. {0} is the file path.": "La comparación se exportó correctamente a \"{0}\".",
  "Comparison for '{0}' imported successfully./Success message when import is complete. {0} is the site name.": "La comparación de \"{0}\" se importó correctamente.",
  "Comparison has been refreshed with the latest data from the environment.": "Se actualizó la comparación con los datos más recientes del entorno.",
  "Confirm": "Confirmar",
  "Continue with Copilot for Power Pages": "Continuar con Copilot para Power Pages",
  "Copied to clipboard!": "Copiado al portapapeles.",
  "Copilot Response": "Respuesta de Copilot",
  "Copilot illustration": "Ilustración de Copilot",
  "Copy to clipboard": "Copiar al Portapapeles",
  "Could not determine user data path.": "No se pudo determinar la ruta de datos del usuario.",
  "Could not locate CodeQL CLI in global storage.": "No se pudo encontrar la CLI de CodeQL en el almacenamiento global.",
  "Created On:": "Fecha de creación:",
  "Created PowerPages config file at {0} with default query suite: {1}": "Archivo de configuración de PowerPages creado en {0} con el conjunto de consultas predeterminado: {1}",
  "Created on: {0}/{0} is the created date": "Fecha de creación: {0}",
  "Creating CodeQL database...": "Creación de una base de datos CodeQL...",
  "Creating {0}.../{0} will be replaced by the entity type.": "Creando {0}...",
  "Creator:": "Creador:",
  "Creator: {0}/{0} is the creator": "Creador: {0}",
  "Current": "Actual",
  "Current site path not found.": "No se encontró la ruta de acceso del sitio actual.",
  "Current site path not found. Please ensure you have a site folder open.": "No se encontró la ruta de acceso del sitio actual. Asegúrese de tener abierta una carpeta del sitio.",
  "Data Model:": "Modelo de datos:",
  "Data model version: {0}/{0} is the data model version": "Versión del modelo de datos: {0}",
  "Database location: {0}": "Ubicación de la base de datos: {0}",
  "Debug": "Depurar",
  "Debug Current File": "Depurar archivo actual",
  "Debug Current Server Logic": "Depurar la lógica de servidor actual",
  "Debug Power Pages Server Logic": "Depurar la lógica de servidor de Power Pages",
  "Debug this server logic file": "Depurar este archivo de lógica de servidor",
  "Default Environment: {0}/The {0} represents profile's resource/environment URL": "Entorno predeterminado: {0}",
  "Deleted Locally": "Eliminado localmente",
  "Deleted locally": "Eliminado localmente",
  "Difference": "Diferencia",
  "Discard Changes": "Descartar cambios",
  "Dislike something? Tell us more.": "¿Hay algo que no le guste? Cuéntenos más.",
  "Display Name: {0}\nUnique Name: {1}\nVersion: {2}\nType: {3}/This is a multi-line tooltipThe {0} represents Solution's Friendly / Display nameThe {1} represents Solution's unique nameThe {2} represents Solution's Version numberThe {3} represents Solution's Type (Managed or Unmanaged), but that test is localized separately.": "Nombre para mostrar: {0}\nNombre único: {1}\nVersión: {2}\nTipo: {3}",
  "Do not show again": "No volver a mostrar",
  "Don't Show Again": "No volver a mostrar",
  "Download Power Pages Site": "Descargar sitio de Power Pages",
  "Download VS Code": "Descargar VS Code",
  "Download failed: {0}": "Error de descarga: {0}",
  "Download is complete. You can now view the report.": "Se completó la descarga. Ya puede ver el informe.",
  "Downloading {0} site metadata ([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel \"Show download output\")).../This is a markdown formatting which must persist across translations.": "Descargando metadatos del sitio {0} ([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel \"Mostrar salida de descarga\"))...",
  "Edit the site": "Editar el sitio",
  "Enhanced Data Model": "Modelo de datos mejorado",
  "Enter Organization ID": "Escriba el id. de organización",
  "Enter name": "Escribir nombre",
  "Enter the environment URL": "Escribir la URL del entorno",
  "Enter the name of the web template": "Escriba el nombre de la plantilla web",
  "Environment ID is not available": "El id. de entorno no está disponible",
  "Environment ID is required": "El id. de entorno es obligatorio",
  "Environment ID: {0}/{0} is the Environment ID": "Id. de entorno: {0}",
  "Environment changed successfully.": "Se ha cambiado el entorno correctamente.",
  "Environment:": "Entorno:",
  "Error accessing CodeQL extension: {0}": "Error al acceder a la extensión CodeQL: {0}",
  "Error creating config file: {0}": "Error al crear el archivo de configuración: {0}",
  "Error during CodeQL analysis: {0}": "Error durante el análisis de CodeQL: {0}",
  "Error getting CLI path from extension API: {0}": "Error al obtener la ruta de la CLI desde la API de extensión: {0}",
  "Error opening results file: {0}": "Error al abrir el archivo de resultados: {0}",
  "Error opening with SARIF viewer: {0}": "Error al abrir con SARIF Viewer: {0}",
  "Error reading config file: {0}": "Error al leer el archivo de configuración: {0}",
  "Error reading results: {0}": "Error al leer los resultados: {0}",
  "Error searching for CodeQL CLI: {0}": "Error al buscar la CLI de CodeQL: {0}",
  "Error updating config file: {0}": "Error al actualizar el archivo de configuración: {0}",
  "Executing: {0}": "Ejecutando: {0}",
  "Expand All": "Expandir todo",
  "Explain the following code snippet:": "Explique el siguiente fragmento de código:",
  "Explain the following code {% include 'Page Copy'%}": "Explicar el siguiente código {% include 'Page Copy'%}",
  "Export Site Comparison": "Exportar comparación de sitios",
  "Exporting comparison...": "Exportando comparación...",
  "Extension installed but API not available yet. Opening as text file...": "Extensión instalada, pero la API aún no está disponible. Abriendo como archivo de texto...",
  "Failed to create a new Power Pages site. Please try again.": "No se pudo crear un sitio nuevo de Power Pages. Vuelva a intentarlo.",
  "Failed to create: {0}./{0} will be replaced by the error message.": "No se pudo crear: {0}.",
  "Failed to disable PAC telemetry.": "No se pudo deshabilitar la telemetría de PAC.",
  "Failed to discard local changes: {0}/Error message when discarding local changes fails.": "No se pudieron descartar los cambios locales: {0}",
  "Failed to enable PAC telemetry.": "No se pudo habilitar la telemetría de PAC.",
  "Failed to export comparison: {0}/Error message when export fails. {0} is the error message.": "No se pudo exportar la comparación: {0}",
  "Failed to fetch some files.": "No se pudieron capturar algunos archivos.",
  "Failed to generate HTML report: {0}/Error message when HTML report generation fails. {0} is the error message.": "No se pudo generar el informe HTML: {0}",
  "Failed to generate VS Code Desktop URL: {0}": "No se pudo generar la URL de VS Code Desktop: {0}",
  "Failed to get file ready for edit: {0}": "No se pudo preparar el archivo para su edición: {0}",
  "Failed to get organization details. Please try again later": "No se pudieron obtener los detalles de la organización. Vuelva a intentarlo más tarde",
  "Failed to get website endpoint. Please try again later": "No se pudo obtener el punto de conexión de sitio web. Vuelva a intentarlo más tarde",
  "Failed to handle Power Pages URI: {0}": "No se pudo controlar el URI de Power Pages: {0}",
  "Failed to import comparison: {0}/Error message when import fails. {0} is the error message.": "No se pudo importar la comparación: {0}",
  "Failed to initialize Server Logic debugger: {0}": "No se pudo inicializar el depurador de lógica de servidor: {0}",
  "Failed to install SARIF viewer extension. Opening results as text file.": "No se pudo instalar la extensión del visor SARIF. Abriendo los resultados como archivo de texto.",
  "Failed to install SARIF viewer extension: {0}": "No se pudo instalar la extensión SARIF Viewer: {0}",
  "Failed to open in VS Code Desktop: {0}": "No se pudo abrir en VS Code Desktop: {0}",
  "Failed to switch to the required environment. Please sign in with an account that has access to the target environment using 'pac auth create' command.": "No se pudo cambiar al entorno requerido. Inicie sesión con una cuenta que tenga acceso al entorno de destino usando el comando \"pac auth create\".",
  "Feature is not enabled for this geo.": "La característica no está habilitada para esta geoárea.",
  "Feedback": "Comentarios",
  "Fetching websites from '{0}'.../Message shown while fetching websites from an environment. {0} is the environment name.": "Capturando sitios web de \"{0}\"...",
  "Fetching your file ...": "Capturando su archivo...",
  "File is too large for detailed diff comparison": "El archivo es demasiado grande para la comparación detallada de diferencias",
  "File is too large to display diff (exceeds 5MB)": "El archivo es demasiado grande para mostrar la diferencia (supera los 5 MB)",
  "File might be referenced by name {0} here./{0} represents the name of the file": "Se puede hacer referencia al archivo por su nombre {0} aquí.",
  "File(s) already exist. No new files to add": "Los archivos ya existen. No hay archivos nuevos que agregar",
  "File: {0}": "Archivo: {0}",
  "Find differences between your remote site and local workspace": "Encuentre las diferencias entre el sitio remoto y el área de trabajo local",
  "Found CodeQL CLI at: {0}": "Se encontró la CLI de CodeQL en: {0}",
  "Found CodeQL CLI via extension API: {0}": "Se encontró la CLI de CodeQL a través de la API de extensión: {0}",
  "Found PowerPages config file: {0}": "Archivo de configuración de PowerPages encontrado: {0}",
  "Found distribution directories: {0}": "Directorios de distribución encontrados: {0}",
  "Found {0} issue(s):": "{0} problema(s) encontrado(s):",
  "Friendly name: {0}/{0} is the website name": "Nombre descriptivo: {0}",
  "GETTING STARTED": "INTRODUCCIÓN",
  "Generated by": "Generado por",
  "Generated:": "Generado:",
  "Generating a new Power Pages site...": "Generando un sitio nuevo de Power Pages...",
  "Generating webpages...": "Generando páginas web...",
  "Get GitHub Copilot to try @powerpages": "Hacer que GitHub Copilot pruebe @powerpages",
  "Getting organization details...": "Obteniendo detalles de la organización...",
  "Getting region information...": "Obteniendo información de la región...",
  "Getting website endpoint...": "Obteniendo punto de conexión de sitio web...",
  "HTML report saved successfully to '{0}'./Success message when HTML report is saved. {0} is the file path.": "El informe HTML se guardó correctamente en \"{0}\".",
  "Here are a few suggestions to get you started": "Aquí le presentamos algunas sugerencias para empezar",
  "Hi": "Hola",
  "Hi! @powerpages can help you write, edit, and even summarize your website code.": "¡Hola! @powerpages puede ayudarle a escribir, editar e incluso resumir el código de su sitio web.",
  "Hi! Instantly generate code for Power Pages sites by typing in what you need. To start using Copilot, log in to your Microsoft account.": "¡Hola! Genere al instante código para sitios de Power Pages escribiendo lo que necesita. Para empezar a usar Copilot, inicie sesión en su cuenta Microsoft.",
  "Hi! Power Pages lets you build secure, professional websites that you can quickly configure and publish across web browsers and devices.\n\nTo create your website, visit the [Power Pages](https://powerpages.microsoft.com/).\nReturn to this chat and @powerpages can help you write and edit your website code.": "Hola: Power Pages le permite crear sitios web seguros y profesionales que puede configurar y publicar rápidamente en exploradores web y dispositivos.\n\nPara crear su sitio web, visite [Power Pages](https://powerpages.microsoft.com/).\nVuelve a este chat y @powerpages puede ayudarle a escribir y editar el código de su sitio web.",
  "Hi! Your Microsoft account doesn’t currently support Copilot. Contact your admin for details.": "Hola: Su cuenta de Microsoft no es compatible actualmente con Copilot. Póngase en contacto con su administrador para obtener más información.",
  "Import Site Comparison": "Importar comparación de sitios",
  "Importing comparison...": "Importando comparación...",
  "In your own words, describe what you need. You can get help with writing code for Power Pages sites in HTML, CSS, and JS languages.": "Describa con sus propias palabras lo que necesita. Puede obtener ayuda con la escritura de código para sitios de Power Pages en los lenguajes HTML, CSS y JS.",
  "Inactive Sites": "Sitios inactivos",
  "Initializing site preview": "Inicializando la vista previa del sitio",
  "Initializing site preview. Please try again after few seconds.": "Inicializando la vista previa del sitio. Vuelva a intentarlo después de unos segundos.",
  "Insert code into editor": "Insertar código en el editor",
  "Install": "Instalar",
  "Installing Power Pages generator(v{0}).../{0} represents the version number": "Instalando el generador de Power Pages (v{0})...",
  "Installing SARIF viewer extension...": "Instalando la extensión del visor SARIF...",
  "Instance url: {0}/{0} is the Instance Url": "Dirección URL de la instancia: {0}",
  "Invalid file format. The file does not contain valid metadata diff data.": "Formato de archivo no válido. El archivo no contiene datos de diferencias de metadatos válidos.",
  "Learn More": "Más información",
  "Learn more about Copilot": "Más información sobre Copilot",
  "Let Copilot help you code": "Deje que Copilot le ayude a programar",
  "Like something? Tell us more.": "¿Hay algo que le guste? Cuéntenos más.",
  "Line: {0}": "Línea: {0}",
  "Loading...": "Cargando...",
  "Local": "Local",
  "Local Site": "Sitio local",
  "Login": "Inicio de sesión",
  "Login to PowerPages": "Iniciar sesión en PowerPages",
  "Looking for CodeQL CLI in: {0}": "Buscando la CLI de CodeQL en: {0}",
  "Make sure AI-generated content is accurate and appropriate before using. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Learn more</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">View\n              terms</a>": "Asegúrese de que el contenido generado por IA sea preciso y apropiado antes de usarlo. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Más información</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">Ver\n              términos y condiciones</a>",
  "Make sure AI-generated content is accurate and appropriate before using. [Learn more](https://go.microsoft.com/fwlink/?linkid=2240145) | [View terms](https://go.microsoft.com/fwlink/?linkid=2189520)": "Asegúrese de que el contenido generado por IA sea preciso y adecuado antes de usarlo. [Más información](https://go.microsoft.com/fwlink/?linkid=2240145) | [Ver términos](https://go.microsoft.com/fwlink/?linkid=2189520)",
  "Managed": "Administrado",
  "Matching Site": "Sitio de correspondencia",
  "Maximum 30 characters allowed": "Se permite un máximo de 30 caracteres",
  "Microsoft wants your feedback": "Microsoft desea recibir sus comentarios",
  "Missing required field: {0}/Error when importing a file that is missing a required field.": "Falta el campo obligatorio: {0}",
  "Missing required site information for reactivation.": "Falta información del sitio necesaria para la reactivación.",
  "Modified": "Modificado",
  "NEW": "NUEVO",
  "Name/Rename Auth Profile": "Asignar nombre/Cambiar nombre del perfil de autenticación",
  "Name: {0}\nURL: {1}\nEnvironment ID: {2}\nOrganization ID: {3}/This is a multi-line tooltipThe {0} represents Dataverse Environment's Friendly / Display nameThe {1} represents Dataverse Environment's URLThe {2} represents Dataverse Environment's Environment ID (GUID)The {3} represents Dataverse Environment's Organization ID (GUID)": "Nombre: {0}\nURL: {1}\nId. de entorno: {2}\nId. de organización: {3}",
  "Name: {0}/The {0} represents the optional name the user provided for the profile)": "Nombre: {0}",
  "New Content Snippet": "Nuevo fragmento de contenido",
  "New Page Template": "Nueva plantilla de página",
  "New Webpage": "Nueva página web",
  "No": "No",
  "No Website Data Found in Current Directory. Please switch to a directory that contains the PAC downloaded website data to continue.": "No se encontraron datos del sitio web en el directorio actual. Cambie a un directorio que contenga los datos del sitio web descargado de PAC para continuar.",
  "No active editor found.": "No se encontraron editores activos.",
  "No active editor. Please open a server logic file.": "No hay editores activos. Abra un archivo de lógica de servidor.",
  "No analysis results found.": "No se encontraron resultados de análisis.",
  "No differences found between the remote site and your local workspace.": "No se han encontrado diferencias entre el sitio remoto y el área de trabajo local.",
  "No environments found": "No se encontraron entornos",
  "No files in this category": "No hay archivos en esta categoría",
  "No issues found!": "No se han encontrado problemas.",
  "No message": "Sin mensaje",
  "No page templates found": "No se encontró ninguna plantilla de página",
  "No parent pages found for adding webfile": "No se ha encontrado ninguna página primaria para agregar el archivo web",
  "No sites found": "No se encontraron sitios",
  "No sites found in the selected environment.": "No se encontraron sitios en el entorno seleccionado.",
  "No webpages found": "No se ha encontrado ninguna página web",
  "No workspace folder found": "No se ha encontrado ninguna carpeta del área de trabajo",
  "No workspace folder is open. Please open a folder containing your Power Pages site.": "No hay ninguna carpeta de área de trabajo abierta. Abra una carpeta que contenga el sitio de Power Pages.",
  "No workspace folder opened. Please open a site folder to preview.": "No se ha abierto ninguna carpeta del área de trabajo. Abra una carpeta del sitio para obtener una vista previa.",
  "Not Now": "Ahora no",
  "Object ID: {0}/{0} is the Object ID": "Id. de objeto: {0}",
  "One or more attribute names have been changed or removed. Contact your admin.": "Se han cambiado o quitado uno o más nombres de atributo. Póngase en contacto con su administrador.",
  "Open Folder": "Abrir carpeta",
  "Open Report": "Abrir informe",
  "Open Results": "Abrir resultados",
  "Open as Text": "Abrir como texto",
  "Open in New Workspace": "Abrir en nueva área de trabajo",
  "Open in Power Pages studio": "Abrir en el estudio de Power Pages",
  "Open in VS Code Desktop": "Abrir en VS Code Desktop",
  "Opening in VS Code Desktop. If it doesn't open or shows an error, you may need to install VS Code or update the Power Platform extension.": "Abriendo en VS Code Desktop. Si no se abre o muestra un error, es posible que necesite instalar VS Code o actualizar la extensión de Power Platform.",
  "Opening preview site...": "Abriendo sitio de versión preliminar...",
  "Opening results with SARIF viewer...": "Abriendo resultados con SARIF Viewer...",
  "Opening results with newly installed SARIF viewer...": "Abriendo resultados con SARIF Viewer recién instalado...",
  "Opening site preview...": "Abriendo la vista previa del sitio...",
  "Operation failed. See output panel for details.": "No se pudo realizar la operación. Consulte el panel de salida para obtener más información.",
  "Organization ID: {0}/{0} is the Organization ID": "Id. de organización: {0}",
  "Organization URL is required": "La dirección URL de la organización es obligatoria",
  "Other Sites": "Otros sitios",
  "PAC CLI": "PAC CLI",
  "PAC Telemetry disabled": "Telemetría de PAC deshabilitada",
  "PAC Telemetry enabled": "Telemetría de PAC habilitada",
  "PREVIEW": "VERSIÓN PRELIMINAR",
  "Page Template name cannot be empty.": "El nombre de la plantilla de página no puede estar vacío.",
  "Please enter a name for the content snippet.": "Escriba un nombre para el fragmento de contenido.",
  "Please enter a name for the page template.": "Escriba un nombre para la plantilla de página.",
  "Please enter a name for the web template.": "Escriba un nombre para la plantilla web.",
  "Please enter a name for the webpage.": "Escriba un nombre para la página web.",
  "Please login to preview the site.": "Inicie sesión para obtener una vista previa del sitio.",
  "Please open a server logic file (.js) from the server-logics folder.": "Abra un archivo de lógica de servidor (.js) desde la carpeta server-logics.",
  "Please select the folder that contains your compiled output to upload your site.": "Seleccione la carpeta que contiene la salida compilada para cargar su sitio.",
  "Power Pages": "Power Pages",
  "Power Pages Copilot is now connected to the environment: {0} : {1}/{0} represents the environment name": "Power Pages Copilot está conectado ahora al entorno {0}: {1}",
  "Power Pages Server Logic detected! You can now debug your server logic files with breakpoints and IntelliSense.": "Se detectó la lógica de servidor de Power Pages. Ya es posible depurar los archivos de lógica de servidor con puntos de interrupción e IntelliSense.",
  "Power Pages site download completed successfully. Would you like to open the downloaded site folder?": "La descarga del sitio de Power Pages se completó correctamente. ¿Le gustaría abrir la carpeta del sitio web que ha descargado?",
  "Power Pages studio URL is not available": "La dirección URL del estudio de Power Pages no está disponible",
  "Power Platform Tools - Site Comparison": "Herramientas de Power Platform: comparación de sitios",
  "Power Platform Tools VS Code Extension": "Extensión de herramientas de Power Platform para VS Code",
  "Power Platform Tools: PAC CLI": "Herramientas de Power Platform: CLI de PAC",
  "PowerPages config file created successfully: {0}": "Archivo de configuración de PowerPages creado correctamente: {0}",
  "PowerPages config file updated successfully: {0}": "El archivo de configuración de PowerPages se actualizó correctamente: {0}",
  "Preparing pac CLI (v{0}).../{0} represents the version number": "Preparando pac CLI (v{0})...",
  "Preparing to open Power Pages site...": "Preparando para abrir el sitio de Power Pages...",
  "Preview site": "Sitio de versión preliminar",
  "Preview site URL is not valid": "La dirección URL del sitio de versión preliminar no es válida",
  "Primary query suite {0} failed: {1}": "Error de {0} del conjunto de consultas principal: {1}",
  "Process error: {0}": "Error de proceso: {0}",
  "Profile Kind: {0}/The {0} represents the profile type (Admin vs Dataverse)": "Tipo de perfil: {0}",
  "Ready to select download folder": "Listo para seleccionar la carpeta de descarga",
  "Refreshing comparison for {0} ([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel \"Show download output\")).../This is a markdown formatting which must persist across translations.": "Actualizando la comparación de {0} ([details](command:microsoft.powerplatform.pages.actionsHub.showOutputChannel \"Mostrar salida de descarga\"))...",
  "Remote": "Remoto",
  "Replace": "Reemplazar",
  "Response data is empty": "Los datos de respuesta están vacíos",
  "Results opened in SARIF viewer successfully.": "Los resultados se abrieron correctamente en SARIF Viewer.",
  "Run": "Ejecutar",
  "Run Server Logic": "Ejecutar lógica de servidor",
  "Run this server logic file without debugging": "Ejecutar este archivo de lógica de servidor sin depuración",
  "Running CodeQL analysis...": "Ejecutando análisis de CodeQL...",
  "SARIF viewer extension does not expose expected API. Falling back to text editor...": "La extensión del visor SARIF no expone la API esperada. Volviendo al editor de texto...",
  "SARIF viewer extension installed successfully. Activating...": "La extensión SARIF Viewer se instaló correctamente. Activando...",
  "SARIF viewer extension not found.": "No se encontró la extensión SARIF Viewer.",
  "Save HTML Report": "Guardar informe HTML",
  "Save Report": "Guardar informe",
  "Saving your file ...": "Guardando su archivo...",
  "Select Folder": "Seleccionar carpeta",
  "Select Folder for new PCF Control/Do not translate 'PCF' as it is a product name.": "Seleccione Carpeta para el nuevo control PCF",
  "Select Folder to Download Power Pages Site": "Seleccionar carpeta para descargar el sitio de Power Pages",
  "Select Type": "Seleccionar tipo",
  "Select a website to compare with": "Seleccione un sitio web con el que comparar",
  "Select an environment": "Seleccionar un entorno",
  "Select an environment to compare with": "Seleccionar un entorno con el que comparar",
  "Select folder for CodeQL database": "Seleccionar carpeta para la base de datos de CodeQL",
  "Select the folder that contains your compiled output": "Seleccione la carpeta que contiene la salida compilada",
  "Select the folder that will contain your project root for your site": "Seleccione la carpeta que contendrá la raíz del proyecto para su sitio",
  "Selection is empty.": "La selección está vacía.",
  "Selection is too large. Try making a shorter selection.": "La selección es demasiado grande. Intente acortar la selección.",
  "Server Logic debugging requires an open workspace.": "La depuración de lógica de servidor requiere un área de trabajo abierta.",
  "Session Details": "Detalles de la sesión",
  "Session ID: {0}/{0} is the Session ID": "Id. de sesión: {0}",
  "Show Diff": "Mostrar diferencias",
  "Show Output Panel": "Mostrar panel de salida",
  "Sign in to VS Code with PAC CLI account": "Iniciar sesión en VS Code con la cuenta de la CLI de PAC",
  "Site Comparison": "Comparación de sitios",
  "Site Comparison JSON": "JSON de comparación de sitios",
  "Site Comparison Report": "Informe de comparación de sitios",
  "Site Details": "Detalles del sitio",
  "Site Name:": "Nombre del sitio:",
  "Site Visibility:": "Visibilidad del sitio:",
  "Site download cancelled. Authentication is required to proceed.": "Descarga del sitio cancelada. Se requiere autenticación para continuar.",
  "Site download cancelled. Correct environment connection is required.": "Descarga del sitio cancelada. Se requiere una conexión de entorno correcta.",
  "Site download cancelled. No folder selected.": "Descarga del sitio cancelada. No hay ninguna carpeta seleccionada.",
  "Site download failed. Please try again later.": "Error en la descarga del sitio. Inténtelo de nuevo más tarde.",
  "Site management URL not found for the selected site. Please try again after refreshing the environment.": "No se encontró la dirección URL de administración del sitio para el sitio seleccionado. Vuelva a intentarlo después de actualizar el entorno.",
  "Site runtime preview feature is not enabled.": "La característica de vista previa en tiempo de ejecución del sitio no está habilitada.",
  "Site visibility: {0}/{0} is the site visibility": "Visibilidad del sitio: {0}",
  "Some references might be broken. Please check diagnostics for details.": "Es posible que algunas referencias estén rotas. Consulte los diagnósticos para ver más detalles.",
  "Something went wrong. Don’t worry, you can try again.": "Se ha producido un error. No se preocupe, puede intentarlo de nuevo.",
  "Standard Data Model": "Modelo de datos estándar",
  "Starting CodeQL analysis for: {0}": "Inicio del análisis de CodeQL para: {0}",
  "Submit": "Enviar",
  "Successfully discarded all {0} local changes in '{1}'./Success message after discarding all local changes in a site.": "Se descartaron correctamente todos los {0} cambios locales en \"{1}\".",
  "Successfully discarded local changes to '{0}'./Success message after discarding local changes to a file.": "Se descartaron correctamente los cambios locales en “{0}”.",
  "Successfully discarded local changes to {0} files in '{1}'./Success message after discarding all local changes in a folder.": "Se descartaron con éxito los cambios locales en {0} archivos de “{1}”.",
  "Switching environment...": "Cambiando de entorno...",
  "Tell us more.": "Cuéntenos más.",
  "Tenant ID: {0}/{0} is the Tenant ID": "Id. de inquilino: {0}",
  "The CodeQL extension is required to run this command. Do you want to install it now?": "Se requiere la extensión \"CodeQL\" para ejecutar este comando. ¿Desea instalarla ahora?",
  "The Power Pages generator is ready for use in your VS Code extension!": "¡El generador de Power Pages ya se puede usar en su extensión de VS Code!",
  "The SARIF Viewer extension is recommended for viewing CodeQL results. Would you like to install it now?": "Se recomienda la extensión SARIF Viewer para ver los resultados de CodeQL. ¿Desea instalarla ahora?",
  "The account signed in to VS Code differs from the one authenticated in PAC CLI (Power Platform CLI). This mismatch can cause data not to load or actions to fail because UI commands run through the CLI. To fix it, sign in to VS Code using the same account as your PAC CLI. If needed, you can update your PAC CLI authentication separately via the command line.": "La cuenta que inició sesión en VS Code difiere de la autenticada en la CLI de PAC (CLI de Power Platform). Esta falta de coincidencia puede hacer que los datos no se carguen o que se produzca un error en las acciones porque los comandos de la interfaz de usuario se ejecutan a través de la CLI. Para corregirlo, inicie sesión en VS Code con la misma cuenta que la CLI de PAC. Si es necesario, puede actualizar la autenticación de la CLI de PAC por separado a través de la línea de comandos.",
  "The extension 'Microsoft Edge Tools' is required to run this command. Do you want to install it now?/Do not translate 'Microsoft Edge Tools' ": "Se requiere la extensión \"Microsoft Edge Tools\" para ejecutar este comando. ¿Desea instalarla ahora?",
  "The name you want to give to this authentication profile": "Nombre que desea asignar a este perfil de autenticación",
  "The pac CLI is ready for use in your VS Code terminal!": "¡pac CLI ya se puede usar en su terminal de VS Code!",
  "The preview shown is for published changes. Please publish any pending changes to see them in the preview.": "La vista previa que se muestra corresponde a los cambios publicados. Publique los cambios pendientes para verlos en la vista previa.",
  "The website was not found in the selected environment. Please select a different environment.": "No se encontró el sitio web en el entorno seleccionado. Seleccione un entorno diferente.",
  "The website you selected is different from the local site. Are you sure you want to compare with this website?": "El sitio web seleccionado es diferente del sitio local. ¿Está seguro de que desea compararlo con este sitio web?",
  "There was a permissions problem with the server": "Se produjo un problema de permisos con el servidor",
  "There was a problem opening the workspace": "Hubo un problema al abrir el área de trabajo",
  "There’s a problem on the back end": "Hay un problema en el back-end",
  "This file was exported with a newer version of the extension. Please update your extension to import this file.": "Este archivo se exportó con una versión más reciente de la extensión. Actualice la extensión para importar este archivo.",
  "This will close all active comparison views. Your local files will not be affected.": "Esto cerrará todas las vistas de comparación activas. Los archivos locales no se verán afectados.",
  "This will close the active comparison view. Your local files will not be affected.": "Esto cerrará la vista de comparación activa. Los archivos locales no se verán afectados.",
  "Thumbs Down": "Pulgar hacia abajo",
  "Thumbs Up": "Pulgar hacia arriba",
  "Timestamp: {0}/{0} is the timestamp": "Marca de tiempo: {0}",
  "To know more, see <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">Copilot in Power Pages documentation.": "Para obtener más información, consulte la <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">documentación de Copilot en Power Pages.",
  "Tools": "Herramientas",
  "Total Changes": "Total de cambios",
  "Total Files:": "Total de archivos:",
  "Try @powerpages with GitHub Copilot": "Probar @powerpages con GitHub Copilot",
  "Try again": "Volver a intentarlo",
  "Try and be as specific as possible. Your feedback will be used to improve Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> View privacy details </a>": "Trate de ser lo más específico posible. Sus comentarios se utilizarán para mejorar Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> Ver información de privacidad </a>",
  "Unable to clear cache": "No se puede borrar la caché",
  "Unable to complete the request": "No se puede completar la solicitud",
  "Unable to find that app": "No se puede encontrar esa aplicación",
  "Unable to generate VS Code Desktop URL": "No se pudo generar la URL de VS Code Desktop",
  "Unable to locate website root folder.": "No se puede encontrar la carpeta raíz del sitio web.",
  "Unable to read file contents": "No se puede leer el contenido del archivo",
  "Unable to read local file": "No se puede leer el archivo local",
  "Unable to read one or both files": "No se pueden leer uno o ambos archivos",
  "Unable to read remote file": "No se puede leer el archivo remoto",
  "Unique name: {0}/{0} is the Unique name": "Nombre único: {0}",
  "Unknown": "Desconocido",
  "Unmanaged": "No administrado",
  "Unsupported version. This file was created with a newer version of the extension.": "Versión no compatible. Este archivo se creó con una versión más reciente de la extensión.",
  "Update Extension": "Actualizar extensión",
  "Upload changes": "Cargar cambios",
  "Upload failed. Please try again later.": "Error de carga. Vuelva a intentarlo más tarde.",
  "Use File → Open Folder to select a folder with a Power Pages site": "Usar archivo → Abrir carpeta para seleccionar una carpeta con un sitio de Power Pages",
  "Use current site folder": "Usar la carpeta del sitio actual",
  "User cancelled authentication": "Autenticación cancelada por el usuario",
  "User cancelled environment switch": "Cambio de entorno cancelado por el usuario",
  "User cancelled folder selection": "El usuario canceló la selección de carpetas",
  "User cancelled opening results.": "El usuario canceló la apertura de los resultados.",
  "User: {0}/The {0} represents auth profile's user name (email address))": "Usuario: {0}",
  "Using custom CodeQL query suite: {0}": "Uso del conjunto de consultas de CodeQL personalizado: {0}",
  "Using default query suite: {0}": "Uso del conjunto de consultas predeterminado: {0}",
  "VS Code - PAC CLI authentication mismatch detected": "VS Code: se detectó un error de coincidencia de autenticación de la CLI de PAC",
  "Validating authentication...": "Validando la autenticación...",
  "We encountered an error preparing the files for edit.": "Se detectó un error al preparar los archivos para su edición.",
  "Web files": "Archivos web",
  "Webfile(s) added successfully": "Sitios web agregados correctamente",
  "Webpage names should contain only letters, numbers, hyphens, or underscores.": "Los nombres de página web solo deben contener letras, números, guiones o caracteres de subrayado.",
  "Website ID is not available": "El id. del sitio web no está disponible",
  "Website ID is required": "El id. del sitio web es obligatorio",
  "Website ID not found. Please ensure you have a valid Power Pages site open.": "Id. del sitio web no encontrado. Asegúrese de tener abierto un sitio válido de Power Pages.",
  "Website ID:": "Id. de sitio web:",
  "Website Id: {0}/{0} is the website ID": "Id. de sitio web: {0}",
  "Website URL:": "Dirección URL del sitio web:",
  "Website Url: {0}/{0} is the website Url": "URL del sitio web: {0}",
  "Website not found in the environment. Please check the credentials and login with correct account.": "No se encontró el sitio web en el entorno. Compruebe las credenciales e inicie sesión con la cuenta correcta.",
  "What do you need help with?": "¿Con qué necesita ayuda?",
  "Whether it’s HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.": "Ya sea código HTML, CSS, JS o Liquid, simplemente describa lo que necesita y deje que la IA lo construya por usted.",
  "Working on it...": "En proceso...",
  "Write JavaScript code for form field validation to check phone field value is in the valid format.": "Escriba código JavaScript para validar el campo del formulario de forma que se compruebe que el valor del campo de teléfono tiene el formato válido.",
  "Write JavaScript code to highlight the row where email field is empty in table list.": "Escriba código JavaScript para resaltar la fila en la que el campo de correo electrónico está vacío en la lista de tablas.",
  "Write web API code to query active contact records.": "Escriba código de API web para consultar los registros de contactos activos.",
  "Yes": "Sí",
  "Yes, Don't Ask Again": "Sí, no volver a preguntarme",
  "You are currently connected to a different environment. Would you like to switch to the required environment?": "Actualmente está conectado a un entorno diferente. ¿Le gustaría cambiar al entorno requerido?",
  "You are editing a live, public site ": "Está editando un sitio público activo ",
  "You can use this in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot with @powerpages</a> and leverage best of both world.": "Puede usar esto en <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot con @powerpages</a> y aprovechar lo mejor de ambos mundos.",
  "You need to authenticate with Power Platform to download the site. Would you like to authenticate now?": "Debe autenticarse con Power Platform para descargar el sitio. ¿Le gustaría autenticarse ahora?",
  "Your preview isn't updated. Please upload your site to see the latest changes.": "La vista previa no está actualizada. Cargue su sitio para ver los cambios más recientes.",
  "dotnet sdk 6.0 or greater must be installed/Do not translate 'dotnet' or 'sdk'": "debe estar instalado dotnet sdk 6.0 o una versión posterior",
  "lines": "líneas",
  "pac pcf init": "pac pcf init",
  "{0} ({1} file)/This is the site label showing the number of changed files. 'file' is singular.": "{0} ({1} archivo)",
  "{0} ({1} files)/This is the site label showing the number of changed files. 'files' is plural.": "{0} ({1} archivos)",
  "{0} ({1}) ↔ {2} (Local)/Comparison label showing remote and local sites. Format: 'Remote (Env) ↔ Local (Local)'.": "{0} ({1}) ↔ {2} (local)",
  "{0} binary file(s) (e.g., images) were skipped as they cannot be displayed in the diff viewer. You can view them individually in the file tree./Message shown when binary files are skipped in the multi-diff view.": "Se omitieron {0} archivos binarios (por ejemplo, imágenes) porque no se pueden mostrar en el visor de diferencias. Puede verlos individualmente en el árbol de archivos.",
  "{0} created!/{0} will be replaced by the entity type.": "Se ha creado {0}.",
  "{0} files changed (Imported {1})/Description for imported comparison. {0} is file count, {1} is formatted date.": "{0} archivos cambiados (importados el {1})",
  "{0} files changed/Description showing the number of changed files. 'files' is plural.": "{0} archivos cambiados",
  "{0}: {1} (Remote ↔ Local)/Title for the diff editor when comparing a single file.": "{0}: {1} (Remoto ↔ Local)"
}