{
  " End of Code Block ": " Fin du bloc de code ",
  "@PowerPages is not yet available in your region.": "@PowerPages n’est pas encore disponible dans votre région.",
  "A content snippet with the same name already exists. Please enter a different name.": "Un extrait de contenu portant le même nom existe déjà. Veuillez entrer un nom différent.",
  "A page template with the same name already exists. Please enter a different name.": "Un modèle de page portant le même nom existe déjà. Veuillez entrer un nom différent.",
  "A webpage with the same name already exists. Please enter a different name.": "Une page web portant le même nom existe déjà. Veuillez entrer un nom différent.",
  "A webtemplate with the same name already exists. Please enter a different name.": "Un modèle web portant le même nom existe déjà. Veuillez entrer un nom différent.",
  "AI features have been disabled by your organization. Contact your admin for details. [Learn more](https://go.microsoft.com/fwlink/?linkid=2285848)": "Les fonctionnalités d’IA ont été désactivées par votre organisation. Contactez votre administrateur pour plus d’informations. [En savoir plus](https://go.microsoft.com/fwlink/?linkid=2285848)",
  "AI-generated content can contain mistakes": "Le contenu généré par l’IA peut contenir des erreurs",
  "Active Sites": "Sites actifs",
  "Active auth profile is not found or has expired. Please try again.": "Le profil d’authentification active est introuvable ou a expiré. Veuillez recommencer.",
  "Active auth profile is not found or has expired. To create a new auth profile, enter the environment URL.": "Le profil d’authentification actif est introuvable ou a expiré. Pour créer un profil d’authentification, entrez l’URL de l’environnement.",
  "Add content snippet name (name should be unique)": "Ajouter le nom de l’extrait de contenu (le nom doit être unique)",
  "Adding {0} web file(s). Existing files will be skipped/{0} represents the number of web files": "Ajout du ou des fichiers Web {0}. Les fichiers existants seront ignorés",
  "Are you sure you want to clear all the Auth Profiles?": "Voulez-vous vraiment effacer tous les profils d’authentification ?",
  "Are you sure you want to delete the Auth Profile {0}-{1}?/{0} is the user name, {1} is the URL of environment of the auth profile": "Voulez-vous vraiment supprimer le profil d’authentification {0}-{1} ?",
  "Arrow icon": "Icône de flèche",
  "Authenticating...": "Authentification en cours...",
  "Authentication failed. Please login and try again.": "Échec de l’authentification. Veuillez vous connecter et réessayer.",
  "Authorization Failed. Please run again to authorize it": "Échec de l’autorisation. Exécutez à nouveau pour l’autoriser",
  "Be careful making changes. Anyone can see the changes you make immediately. Choose Edit the site to make edits, or close the editor tab to cancel without editing.": "Soyez prudent lorsque vous apportez des modifications. Tout le monde peut voir immédiatement les modifications. Choisissez Modifier le site pour apporter des modifications, ou fermez l’onglet de l’éditeur pour annuler sans modifier.",
  "Be careful when you're updating public sites. The changes you make are visible to anyone immediately. Do you want to continue?": "Soyez prudent lorsque vous mettez à jour des sites publics. Les modifications que vous apportez sont immédiatement visibles par tout le monde. Souhaitez-vous continuer ?",
  "Browse...": "Parcourir...",
  "Cancel": "Annuler",
  "Cannot install Power Pages generator. Please install npm and try again./Do not translate 'npm'": "Impossible d’installer le générateur Power Pages. Installez npm et recommencez.",
  "Cannot install Power Pages generator: {0}/{0} represents the error message returned from the exception": "Impossible d’installer le générateur Power Pages : {0}",
  "Cannot install pac CLI: {0}/{0} represents the error message returned from the exception": "Impossible d’installer pac CLI : {0}",
  "Changing environment...": "Changement d’environnement en cours...",
  "Check the URL and verify the parameters are correct": "Vérifiez l’URL et vérifiez que les paramètres sont corrects",
  "Checking for active auth profile...": "Recherche d’un profil d’authentification actif...",
  "Choose page template": "Choisir un modèle de page",
  "Choose parent page": "Choisir la page parente",
  "Choose web template": "Choisir un modèle web",
  "Clearing cache. See [details](https://aka.ms/pages-clear-cache)./This is a markdown formatting which must persist across translations.The second line should be '[TRANSLATION HERE](https://aka.ms/pages-clear-cache).', keeping brackets and the text in the parentheses unmodified": "Vidage du cache. Voir [les détails](https://aka.ms/pages-clear-cache).",
  "Cloud Instance: {0}/The {0} represents profile's Azure Cloud Instances": "Instance de cloud : {0}",
  "Cluster category: {0}/{0} is the Cluster category": "Catégorie du cluster : {0}",
  "Cluster environment: {0}/{0} is the Cluster environment": "Environnement du cluster : {0}",
  "Cluster geo name: {0}/{0} is the cluster geo name": "Nom de la zone géographique du cluster : {0}",
  "Code Block ": "Bloc de code ",
  "Confirm": "Confirmer",
  "Continue with Copilot for Power Pages": "Continuer avec Copilot pour Power Pages",
  "Copied to clipboard!": "Copié dans le Presse-papiers !",
  "Copilot Response": "Réponse de Copilot",
  "Copilot illustration": "Illustration de Copilot",
  "Copy to clipboard": "Copier dans le presse-papiers",
  "Created on: {0}/{0} is the created date": "Date de création : {0}",
  "Creating {0}.../{0} will be replaced by the entity type.": "Création de {0}...",
  "Creator: {0}/{0} is the creator": "Créateur : {0}",
  "Current": "Actuel",
  "Current site path not found.": "Chemin d’accès au site actuel introuvable.",
  "Data model version: {0}/{0} is the data model version": "Version du modèle de données : {0}",
  "Default Environment: {0}/The {0} represents profile's resource/environment URL": "Environnement par défaut : {0}",
  "Dislike something? Tell us more.": "Vous n’aimez pas quelque chose ? Dites-nous en plus.",
  "Display Name: {0}\nUnique Name: {1}\nVersion: {2}\nType: {3}/This is a multi-line tooltipThe {0} represents Solution's Friendly / Display nameThe {1} represents Solution's unique nameThe {2} represents Solution's Version numberThe {3} represents Solution's Type (Managed or Unmanaged), but that test is localized separately.": "Nom d’affichage : {0}\nNom unique : {1}\nVersion : {2}\nType : {3}",
  "Do not show again": "Ne plus afficher",
  "Edit the site": "Modifier le site",
  "Enter Organization ID": "Entrer l’ID d’organisation",
  "Enter name": "Entrer un nom",
  "Enter the environment URL": "Entrer l’URL de l’environnement",
  "Enter the name of the web template": "Entrer le nom du modèle web",
  "Environment ID: {0}/{0} is the Environment ID": "ID environnement : {0}",
  "Environment changed successfully.": "Environnement correctement modifié.",
  "Explain the following code snippet:": "Expliquez l’extrait de code suivant :",
  "Explain the following code {% include 'Page Copy'%}": "Expliquer le code suivant {% include 'Page Copy'%}",
  "Failed to create a new Power Pages site. Please try again.": "Échec de la création d’un site Power Pages. Veuillez réessayer.",
  "Failed to create: {0}./{0} will be replaced by the error message.": "Échec de la création de : {0}.",
  "Failed to disable PAC telemetry.": "Impossible de désactiver la télémétrie PAC.",
  "Failed to enable PAC telemetry.": "Impossible d’activer la télémétrie PAC.",
  "Failed to fetch some files.": "Échec de récupération de certains fichiers.",
  "Failed to get file ready for edit: {0}": "Impossible de préparer le fichier pour la modification : {0}",
  "Failed to get organization details. Please try again later": "Impossible de récupérer les détails sur l’organisation. Veuillez réessayer plus tard",
  "Failed to get website endpoint. Please try again later": "Impossible d’obtenir un point de terminaison du site web. Veuillez réessayer plus tard",
  "Feature is not enabled for this geo.": "La fonctionnalité n’est pas activée pour cette zone géographique.",
  "Feedback": "Commentaires",
  "Fetching your file ...": "Récupération de votre fichier en cours...",
  "File might be referenced by name {0} here./{0} represents the name of the file": "Il se peut que le fichier soit référencé sous le nom {0} ici.",
  "File(s) already exist. No new files to add": "Le ou les fichiers existent déjà. Aucun nouveau fichier à ajouter",
  "Friendly name: {0}/{0} is the website name": "Nom convivial : {0}",
  "GETTING STARTED": "DÉMARRAGE",
  "Generating a new Power Pages site...": "Génération d’un nouveau site Power Pages en cours...",
  "Generating webpages...": "Génération de pages Web...",
  "Get GitHub Copilot to try @powerpages": "Obtenir GitHub Copilot pour essayer @powerpages",
  "Getting organization details...": "Obtention des détails de l’organisation...",
  "Getting region information...": "Récupération des informations sur la région...",
  "Getting website endpoint...": "Obtention du point de terminaison du site web...",
  "Here are a few suggestions to get you started": "Voici quelques suggestions pour vous aider à vous lancer",
  "Hi": "Bonjour",
  "Hi! @powerpages can help you write, edit, and even summarize your website code.": "Bonjour ! @powerpages vous aider à écrire, modifier et même résumer le code de votre site web.",
  "Hi! Instantly generate code for Power Pages sites by typing in what you need. To start using Copilot, log in to your Microsoft account.": "Salut ! Générez instantanément le code des sites Power Pages en tapant ce dont vous avez besoin. Pour commencer à utiliser Copilot, connectez-vous à votre compte Microsoft.",
  "Hi! Power Pages lets you build secure, professional websites that you can quickly configure and publish across web browsers and devices.\n\nTo create your website, visit the [Power Pages](https://powerpages.microsoft.com/).\nReturn to this chat and @powerpages can help you write and edit your website code.": "Bonjour, Power Pages vous permet de créer des sites web sécurisés et professionnels que vous pouvez rapidement configurer et publier sur tous les navigateurs web et appareils.\n\nPour créer votre site web, visitez la page [Power Pages](https://powerpages.microsoft.com/).\nRevenez à cette conversation et @powerpages peut vous aider à écrire et à modifier le code de votre site web.",
  "Hi! Your Microsoft account doesn’t currently support Copilot. Contact your admin for details.": "Bonjour, Votre compte Microsoft ne prend actuellement pas en charge Copilot. Pour plus d’informations, contactez votre administrateur.",
  "In your own words, describe what you need. You can get help with writing code for Power Pages sites in HTML, CSS, and JS languages.": "Avec vos propres mots, décrivez ce dont vous avez besoin. Vous pouvez obtenir de l’aide sur l’écriture du code pour les sites Power Pages en langages HTML, CSS et JS.",
  "Inactive Sites": "Sites inactifs",
  "Initializing site preview": "Initialisation de l’aperçu du site",
  "Initializing site preview. Please try again after few seconds.": "Initialisation de l’aperçu du site. Réessayez dans quelques secondes.",
  "Insert code into editor": "Insérer un code dans l’éditeur",
  "Install": "Installer",
  "Installing Power Pages generator(v{0}).../{0} represents the version number": "Installation du générateur Power Pages (v{0})...",
  "Instance url: {0}/{0} is the Instance Url": "URL de l’instance : {0}",
  "Learn more about Copilot": "En savoir plus sur Copilot",
  "Let Copilot help you code": "Laissez Copilot vous aider à coder",
  "Like something? Tell us more.": "Vous aimez quelque chose ? Dites-nous en plus.",
  "Login": "Connexion",
  "Login to PowerPages": "Connexion à PowerPages",
  "Make sure AI-generated content is accurate and appropriate before using. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Learn more</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">View\n              terms</a>": "Assurez-vous que le contenu généré par l’IA est exact et approprié avant de l’utiliser. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">En savoir plus</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">Vue\n              conditions</a>",
  "Make sure AI-generated content is accurate and appropriate before using. [Learn more](https://go.microsoft.com/fwlink/?linkid=2240145) | [View terms](https://go.microsoft.com/fwlink/?linkid=2189520)": "Assurez-vous que le contenu généré par l’IA est précis et approprié avant de l’utiliser. [En savoir plus](https://go.microsoft.com/fwlink/?linkid=2240145) | [Afficher les conditions](https://go.microsoft.com/fwlink/?linkid=2189520)",
  "Managed": "Géré",
  "Maximum 30 characters allowed": "30 caractères maximum autorisés",
  "Microsoft wants your feedback": "Microsoft souhaite recevoir vos commentaires",
  "Missing required site information for reactivation.": "Informations de site manquantes requises pour la réactivation.",
  "NEW": "NOUVEAU",
  "Name/Rename Auth Profile": "Nommer/Renommer le profil d’authentification",
  "Name: {0}\nURL: {1}\nEnvironment ID: {2}\nOrganization ID: {3}/This is a multi-line tooltipThe {0} represents Dataverse Environment's Friendly / Display nameThe {1} represents Dataverse Environment's URLThe {2} represents Dataverse Environment's Environment ID (GUID)The {3} represents Dataverse Environment's Organization ID (GUID)": "Nom : {0}\nURL : {1}\nID d’environnement : {2}\nID d’organisation : {3}",
  "Name: {0}/The {0} represents the optional name the user provided for the profile)": "Nom : {0}",
  "New Content Snippet": "Nouvel extrait de contenu",
  "New Page Template": "Nouveau modèle de page",
  "New Webpage": "Nouvelle page web",
  "No Website Data Found in Current Directory. Please switch to a directory that contains the PAC downloaded website data to continue.": "Aucune donnée de site web trouvée dans le répertoire actuel. Pour continuer, allez dans un répertoire contenant les données du site PAC téléchargées.",
  "No environments found": "Aucun environnement trouvé",
  "No page templates found": "Aucun modèle de page trouvé",
  "No parent pages found for adding webfile": "Aucune page parente trouvée pour l’ajout du fichier web",
  "No sites found": "Aucun site trouvé",
  "No webpages found": "Aucune page web trouvée",
  "No workspace folder found": "Aucun dossier d’espace de travail trouvé",
  "No workspace folder opened. Please open a site folder to preview.": "Aucun dossier d’espace de travail ouvert. Ouvrez un dossier du site pour afficher un aperçu.",
  "Object ID: {0}/{0} is the Object ID": "ID d’objet : {0}",
  "One or more attribute names have been changed or removed. Contact your admin.": "Un ou plusieurs noms d’attribut ont été modifiés ou supprimés. Contactez votre administrateur.",
  "Open in Power Pages studio": "Ouvrir dans le studio Power Pages",
  "Opening preview site...": "Ouverture de l’aperçu du site en cours…",
  "Opening site preview...": "En cours d’ouverture de l’aperçu du site...",
  "Operation failed. See output panel for details.": "Échec de l’opération. Pour plus de détails, consultez le volet de sortie.",
  "Organization ID: {0}/{0} is the Organization ID": "ID d’organisation : {0}",
  "Other Sites": "Autres sites",
  "PAC Telemetry disabled": "Télémétrie PAC désactivée",
  "PAC Telemetry enabled": "Télémétrie PAC activée",
  "PREVIEW": "VERSION PRÉLIMINAIRE",
  "Page Template name cannot be empty.": "Le nom du modèle de page ne peut pas être vide.",
  "Please enter a name for the content snippet.": "Saisissez un nom pour l’extrait de code du contenu.",
  "Please enter a name for the page template.": "Saisissez un nom pour le modèle de page.",
  "Please enter a name for the web template.": "Saisissez un nom pour le modèle web.",
  "Please enter a name for the webpage.": "Saisissez un nom pour la page web.",
  "Please login to preview the site.": "Veuillez vous connecter pour prévisualiser le site.",
  "Please select the folder that contains your compiled output to upload your site.": "Veuillez sélectionner le dossier contenant votre sortie compilée pour télécharger votre site.",
  "Power Pages Copilot is now connected to the environment: {0} : {1}/{0} represents the environment name": "Power Pages Copilot est désormais connecté à l’environnement : {0} : {1}",
  "Power Pages studio URL is not available": "L’URL du studio Power Pages n’est pas disponible",
  "Preparing pac CLI (v{0}).../{0} represents the version number": "Préparation de pac CLI (v{0}) en cours...",
  "Preview site": "Afficher l’aperçu du site",
  "Preview site URL is not valid": "L’URL du site de version préliminaire n’est pas valide",
  "Profile Kind: {0}/The {0} represents the profile type (Admin vs Dataverse)": "Type de profil : {0}",
  "Response data is empty": "Les données de la réponse sont vides",
  "Saving your file ...": "Enregistrement de votre fichier en cours...",
  "Select Folder": "Sélectionner un dossier",
  "Select Folder for new PCF Control/Do not translate 'PCF' as it is a product name.": "Sélectionner un dossier pour le nouveau contrôle PCF",
  "Select Type": "Sélectionner le type",
  "Select an environment": "Sélectionner un environnement",
  "Select the folder that contains your compiled output": "Sélectionner le dossier qui contient votre sortie compilée",
  "Select the folder that will contain your project root for your site": "Sélectionner le dossier qui contiendra la racine de votre projet pour votre site",
  "Selection is empty.": "La sélection est vide.",
  "Selection is too large. Try making a shorter selection.": "La sélection est trop grande. Essayez d’effectuer une sélection plus petite.",
  "Session Details": "Détails de la session",
  "Session ID: {0}/{0} is the Session ID": "ID de session : {0}",
  "Show Output Panel": "Afficher le volet de sortie",
  "Site Details": "Détails du site",
  "Site management URL not found for the selected site. Please try again after refreshing the environment.": "L’URL de gestion de site est introuvable pour le site sélectionné. Veuillez réessayer après avoir actualisé l’environnement.",
  "Site runtime preview feature is not enabled.": "La fonctionnalité d’évaluation de runtime du site n’est pas activée.",
  "Site visibility: {0}/{0} is the site visibility": "Visibilité du site : {0}",
  "Some references might be broken. Please check diagnostics for details.": "Certaines références peuvent être rompues. Consultez les diagnostics pour obtenir des détails.",
  "Something went wrong. Don’t worry, you can try again.": "Un problème s’est produit. Ne vous inquiétez pas, vous pouvez réessayer.",
  "Submit": "Soumettre",
  "Tell us more.": "Dites-nous en plus.",
  "Tenant ID: {0}/{0} is the Tenant ID": "ID client : {0}",
  "The Power Pages generator is ready for use in your VS Code extension!": "Le générateur Power Pages est prêt à être utilisé dans votre extension VS Code !",
  "The extension 'Microsoft Edge Tools' is required to run this command. Do you want to install it now?/Do not translate 'Microsoft Edge Tools' ": "L’extension 'Microsoft Edge Tools' est nécessaire pour exécuter cette commande. Voulez-vous l’installer maintenant ?",
  "The name you want to give to this authentication profile": "Nom que vous souhaitez attribuer à ce profil d’authentification",
  "The pac CLI is ready for use in your VS Code terminal!": "Le pac CLI est prêt à être utilisé dans votre terminal VS Code !",
  "The preview shown is for published changes. Please publish any pending changes to see them in the preview.": "L’aperçu affiché est celui des modifications publiées. Publiez les modifications en attente pour les voir dans l’aperçu.",
  "There was a permissions problem with the server": "Problème d’autorisations avec le serveur",
  "There was a problem opening the workspace": "Un problème s’est produit lors de l’ouverture de l’espace de travail",
  "There’s a problem on the back end": "Problème dans le back-end",
  "Thumbs Down": "Pouce vers le bas",
  "Thumbs Up": "Pouce vers le haut",
  "Timestamp: {0}/{0} is the timestamp": "Horodatage : {0}",
  "To know more, see <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">Copilot in Power Pages documentation.": "Pour en savoir plus, consultez <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">la documentation Copilot dans Power Pages.",
  "Try @powerpages with GitHub Copilot": "Essayer @powerpages avec GitHub Copilot",
  "Try again": "Réessayer",
  "Try and be as specific as possible. Your feedback will be used to improve Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> View privacy details </a>": "Essayez d’être aussi précis que possible. Vos commentaires serviront à améliorer Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> Afficher les détails sur la confidentialité </a>",
  "Unable to clear cache": "Impossible d’effacer le cache",
  "Unable to complete the request": "Impossible de traiter la demande",
  "Unable to find that app": "Impossible de trouver cette application",
  "Unable to locate website root folder.": "Impossible de localiser le dossier racine du site web.",
  "Unique name: {0}/{0} is the Unique name": "Nom unique : {0}",
  "Unmanaged": "Non géré",
  "Upload changes": "Charger les modifications",
  "Upload failed. Please try again later.": "Échec de chargement. Réessayez ultérieurement.",
  "User: {0}/The {0} represents auth profile's user name (email address))": "Utilisateur : {0}",
  "We encountered an error preparing the files for edit.": "Nous avons rencontré une erreur lors de la préparation des fichiers à modifier.",
  "Web files": "Fichiers web",
  "Webfile(s) added successfully": "Le ou les fichiers web ont été ajoutés",
  "Webpage names should contain only letters, numbers, hyphens, or underscores.": "Les noms de page web ne doivent contenir que des lettres, des nombres, des tirets ou des traits de soulignement.",
  "Website Id: {0}/{0} is the website ID": "ID de site web : {0}",
  "Website Url: {0}/{0} is the website Url": "URL du site web : {0}",
  "Website not found in the environment. Please check the credentials and login with correct account.": "Site web introuvable dans l’environnement. Veuillez vérifier les informations d’identification et vous connecter en utilisant le bon compte.",
  "What do you need help with?": "En quoi avez-vous besoin d’aide ?",
  "Whether it’s HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.": "Qu’il s’agisse de code HTML, CSS, JS ou Liquid, décrivez simplement ce dont vous avez besoin et laissez l’IA le construire pour vous.",
  "Working on it...": "Traitement en cours…",
  "Write JavaScript code for form field validation to check phone field value is in the valid format.": "Ecrivez le code JavaScript pour la validation du champ du formulaire pour vérifier que la valeur du champ téléphone a le format valide.",
  "Write JavaScript code to highlight the row where email field is empty in table list.": "Ecrivez le code JavaScript pour mettre en surbrillance la ligne dans laquelle le champ de courrier électronique est vide dans la liste de tables.",
  "Write web API code to query active contact records.": "Écrivez un code d’API web pour interroger des enregistrements de contacts actifs.",
  "Yes": "Oui",
  "You are editing a live, public site ": "Vous modifiez un site public actif ",
  "You can use this in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot with @powerpages</a> and leverage best of both world.": "Vous pouvez l’utiliser dans <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot avec @powerpages</a> et tirer le meilleur des deux mondes.",
  "Your preview isn't updated. Please upload your site to see the latest changes.": "Votre aperçu n’est pas à jour. Téléchargez votre site pour voir les modifications les plus récentes.",
  "dotnet sdk 6.0 or greater must be installed/Do not translate 'dotnet' or 'sdk'": "la version du kit de développement logiciel (sdk) dotnet sdk 6.0 ou supérieure doit être installé",
  "{0} created!/{0} will be replaced by the entity type.": "{0} créé !"
}