{
  " End of Code Block ": " Fin del bloque de código ",
  "@PowerPages is not yet available in your region.": "@PowerPages aún no está disponible en su región.",
  "A content snippet with the same name already exists. Please enter a different name.": "Ya existe un fragmento de contenido con el mismo nombre. Especifique otro nombre.",
  "A page template with the same name already exists. Please enter a different name.": "Ya existe una plantilla de página con el mismo nombre. Especifique otro nombre.",
  "A webpage with the same name already exists. Please enter a different name.": "Ya existe una página web con el mismo nombre. Especifique otro nombre.",
  "A webtemplate with the same name already exists. Please enter a different name.": "Ya existe una plantilla web con el mismo nombre. Especifique otro nombre.",
  "AI features have been disabled by your organization. Contact your admin for details. [Learn more](https://go.microsoft.com/fwlink/?linkid=2285848)": "Su organización ha deshabilitado las características de IA. Póngase en contacto con el administrador para obtener más información. [Más información](https://go.microsoft.com/fwlink/?linkid=2285848)",
  "AI-generated content can contain mistakes": "El contenido generado por IA puede contener errores",
  "Active Sites": "Sitios activos",
  "Active auth profile is not found or has expired. Please try again.": "El perfil de autenticación activo no se encuentra o ha expirado. Vuelva a intentarlo.",
  "Active auth profile is not found or has expired. To create a new auth profile, enter the environment URL.": "El perfil de autenticación activo no se encuentra o ha expirado. Para crear un nuevo perfil de autenticación, introduzca la dirección URL del entorno.",
  "Add content snippet name (name should be unique)": "Agregar el nombre del fragmento de contenido (el nombre debe ser único)",
  "Adding {0} web file(s). Existing files will be skipped/{0} represents the number of web files": "Agregando {0} archivos web. Se omitirán los archivos existentes",
  "Are you sure you want to clear all the Auth Profiles?": "¿Seguro que desea borrar todos los perfiles de autenticación?",
  "Are you sure you want to delete the Auth Profile {0}-{1}?/{0} is the user name, {1} is the URL of environment of the auth profile": "¿Seguro que desea eliminar el perfil de autenticación {0}-{1}?",
  "Arrow icon": "Icono de flecha",
  "Authenticating...": "Autenticando...",
  "Authentication failed. Please login and try again.": "No se pudo autenticar. Inicie sesión y vuelva a intentarlo.",
  "Authorization Failed. Please run again to authorize it": "No se pudo autorizar. Vuelva a ejecutarla para autorizarla",
  "Be careful making changes. Anyone can see the changes you make immediately. Choose Edit the site to make edits, or close the editor tab to cancel without editing.": "Tenga cuidado al hacer cambios. Cualquier usuario puede ver inmediatamente los cambios que usted realice. Elija Editar el sitio para realizar cambios o cierre la pestaña del editor para cancelar sin hacer cambios.",
  "Be careful when you're updating public sites. The changes you make are visible to anyone immediately. Do you want to continue?": "Tenga cuidado cuando actualice sitios públicos. Los cambios que realice serán visibles para cualquier persona inmediatamente. ¿Desea continuar?",
  "Browse...": "Examinar...",
  "Cancel": "Cancelar",
  "Cannot install Power Pages generator. Please install npm and try again./Do not translate 'npm'": "No se puede instalar el generador de Power Pages. Instale npm y vuelva a intentarlo.",
  "Cannot install Power Pages generator: {0}/{0} represents the error message returned from the exception": "No se puede instalar el generador de Power Pages: {0}",
  "Cannot install pac CLI: {0}/{0} represents the error message returned from the exception": "No se puede instalar pac CLI: {0}",
  "Changing environment...": "Cambiando entorno...",
  "Check the URL and verify the parameters are correct": "Compruebe la dirección URL y asegúrese de que los parámetros sean correctos",
  "Checking for active auth profile...": "Buscando un perfil de autenticación activo...",
  "Choose page template": "Elegir plantilla de página",
  "Choose parent page": "Elegir página primaria",
  "Choose web template": "Elegir plantilla web",
  "Clearing cache. See [details](https://aka.ms/pages-clear-cache)./This is a markdown formatting which must persist across translations.The second line should be '[TRANSLATION HERE](https://aka.ms/pages-clear-cache).', keeping brackets and the text in the parentheses unmodified": "Borrando caché. Consulte [detalles](https://aka.ms/pages-clear-cache).",
  "Cloud Instance: {0}/The {0} represents profile's Azure Cloud Instances": "Instancia en la nube: {0}",
  "Cluster category: {0}/{0} is the Cluster category": "Categoría de clúster: {0}",
  "Cluster environment: {0}/{0} is the Cluster environment": "Entorno de clúster: {0}",
  "Cluster geo name: {0}/{0} is the cluster geo name": "Nombre de geoárea del clúster: {0}",
  "Code Block ": "Bloque de código ",
  "Confirm": "Confirmar",
  "Continue with Copilot for Power Pages": "Continuar con Copilot para Power Pages",
  "Copied to clipboard!": "Copiado al portapapeles.",
  "Copilot Response": "Respuesta de Copilot",
  "Copilot illustration": "Ilustración de Copilot",
  "Copy to clipboard": "Copiar al Portapapeles",
  "Created on: {0}/{0} is the created date": "Fecha de creación: {0}",
  "Creating {0}.../{0} will be replaced by the entity type.": "Creando {0}...",
  "Creator: {0}/{0} is the creator": "Creador: {0}",
  "Current": "Actual",
  "Current site path not found.": "No se encontró la ruta de acceso del sitio actual.",
  "Data model version: {0}/{0} is the data model version": "Versión del modelo de datos: {0}",
  "Default Environment: {0}/The {0} represents profile's resource/environment URL": "Entorno predeterminado: {0}",
  "Dislike something? Tell us more.": "¿Hay algo que no le guste? Cuéntenos más.",
  "Display Name: {0}\nUnique Name: {1}\nVersion: {2}\nType: {3}/This is a multi-line tooltipThe {0} represents Solution's Friendly / Display nameThe {1} represents Solution's unique nameThe {2} represents Solution's Version numberThe {3} represents Solution's Type (Managed or Unmanaged), but that test is localized separately.": "Nombre para mostrar: {0}\nNombre único: {1}\nVersión: {2}\nTipo: {3}",
  "Do not show again": "No volver a mostrar",
  "Edit the site": "Editar el sitio",
  "Enter Organization ID": "Escriba el id. de organización",
  "Enter name": "Escribir nombre",
  "Enter the environment URL": "Escribir la URL del entorno",
  "Enter the name of the web template": "Escriba el nombre de la plantilla web",
  "Environment ID: {0}/{0} is the Environment ID": "Id. de entorno: {0}",
  "Environment changed successfully.": "Se ha cambiado el entorno correctamente.",
  "Explain the following code snippet:": "Explique el siguiente fragmento de código:",
  "Explain the following code {% include 'Page Copy'%}": "Explicar el siguiente código {% include 'Page Copy'%}",
  "Failed to create a new Power Pages site. Please try again.": "No se pudo crear un sitio nuevo de Power Pages. Vuelva a intentarlo.",
  "Failed to create: {0}./{0} will be replaced by the error message.": "No se pudo crear: {0}.",
  "Failed to disable PAC telemetry.": "No se pudo deshabilitar la telemetría de PAC.",
  "Failed to enable PAC telemetry.": "No se pudo habilitar la telemetría de PAC.",
  "Failed to fetch some files.": "No se pudieron capturar algunos archivos.",
  "Failed to get file ready for edit: {0}": "No se pudo preparar el archivo para su edición: {0}",
  "Failed to get organization details. Please try again later": "No se pudieron obtener los detalles de la organización. Vuelva a intentarlo más tarde",
  "Failed to get website endpoint. Please try again later": "No se pudo obtener el punto de conexión de sitio web. Vuelva a intentarlo más tarde",
  "Feature is not enabled for this geo.": "La característica no está habilitada para esta geoárea.",
  "Feedback": "Comentarios",
  "Fetching your file ...": "Capturando su archivo...",
  "File might be referenced by name {0} here./{0} represents the name of the file": "Se puede hacer referencia al archivo por su nombre {0} aquí.",
  "File(s) already exist. No new files to add": "Los archivos ya existen. No hay archivos nuevos que agregar",
  "Friendly name: {0}/{0} is the website name": "Nombre descriptivo: {0}",
  "GETTING STARTED": "INTRODUCCIÓN",
  "Generating a new Power Pages site...": "Generando un sitio nuevo de Power Pages...",
  "Generating webpages...": "Generando páginas web...",
  "Get GitHub Copilot to try @powerpages": "Hacer que GitHub Copilot pruebe @powerpages",
  "Getting organization details...": "Obteniendo detalles de la organización...",
  "Getting region information...": "Obteniendo información de la región...",
  "Getting website endpoint...": "Obteniendo punto de conexión de sitio web...",
  "Here are a few suggestions to get you started": "Aquí le presentamos algunas sugerencias para empezar",
  "Hi": "Hola",
  "Hi! @powerpages can help you write, edit, and even summarize your website code.": "¡Hola! @powerpages puede ayudarle a escribir, editar e incluso resumir el código de su sitio web.",
  "Hi! Instantly generate code for Power Pages sites by typing in what you need. To start using Copilot, log in to your Microsoft account.": "¡Hola! Genere al instante código para sitios de Power Pages escribiendo lo que necesita. Para empezar a usar Copilot, inicie sesión en su cuenta Microsoft.",
  "Hi! Power Pages lets you build secure, professional websites that you can quickly configure and publish across web browsers and devices.\n\nTo create your website, visit the [Power Pages](https://powerpages.microsoft.com/).\nReturn to this chat and @powerpages can help you write and edit your website code.": "Hola: Power Pages le permite crear sitios web seguros y profesionales que puede configurar y publicar rápidamente en exploradores web y dispositivos.\n\nPara crear su sitio web, visite [Power Pages](https://powerpages.microsoft.com/).\nVuelve a este chat y @powerpages puede ayudarle a escribir y editar el código de su sitio web.",
  "Hi! Your Microsoft account doesn’t currently support Copilot. Contact your admin for details.": "Hola: Su cuenta de Microsoft no es compatible actualmente con Copilot. Póngase en contacto con su administrador para obtener más información.",
  "In your own words, describe what you need. You can get help with writing code for Power Pages sites in HTML, CSS, and JS languages.": "Describa con sus propias palabras lo que necesita. Puede obtener ayuda con la escritura de código para sitios de Power Pages en los lenguajes HTML, CSS y JS.",
  "Inactive Sites": "Sitios inactivos",
  "Initializing site preview": "Inicializando la vista previa del sitio",
  "Initializing site preview. Please try again after few seconds.": "Inicializando la vista previa del sitio. Vuelva a intentarlo después de unos segundos.",
  "Insert code into editor": "Insertar código en el editor",
  "Install": "Instalar",
  "Installing Power Pages generator(v{0}).../{0} represents the version number": "Instalando el generador de Power Pages (v{0})...",
  "Instance url: {0}/{0} is the Instance Url": "Dirección URL de la instancia: {0}",
  "Learn more about Copilot": "Más información sobre Copilot",
  "Let Copilot help you code": "Deje que Copilot le ayude a programar",
  "Like something? Tell us more.": "¿Hay algo que le guste? Cuéntenos más.",
  "Login": "Inicio de sesión",
  "Login to PowerPages": "Iniciar sesión en PowerPages",
  "Make sure AI-generated content is accurate and appropriate before using. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Learn more</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">View\n              terms</a>": "Asegúrese de que el contenido generado por IA sea preciso y apropiado antes de usarlo. <a href=\"https://go.microsoft.com/fwlink/?linkid=2240145\">Más información</a> | <a href=\"https://go.microsoft.com/fwlink/?linkid=2189520\">Ver\n              términos y condiciones</a>",
  "Make sure AI-generated content is accurate and appropriate before using. [Learn more](https://go.microsoft.com/fwlink/?linkid=2240145) | [View terms](https://go.microsoft.com/fwlink/?linkid=2189520)": "Asegúrese de que el contenido generado por IA sea preciso y adecuado antes de usarlo. [Más información](https://go.microsoft.com/fwlink/?linkid=2240145) | [Ver términos](https://go.microsoft.com/fwlink/?linkid=2189520)",
  "Managed": "Administrado",
  "Maximum 30 characters allowed": "Se permite un máximo de 30 caracteres",
  "Microsoft wants your feedback": "Microsoft desea recibir sus comentarios",
  "Missing required site information for reactivation.": "Falta información del sitio necesaria para la reactivación.",
  "NEW": "NUEVO",
  "Name/Rename Auth Profile": "Asignar nombre/Cambiar nombre del perfil de autenticación",
  "Name: {0}\nURL: {1}\nEnvironment ID: {2}\nOrganization ID: {3}/This is a multi-line tooltipThe {0} represents Dataverse Environment's Friendly / Display nameThe {1} represents Dataverse Environment's URLThe {2} represents Dataverse Environment's Environment ID (GUID)The {3} represents Dataverse Environment's Organization ID (GUID)": "Nombre: {0}\nURL: {1}\nId. de entorno: {2}\nId. de organización: {3}",
  "Name: {0}/The {0} represents the optional name the user provided for the profile)": "Nombre: {0}",
  "New Content Snippet": "Nuevo fragmento de contenido",
  "New Page Template": "Nueva plantilla de página",
  "New Webpage": "Nueva página web",
  "No Website Data Found in Current Directory. Please switch to a directory that contains the PAC downloaded website data to continue.": "No se encontraron datos del sitio web en el directorio actual. Cambie a un directorio que contenga los datos del sitio web descargado de PAC para continuar.",
  "No environments found": "No se encontraron entornos",
  "No page templates found": "No se encontró ninguna plantilla de página",
  "No parent pages found for adding webfile": "No se ha encontrado ninguna página primaria para agregar el archivo web",
  "No sites found": "No se encontraron sitios",
  "No webpages found": "No se ha encontrado ninguna página web",
  "No workspace folder found": "No se ha encontrado ninguna carpeta del área de trabajo",
  "No workspace folder opened. Please open a site folder to preview.": "No se ha abierto ninguna carpeta del área de trabajo. Abra una carpeta del sitio para obtener una vista previa.",
  "Object ID: {0}/{0} is the Object ID": "Id. de objeto: {0}",
  "One or more attribute names have been changed or removed. Contact your admin.": "Se han cambiado o quitado uno o más nombres de atributo. Póngase en contacto con su administrador.",
  "Open in Power Pages studio": "Abrir en el estudio de Power Pages",
  "Opening preview site...": "Abriendo sitio de versión preliminar...",
  "Opening site preview...": "Abriendo la vista previa del sitio...",
  "Operation failed. See output panel for details.": "No se pudo realizar la operación. Consulte el panel de salida para obtener más información.",
  "Organization ID: {0}/{0} is the Organization ID": "Id. de organización: {0}",
  "Other Sites": "Otros sitios",
  "PAC Telemetry disabled": "Telemetría de PAC deshabilitada",
  "PAC Telemetry enabled": "Telemetría de PAC habilitada",
  "PREVIEW": "VERSIÓN PRELIMINAR",
  "Page Template name cannot be empty.": "El nombre de la plantilla de página no puede estar vacío.",
  "Please enter a name for the content snippet.": "Escriba un nombre para el fragmento de contenido.",
  "Please enter a name for the page template.": "Escriba un nombre para la plantilla de página.",
  "Please enter a name for the web template.": "Escriba un nombre para la plantilla web.",
  "Please enter a name for the webpage.": "Escriba un nombre para la página web.",
  "Please login to preview the site.": "Inicie sesión para obtener una vista previa del sitio.",
  "Please select the folder that contains your compiled output to upload your site.": "Seleccione la carpeta que contiene la salida compilada para cargar su sitio.",
  "Power Pages Copilot is now connected to the environment: {0} : {1}/{0} represents the environment name": "Power Pages Copilot está conectado ahora al entorno {0}: {1}",
  "Power Pages studio URL is not available": "La dirección URL del estudio de Power Pages no está disponible",
  "Preparing pac CLI (v{0}).../{0} represents the version number": "Preparando pac CLI (v{0})...",
  "Preview site": "Sitio de versión preliminar",
  "Preview site URL is not valid": "La dirección URL del sitio de versión preliminar no es válida",
  "Profile Kind: {0}/The {0} represents the profile type (Admin vs Dataverse)": "Tipo de perfil: {0}",
  "Response data is empty": "Los datos de respuesta están vacíos",
  "Saving your file ...": "Guardando su archivo...",
  "Select Folder": "Seleccionar carpeta",
  "Select Folder for new PCF Control/Do not translate 'PCF' as it is a product name.": "Seleccione Carpeta para el nuevo control PCF",
  "Select Type": "Seleccionar tipo",
  "Select an environment": "Seleccionar un entorno",
  "Select the folder that contains your compiled output": "Seleccione la carpeta que contiene la salida compilada",
  "Select the folder that will contain your project root for your site": "Seleccione la carpeta que contendrá la raíz del proyecto para su sitio",
  "Selection is empty.": "La selección está vacía.",
  "Selection is too large. Try making a shorter selection.": "La selección es demasiado grande. Intente acortar la selección.",
  "Session Details": "Detalles de la sesión",
  "Session ID: {0}/{0} is the Session ID": "Id. de sesión: {0}",
  "Show Output Panel": "Mostrar panel de salida",
  "Site Details": "Detalles del sitio",
  "Site management URL not found for the selected site. Please try again after refreshing the environment.": "No se encontró la dirección URL de administración del sitio para el sitio seleccionado. Vuelva a intentarlo después de actualizar el entorno.",
  "Site runtime preview feature is not enabled.": "La característica de vista previa en tiempo de ejecución del sitio no está habilitada.",
  "Site visibility: {0}/{0} is the site visibility": "Visibilidad del sitio: {0}",
  "Some references might be broken. Please check diagnostics for details.": "Es posible que algunas referencias estén rotas. Consulte los diagnósticos para ver más detalles.",
  "Something went wrong. Don’t worry, you can try again.": "Se ha producido un error. No se preocupe, puede intentarlo de nuevo.",
  "Submit": "Enviar",
  "Tell us more.": "Cuéntenos más.",
  "Tenant ID: {0}/{0} is the Tenant ID": "Id. de inquilino: {0}",
  "The Power Pages generator is ready for use in your VS Code extension!": "¡El generador de Power Pages ya se puede usar en su extensión de VS Code!",
  "The extension 'Microsoft Edge Tools' is required to run this command. Do you want to install it now?/Do not translate 'Microsoft Edge Tools' ": "Se requiere la extensión \"Microsoft Edge Tools\" para ejecutar este comando. ¿Desea instalarla ahora?",
  "The name you want to give to this authentication profile": "Nombre que desea asignar a este perfil de autenticación",
  "The pac CLI is ready for use in your VS Code terminal!": "¡pac CLI ya se puede usar en su terminal de VS Code!",
  "The preview shown is for published changes. Please publish any pending changes to see them in the preview.": "La vista previa que se muestra corresponde a los cambios publicados. Publique los cambios pendientes para verlos en la vista previa.",
  "There was a permissions problem with the server": "Se produjo un problema de permisos con el servidor",
  "There was a problem opening the workspace": "Hubo un problema al abrir el área de trabajo",
  "There’s a problem on the back end": "Hay un problema en el back-end",
  "Thumbs Down": "Pulgar hacia abajo",
  "Thumbs Up": "Pulgar hacia arriba",
  "Timestamp: {0}/{0} is the timestamp": "Marca de tiempo: {0}",
  "To know more, see <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">Copilot in Power Pages documentation.": "Para obtener más información, consulte la <a href=\"https://go.microsoft.com/fwlink/?linkid=2206366\">documentación de Copilot en Power Pages.",
  "Try @powerpages with GitHub Copilot": "Probar @powerpages con GitHub Copilot",
  "Try again": "Volver a intentarlo",
  "Try and be as specific as possible. Your feedback will be used to improve Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> View privacy details </a>": "Trate de ser lo más específico posible. Sus comentarios se utilizarán para mejorar Copilot. <a href=\"https://privacy.microsoft.com/en-US/data-privacy-notice\"> Ver información de privacidad </a>",
  "Unable to clear cache": "No se puede borrar la caché",
  "Unable to complete the request": "No se puede completar la solicitud",
  "Unable to find that app": "No se puede encontrar esa aplicación",
  "Unable to locate website root folder.": "No se puede encontrar la carpeta raíz del sitio web.",
  "Unique name: {0}/{0} is the Unique name": "Nombre único: {0}",
  "Unmanaged": "No administrado",
  "Upload changes": "Cargar cambios",
  "Upload failed. Please try again later.": "Error de carga. Vuelva a intentarlo más tarde.",
  "User: {0}/The {0} represents auth profile's user name (email address))": "Usuario: {0}",
  "We encountered an error preparing the files for edit.": "Se detectó un error al preparar los archivos para su edición.",
  "Web files": "Archivos web",
  "Webfile(s) added successfully": "Sitios web agregados correctamente",
  "Webpage names should contain only letters, numbers, hyphens, or underscores.": "Los nombres de página web solo deben contener letras, números, guiones o caracteres de subrayado.",
  "Website Id: {0}/{0} is the website ID": "Id. de sitio web: {0}",
  "Website Url: {0}/{0} is the website Url": "URL del sitio web: {0}",
  "Website not found in the environment. Please check the credentials and login with correct account.": "No se encontró el sitio web en el entorno. Compruebe las credenciales e inicie sesión con la cuenta correcta.",
  "What do you need help with?": "¿Con qué necesita ayuda?",
  "Whether it’s HTML, CSS, JS, or Liquid code, just describe what you need and let AI build it for you.": "Ya sea código HTML, CSS, JS o Liquid, simplemente describa lo que necesita y deje que la IA lo construya por usted.",
  "Working on it...": "En proceso...",
  "Write JavaScript code for form field validation to check phone field value is in the valid format.": "Escriba código JavaScript para validar el campo del formulario de forma que se compruebe que el valor del campo de teléfono tiene el formato válido.",
  "Write JavaScript code to highlight the row where email field is empty in table list.": "Escriba código JavaScript para resaltar la fila en la que el campo de correo electrónico está vacío en la lista de tablas.",
  "Write web API code to query active contact records.": "Escriba código de API web para consultar los registros de contactos activos.",
  "Yes": "Sí",
  "You are editing a live, public site ": "Está editando un sitio público activo ",
  "You can use this in <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot with @powerpages</a> and leverage best of both world.": "Puede usar esto en <a href=\"#\" id=\"github-copilot-link\">GitHub Copilot con @powerpages</a> y aprovechar lo mejor de ambos mundos.",
  "Your preview isn't updated. Please upload your site to see the latest changes.": "La vista previa no está actualizada. Cargue su sitio para ver los cambios más recientes.",
  "dotnet sdk 6.0 or greater must be installed/Do not translate 'dotnet' or 'sdk'": "debe estar instalado dotnet sdk 6.0 o una versión posterior",
  "{0} created!/{0} will be replaced by the entity type.": "Se ha creado {0}."
}